from aiogram.types import CallbackQuery

from keyboards.inline.category_main_buttons import category_main_choice
from loader import dp


@dp.callback_query_handler(text="main")
async def main_questions(call: CallbackQuery):
    await call.message.answer(
        'Основные вопросы:\n\n'
        '"Зачем ?" - Зачем нужна система маркировки?\n'
        '"Для кого ?" - Для кого нужна система маркировки?\n'
        '"Как это работает ?" - Как работает и из чего состоит процесс маркировки?\n'
        '"Фейк ?" - Что делать, если я нашел подделку?\n'
        '"Кто наносит ?" - Кто наносит цифровой знак на товар?\n'
        '"Нельзя подделать ?" - Почему код нельзя подделать?\n'
        '"Кто отвечает ?" - Кто отвечает за работу системы маркировки и прослеживаемости товаров?\n'
        '"Какие товары ?" - Какие товары уже сейчас маркируются?\n'
        '"ЦРПТ ?" - Почему оператором системы стал именно ЦРПТ?\n'
        '"Рост цен ?" - Вырастут ли из-за маркировки цены?\n'
        '"Эффективна ?" - Эффективна ли система маркировки?\n'
        '"Назад" - вернуться назад',
        reply_markup=category_main_choice,
    )

