from aiogram import types

from loader import dp


@dp.message_handler(commands=['about_marking'])
async def about_marking(message: types.Message):
    await message.reply(
        'Что делать с маркированными товарами при прекращении деятельности ИП?\n'
        'В случае прекращения деятельности в качестве ИП Вы не имеете право осуществлять оборот товаров, в том '
        'числе, использовать Личный кабинет участника оборота системы маркировки, до момента возобновления '
        'деятельности в качестве ИП. Все имеющиеся товары переходят в личную собственность физического лица.'
        'При возобновлении деятельности в качестве ИП у участника оборота возобновляется возможность проводить '
        'оборот маркированного товара, в том числе с использованием Личного кабинета.'
        'Что делать, если допустил ошибку в описании товара? Можно ли исправить?'
        'Товары, достоверные сведения о которых не переданы в информационный системе маркировки, считаются '
        'немаркированными (товарами без маркировки).'
        'При обнаружении сведений, не соответствующих фактическим характеристикам товара в информационном системе '
        'маркировки, КиЗ, нанесенные на данные товары, подлежат списанию как испорченные, а указанные товары – '
        'перемаркировке.'
        'При этом, Вам необходимо повторно описать товар на сайте информационной системы, обеспечивающего учет и '
        'хранение достоверных данных о товаре (ЮНИСКАН ГС1/РУС), получить GTIN и отправить соответствующие сведения '
        'в ИС маркировки.'
        'Является ли маркировка меховых изделий обязательной?'
        'Постановлением Правительства Российской Федерации от 11.08.2016 № 787 «О реализации пилотного проекта по '
        'введению маркировки товаров контрольными (идентификационными) знаками по товарной позиции «Предметы одежды, '
        'принадлежности к одежде и прочие изделия, из натурального меха» и признании утратившим силу постановления '
        'Правительства Российской Федерации от 24.03.2016 № 235» установлено, что маркировка меховых изделий '
        'обязательна c 12.08.2016.'
        'Пилотный проект означает, что обязательна маркировка только одного вида товаров – меховых изделий.'
        'На какую дату проверяется наличие задолженности при подаче заявления об изготовлении и о выдаче КиЗ?\n'
        'ФНС России проверяет наличие недоимки по налогам и сборам, задолженности по пеням и штрафам в соответствии '
        'с законодательством Российской Федерации о налогах и сборах, образовавшихся в результате осуществления '
        'предпринимательской деятельности на дату подачи заявления об изготовлении и о выдаче КиЗ.'
        'В каких случаях эмитент может отказать в изготовлении КиЗ?\n'
        '1. Нарушение участником оборота товаров условий договора с эмитентом.'
        '2. Отсутствие договора с эмитентом'
        'Требуется ли нотификация на контрольные (идентификационные) знаки?'
        'Нотификация не требуется.'
        'Как воспользоваться полным функционалом личного кабинета на сайте furs.mark.crpt.ru после одобрения '
        'заявления на регистрацию в системе маркировки?'
        'После одобрения заявления на регистрацию в системе маркировки товаров контрольными (идентификационными) '
        'знаками по товарной позиции «Предметы одежды, принадлежности к одежде и прочие изделия, из натурального '
        'меха» вам необходимо в разделе «Профиль» - «Роли» выбрать соответствующие деятельности вашего юридического'
        ' лица или Индивидуального предпринимателя роли:'
        'производитель;'
        'импортер;'
        'оптовик;'
        'розница.'
        'После этого вы сможете воспользоваться полным функционалом системы маркировки.'
        'С помощью какой электронной цифровой подписи осуществляется вход в личный кабинет на сайте furs.mark.crpt.ru?'
        'Вход в «Личный кабинет» осуществляется только по УКЭП, выданной в одном из удостоверяющих центров, '
        'аккредитованных Минкомсвязи России.'
        'Какие товары из меха следует маркировать?*'
        'Следует маркировать предметы одежды из натурального меха (норки, нутрии, песца, лисицы, кролика, зайца, '
        'енота, овчины и других видов меха) по товарной позиции 4303 единой Товарной номенклатуры внешнеэкономической '
        'деятельности Евразийского экономического союза (группа 43).'
        'К данной товарной позиции относятся все предметы одежды, изготовленные из:'
        'а) натурального меха;'
        'б) других материалов, имеющих подкладку из натурального меха;'
        'в) других материалов, у которых натуральный мех прикреплен с наружной стороны (кроме случаев, когда мех '
        'является только отделкой).'
        'Мех считается использованным лишь в качестве отделки, если он, например, составляет воротник и '
        'отвороты (при условии, что воротник и отвороты не увеличены до такой степени, что превращаются в целую'
        ' пелерину или болеро), манжеты или оторочку карманов, юбок, пальто и т.д.'
        'В данную товарную позицию не включаются:'
        'а) изделия первой части товарной позиции 4202;'
        'б) перчатки, рукавицы и митенки из кожи и натурального меха (товарная позиция 4203) (полностью выполненные '
        'из натурального меха, они включаются в данную товарную позицию);'
        'в) изделия группы 64;'
        'г) головные уборы и их части группы 65;'
        'д) изделия группы 95 (например, игрушки, игры и спортивный инвентарь).'
        '* В соответствии с пояснениями к Единой товарной номенклатуре Внешнеэкономической деятельности Таможенного'
        ' союза (ТН ВЭД ТС) Том 2, раздел VIII.'
        'В каких случаях следует маркировать товары из меха?'
        'Осуществлять маркировку товара следует в случае:'
        'если товары находятся у юридических лиц и индивидуальных предпринимателей (в собственности или на комиссии '
        'от физических лиц) по состоянию на 1 апреля 2016 года;'
        'предложения производителем товара для реализации;'
        'ввоза товаров на территорию Российской Федерации;'
        'принятия товара по договору комиссии от физического лица;'
        'реализации товара;'
        'передачи товара комиссионерам или агентам;'
        'приобретения товара;'
        'получения товара по договору комиссии или агентскому договору;'
        'возврата агентом или комиссионером нереализованного товара;'
        'уничтожения (списания) товара;'
        'обнаружения ошибки в информации, записанной на контрольный (идентификационный) знак (КиЗ);'
        'порчи (утери) КиЗ, которым был промаркирован товар.'
        'Чем маркируются товары из меха?'
        'Товары маркируются контрольными (идентификационными) знаками (КиЗ).'
        'Что такое контрольные (идентификационные) знаки?'
        'КиЗ — это бланк строгой отчетности с элементами (средствами) защиты от подделки '
        '(защищенная полиграфическая продукция), содержащий встроенную радиочастотную метку,'
        ' предназначенный для маркировки товаров.'
        'Виды контрольного (идентификационного) знака:'
        'а. шивной;'
        'б. клеевой;'
        'в. навесной (накладной).'
        'Размеры контрольного (идентификационного) знака'
        '25 мм x 160 мм'
        '53 мм x 80 мм'
        'Цвет контрольного (идентификационного) знака зависит от способа ввода товара в оборот. Если товар '
        'был произведен на территории Российской Федерации, то цвет контрольного (идентификационного) знака — зеленый.'
        'Если товар был везен на таможенную территорию Российской Федерации — то красный.'
        'Что означает цвет контрольного (идентификационного) знака?'
        'Контрольные (идентификационные) знаки бывают красного и зеленого цветов. Красными КиЗ обозначаются '
        'товары, ввезенные на таможенную территорию Российской Федерации, а зелеными — произведенные на '
        'территории Российской Федерации.'
        'Как заказать контрольные (идентификационные) знаки?'
        'Для заказа контрольных (идентификационных) знаков необходимо подать заявление в информационную систему '
        'маркировки, заключить договор с эмитентом (производителем КиЗ) и оплатить его услуги.'
        'Кто является эмитентом (производителем) КиЗ?'
        'Эмитентом контрольных (идентификационных) знаков является АО «Гознак» (www.goznak.ru).'
        'Сколько стоит изготовление КиЗ?'
        'Цена одного КиЗ зависит от его вида: для вшивных и клеевых — 15 рублей, для навесных (накладных) — '
        '22 рубля. В цену включен НДС.'
        'Какой срок изготовления контрольных (идентификационных) знаков?'
        'Срок изготовления КиЗ составляет 5 рабочих дней с момента поступления 100% оплаты на расчетный счет эмитента.'
        'Можно ли получить КиЗ в офисе эмитента?'
        'Да, можете по доверенности.'
        'Куда можно оформить доставку КиЗ?'
        'Доставка КиЗ осуществляется по адресу заказчика или, при желании, в многофункциональные центры. '
        'При этом доставка до административных центров субъектов Российской Федерации осуществляется '
        'бесплатно.'
        'Нужно ли платить за доставку КиЗ?'
        'Да, нужно, если доставка осуществляется не в административные центры субъектов Российской Федерации.'
        'Как проверить пригодность контрольных (идентификационных) знаков?'
        'Пригодность КиЗ проверяется при помощи специального RFID-оборудования.'
        'Какое оборудование необходимо для работы с контрольными (идентификационными) знаками?'
        'RFID-оборудование должно удовлетворять следующим требованиям:'
        'работа в диапазонах частот, соответствующих требованиям стандарта ISO 18000-63 (860 — 960 '
        'МГц для протокола UHF RFID);'
        'поддержка протокола передачи данных — EPCglobal UHF Class 1 Gen 2/ISO/IEC 18000-63:2013 и другие '
        'совместимые версии стандарта.'
        'Как наносить контрольные (идентификационные) знаки?'
        'В зависимости от вида КиЗ вы можете вшить, наклеить или навесить его на изделия.'
        'Способы и порядок нанесения КиЗ:'
        'а) вшивной — КиЗ на текстильной основе машинным способом вшивается непосредственно в конструктивный'
        ' шов изделия, полностью оставляя видимой содержащуюся в этом знаке графическую информацию. В этом случае'
        ' нанесение КиЗ выполняется при изготовлении товара путем вшивания такого знака в шов с внутренней стороны '
        '(изнанки) товара с использованием специального поля для вшивания;'
        'б) клеевой — КиЗ на самоклеящейся основе наклеивается на вшитый маркировочный ярлык. В этом случае нанесение '
        'КиЗ выполняется при наличии у товара маркировочного ярлыка, вшитого изготовителем и содержащего свободное '
        'поле достаточного размера для размещения на нем указанного знака без деформации. Нанесение КиЗ выполняется '
        'путем отделения защитного покрытия с клеевого слоя такого знака и приклеивания этого знака на свободное '
        'поле маркировочного ярлыка;'
        'в) навесной (накладной) — КиЗ на пластиковой основе крепится к изделию с помощью одноразового пломбирующего '
        'элемента, неотделимо крепится в петличное отверстие либо петлю-застежку переда изделия, а в случае их '
        'отсутствия — вшивную вешалку либо вшивную петлю держателя вешалки в виде металлической цепочки, пластины '
        'из металла и других материалов. Нанесение КиЗ выполняется путем продевания гибкого элемента пломбы КиЗ в '
        'петличное отверстие или петлю-застежку переда изделия, вшивную вешалку или вшивную петлю держателя вешалки '
        'и в запорное устройство пломбирующего элемента, исключающего его разъединение без разрушения.'
        'Есть ли особые требования к сертификату ключа усиленной квалифицированной электронной подписи для работы '
        'в ИС маркировки?'
        'Квалифицированный сертификат ключа электронной подписи должен быть выдан удостоверяющим центром,'
        ' аккредитованным Минкомсвязи России (www.minsvyaz.ru). Иных требований к сертификатам ключа '
        'электронной подписи в рамках пилотного проекта по маркировке изделий из натурального меха со '
        'стороны информационной системы маркировки не предъявляется.'
        'В какой момент производителям следует маркировать товары из меха?'
        'Производитель обязан осуществлять маркировку товаров до предложения этих товаров для реализации'
        ' (продажи), в том числе до их выставления в месте реализации, демонстрации их образцов или '
        'предоставления сведений о них в месте реализации.'
        'Какую информацию производитель передаёт в информационную систему?'
        'Производители при маркировке товаров передают в информационную систему следующую информацию:'
        'а) идентификационный номер налогоплательщика;'
        'б) 10-значный код товара по единой Товарной номенклатуре внешнеэкономической деятельности '
        'Евразийского экономического союза;'
        'в) идентификатор контрольного (идентификационного) знака;'
        'г) глобальный идентификационный номер торговой единицы (далее —GTIN);'
        'д) идентификатор чипа радиочастотной метки контрольного (идентификационного) знака (далее — TID);'
        'е) серийный глобальный идентификационный номер торговой единицы (далее — SGTIN).'
        'В какой момент импортерам следует маркировать товары (при импорте из стран, не участвующих в ЕАЭС)?'
        'Импортеры осуществляют маркировку товаров до их ввоза на территорию Российской Федерации, '
        'за исключением информации о номере декларации, GTIN и SGTIN.'
        'При этом импортеры записывают SGTIN на контрольный (идентификационный) знак и сообщают в '
        'информационную систему сведения о номере таможенной декларации, GTIN и SGTIN до предложения '
        'данного товара для продажи.'
        'В какой момент следует маркировать товары при трансграничной торговле (при ввозе товаров из стран, '
        'участвующих в ЕАЭС)?'
        'Товары, ввозимые на территорию Российской Федерации из стран-участниц ЕАЭС, следует промаркировать до'
        ' их ввоза на территорию Российской Федерации в части сообщения сведений в информационную систему'
        ' (нанесенные поставщиком контрольные (идентификационные) знаки заменять не нужно).'
        'Какую информацию импортеры сообщают в информационную систему (при импорте из стран, не участвующих в ЕАЭС)?'
        'Импортеры товаров при их маркировке передают в информационную систему следующую информацию:'
        'а) идентификационный номер налогоплательщика;'
        'б) 10-значный код товара по единой Товарной номенклатуре внешнеэкономической деятельности Евразийского '
        'экономического союза;'
        'в) регистрационный номер декларации на товары;'
        'г) идентификатор контрольного (идентификационного) знака;'
        'д) глобальный идентификационный номер торговой единицы (далее —GTIN);'
        'е) идентификатор чипа радиочастотной метки контрольного (идентификационного) знака (далее — TID);'
        'ж) серийный глобальный идентификационный номер торговой единицы (далее — SGTIN);'
        'з) вид меха.'
        'Какую информацию организация-получатель передает в информационную систему при ввозе товара с '
        'территории стран-участниц ЕАЭС?'
        'Следует передать в информационную систему следующую информацию:'
        'а) идентификатор контрольного (идентификационного) знака и (или) TID, и (или) SGTIN;'
        'б) идентификационный номер налогоплательщика — юридического лица или индивидуального предпринимателя,'
        ' приобретающего товар в рамках трансграничной торговли;'
        'в) код страны импорта товара;'
        'г) стоимость товара, согласно первичным документам.'
        'Какую информацию следует передавать в информационную систему при оптовой торговле, а также передаче '
        'товаров по договорам комиссии и агентским договорам?'
        'При оптовой торговле, а также передаче товаров по договорам комиссии и агентским договорам сторона, '
        'передающая '
        'товары, предоставляет в информационную систему следующую информацию:'
        'а) идентификатор контрольного (идентификационного) знака и (или) TID, и (или) SGTIN;'
        'б) вид оборота товара (продажа, комиссия, агентский договор и др.);'
        'в) идентификационный номер налогоплательщика (продавца);'
        'г) идентификационный номер налогоплательщика (покупателя);'
        'д) номер и дата первичных документов, подтверждающих оборот товара;'
        'е) стоимость товара, согласно первичным документам (в случае реализации (продажи).'
        'При этом сторона, получающая товары, должна подтвердить в информационной системе '
        'предоставленную передающей стороной информацию.'
        'В какой момент следует маркировать товар при оптовой реализации, передаче '
        'товара на комиссию (реализацию по агентскому договору)?'
        'Участники маркируют товар в течение 3-х дней с даты отгрузки товара.'
        'Какую информацию следует передавать в информационную систему комиссионерам, '
        'получившим товары на комиссию от физических лиц, приобретенные ими для личного пользования?'
        'Комиссионерам следует предоставлять в информационную систему следующую информацию:'
        'а) идентификатор контрольного (идентификационного) знака и (или) TID, и (или) SGTIN;'
        'б) идентификационный номер налогоплательщика, осуществляющего комиссионную торговлю, — '
        'заказчика контрольного (идентификационного) знака.'
        'В какие сроки комиссионеры, получившие товары на комиссию от физических лиц, не являющихся '
        'индивидуальными предпринимателями, передают информацию в информационную систему?'
        'Комиссионер передает информацию в информационную систему в самостоятельно выбранные сроки, но не '
        'позднее предложения товара для продажи.'
        'Какая информация передается в информационную систему при розничной продаже или уничтожении товара?'
        'Юридические лица и индивидуальные предприниматели, осуществляющие розничную '
        'торговлю товарами, включенными в перечень, представляют в информационную систему '
        'следующие сведения о контрольных (идентификационных) знаках, нанесенных на товар, '
        'реализованный (проданный) в рамках такой торговли или уничтоженный (утерянный), по каждой '
        'единице реализованного (проданного) товара в электронном виде:'
        'а) идентификатор контрольного (идентификационного) знака и (или) TID, и (или) SGTIN;'
        'б) способ вывода товара из оборота (продажа, уничтожение);'
        'в) идентификационный номер налогоплательщика, осуществившего вывод товара из оборота;'
        'г) дата вывода товара из оборота;'
        'д) в случае уничтожения (утери) товара — реквизиты акта;'
        'е) стоимость товара, согласно первичным документам (в случае реализации (продажи).'

        'Какой порядок действий при возврате товара в розничный магазин?'
        'В случае если товар возвращен в течение срока, установленного законодательством для'
        ' возврата (обмена) товара надлежащего качества, и целостность'
        ' контрольного (идентификационного) знака сохранена, то товар не'
        ' перемаркируется, и в информационную систему представляются следующие сведения в электронном виде:'
        'а) идентификационный номер налогоплательщика;'
        'б) идентификатор контрольного (идентификационного) знака и (или) TID, и (или) SGTIN;'
        'в) реквизиты документов, подтверждающих возврат товара.'

        'В случае если контрольный (идентификационный) знак был поврежден '
        'или уничтожен и (или) возврат (обмен) товара производится в срок, превышающий '
        'установленный законодательством для возврата (обмена) товара надлежащего качества, продавец '
        'не позднее момента предложения этих товаров для продажи маркирует такие товары контрольными '
        '(идентификационными) знаками и представляет в информационную систему по каждой единице товара '
        'следующие обязательные сведения об использовании контрольных (идентификационных) знаков:'
        'а) идентификационный номер налогоплательщика;'
        'б) идентификатор контрольного (идентификационного) знака (старый, при возможности установления);'
        'в) идентификатор контрольного (идентификационного) знака (новый) и TID (новый), и (или) SGTIN (новый);'
        'г) реквизиты документов, подтверждающих возврат товара.'
        'Нужно ли маркировать товар, полученный сервисным центром (ателье, химчистка) от '
        'физического лица и приобретенный им для личного пользования?'
        'Не нужно.'

        'Каков порядок действий при порче контрольного (идентификационного) знака во время предпродажной '
        'подготовки (химчистка)?'
        'Собственник товара сообщает сведения о порче контрольных (идентификационных) знаков в информационную '
        'систему и перемаркировывает товар в соответствии с Правилами.'
        'Каков порядок маркировки при производстве товаров подрядным способом?'
        'При производстве товара подрядным способом осуществить маркировку следует первому юридическому лицу или '
        'индивидуальному предпринимателю, принимающему товар (готовую продукцию) на баланс.'
        'Данный товар подлежит маркировке до предложения его для продажи.'
        'Каков порядок и сроки внесения сведений в информационную систему при продаже товара, '
        'принадлежащего юридическому лицу или индивидуальному предпринимателю, комиссионером?'
        'При передаче товара на комиссию сведения о такой передаче сообщаются в информационную систему.'
        ' При розничной продаже комиссионер в течение 3-х рабочих дней сообщает в информационную систему сведения '
        'о выводе товара из оборота аналогично с обычной розничной продажей.'
        'Каков порядок маркировки при возврате товара агентом принципалу?'
        'В информационную систему сообщаются следующие сведения:'
        'а) идентификатор контрольного (идентификационного) знака и (или) TID, и (или) SGTIN;'
        'б) вид оборота товара (агентский договор);'
        'в) идентификационный номер налогоплательщика (передающей стороны);'
        'г) идентификационный номер налогоплательщика (получателя);'
        'д) номер и дата первичных документов, подтверждающих оборот товара.'

        'Каков порядок маркировки при возврате товара комиссионером комитенту (юридическому лицу или'
        ' индивидуальному предпринимателю)?'
        'В информационную систему сообщаются следующие сведения:'
        'а) идентификатор контрольного (идентификационного) знака и (или) TID, и (или) SGTIN;'
        'б) вид оборота товара (комиссия);'
        'в) идентификационный номер налогоплательщика (передающей стороны);'
        'г) идентификационный номер налогоплательщика (получателя);'
        'д) номер и дата первичных документов, подтверждающих оборот товара.'

        'Каков порядок маркировки при возврате товара комиссионером комитенту (физическому лицу)?'
        'Такой возврат является выводом товара из оборота.'
        'При этом в информационную систему сообщаются следующие сведения:'
        'а) идентификатор контрольного (идентификационного) знака и (или) TID, и (или) SGTIN;'
        'б) способ вывода товара из оборота (возврат товара, принятого на комиссию);'
        'в) идентификационный номер налогоплательщика, осуществившего вывод товара из оборота;'
        'г) дата вывода товара из оборота;'
        'д) реквизиты первичного документа, подтверждающего возврат товара.'
        'Какой порядок маркировки при экспортной продаже товара за границу ЕАЭС?'
        'Такой вид продажи является выводом товара из оборота. При этом в '
        'информационную систему сообщаются следующие сведения:'
        'а) идентификатор контрольного (идентификационного) знака и (или) TID, и (или) SGTIN;'
        'б) способ вывода товара из оборота (продажа);'
        'в) идентификационный номер налогоплательщика, осуществившего вывод товара из оборота;'
        'г) дата вывода товара из оборота;'
        'е) стоимость товара, согласно первичным документам.\n\n'

        'Какой порядок маркировки при индивидуальном пошиве товара по заказу физического лица?\n'
        'В этом случае товар не маркируется.\n'

        'Какой порядок маркировки товара при передаче юридическим лицом или индивидуальным предпринимателем'
        ' в сервисный центр (ателье, химчистка)?'
        'При передаче товара в сервисный центр маркировка не осуществляется.'

        'Какой порядок маркировки при передаче товара юридическим лицом или индивидуальным предпринимателем '
        'на ответственное хранение?'
        'При передаче товара на ответственное хранение маркировка не производится (в части передачи информации '
        'в информационной системе).'

        'Какой порядок маркировки товара, принятого от физического лица и приобретенного им для личного пользования,'
        ' на ответственное хранение?'
        'При ответственном хранении товаров (и иных услуг, не связанных с реализацией (продажей) товаров), '
        'принадлежащих физическим лицам и приобретенных ими для личного пользования, маркировка не осуществляется.'

        'Можно ли внести исправления при обнаружении ошибки в информации, записанной на контрольные '
        'идентификационные знаки?'
        'При обнаружении ошибки в информации, записанной на контрольные идентификационные знаки, после '
        'передачи информации в информационную систему, исправления внести нельзя. Следует заменить контрольные '
        'идентификационные знаки на новые аналогично с заменой в случае порчи (утери) контрольных идентификационных '
        'знаков.'

        'Может ли покупатель увидеть в информационной системе цену покупки/продажи товара по сделкам между другими '
        'участниками оборота данного товара?'
        'Цены покупки/продажи по сделкам между другими участниками оборота не '
        'являются публичной информацией. Покупателю '
        'данная информация доступна не будет.'
        
        'Как перемаркировать товар в случае порчи (утери, уничтожении) КиЗ?'
        'В соответствии с пунктом 17 Правил в случае порчи (утери, уничтожения) КиЗ, '
        'участники оборота товаров осуществляют'
        ' их списание на основании соответствующего акта о порче (утере, уничтожении) контрольных (идентификационных) '
        'знаков и представляют не позднее рабочего дня, следующего за датой составления акта о порче '
        '(утере, уничтожении) контрольных (идентификационных) знаков, в информационный ресурс маркировки '
        'сведения, предусмотренные приложением № 4 к Правилам.'
        'Далее, в течение 20 рабочих дней и до предложения этих товаров для реализации (продажи), в том числе до'
        ' их выставления в месте реализации (продажи), демонстрации их образцов или предоставления сведений '
        'о них в месте реализации (продажи) осуществляют перемаркировку товара и предоставляют сведения, '
        'предусмотренные приложением № 3 к Правилам, в ИР маркировки.'
        'Для этого Вам необходимо в разделе «Списание КиЗ» в Личном кабинете Информационного ресурса маркировки'
        ' осуществить списание КиЗ, а также в разделе «Перемаркировка товара» перемаркировать данный товар.'
        'При этом перемаркировка данного товара осуществляется с помощью КиЗов, предназначенных для маркировки'
        ' товаров, '
        'произведенных на территории Российской Федерации или ввезенных на территорию Российской Федерации, '
        'поставленных на учет и вводимых в оборот после вступления в силу Соглашения о реализации в 2015-2016 '
        'годах пилотного проекта по введению маркировки товаров контрольными (идентификационными) знаками '
        'по товарной позиции «Предметы одежды, принадлежности к одежде и прочие изделия, из натурального меха».\n\n'

        'Как описать свои товары?\n'
        'Если компания не является членом Ассоциации автоматической идентификации «ЮНИСКАН/ГС1 РУС», '
        'необходимо вступить в ассоциацию и получить доступ в личный кабинет, для этого:\n'

        'Заполнить заявление на вступление (в электронном виде) http://app.gs1ru.org/;\n'
        'После заполнения подписать заявление УКЭП. Подписанное заявление поступит на обработку в'
        ' ГС1 РУС и Вам будет выслан счет на оплату вступительного взноса;\n'
        'Оплатить вступительный взнос на основании счета.\n'
        'Более подробно порядок вступления в ГС1 РУС описан на сайте ассоциации http://www.gs1ru.org/join_order.\n'

    )


@dp.message_handler(commands=['how_to_register'])
async def how_to_register(message: types.Message):
    await message.reply(
        """Для того чтобы стать участником оборота системы маркировки изделий из меха, необходимо выполнить следующие действия:

1. Для входа в Личный кабинет участника оборота системы маркировки изделий из меха необходимо, чтобы на вашем компьютере было установлено необходимое программное обеспечение, установлены сертификаты ключей проверки электронной подписи и выполнены определенные настройки. Нажмите кнопку «Проверка доступа» - система автоматически проверит возможность подключения вашего компьютера и предоставит инструкции по дальнейшей настройке.

Для юридического лица при первом входе в «Личный кабинет» необходимо использовать усиленную квалифицированную электронную подпись руководителя организации.
В дальнейшем для работы в Личном кабинете участника оборота системы маркировки изделий из меха можно подключать других сотрудников организации следуя Инструкции.

2. При необходимости установите программное обеспечение и сертификаты ключей проверки электронной подписи.

3. Теперь вы можете начать работу в «Личном кабинете», для этого нажмите кнопку «Войти в личный кабинет». 

Если у вас нет электронной подписи, то ее можно оформить в одном из удостоверяющих центров, аккредитованных Минкомсвязи России.
Перечень аккредитованных удостоверяющих центров""")



@dp.message_handler(commands=['how_to_describe'])
async def how_to_describe(message: types.Message):
    await message.reply(
        """Если компания не является членом Ассоциации автоматической идентификации «ЮНИСКАН/ГС1 РУС», необходимо вступить в ассоциацию и получить доступ в личный кабинет, для этого:

Заполнить заявление на вступление (в электронном виде) http://app.gs1ru.org/;
После заполнения подписать заявление УКЭП. Подписанное заявление поступит на обработку в ГС1 РУС и Вам будет выслан счет на оплату вступительного взноса;
Оплатить вступительный взнос на основании счета.
Более подробно порядок вступления в ГС1 РУС описан на сайте ассоциации http://www.gs1ru.org/join_order.

Инструкция для заполнения""")


@dp.message_handler(commands=['how_to_order'])
async def how_to_order(message: types.Message):
    await message.reply(
        """Изготовлением контрольных (идентификационных) знаков (КиЗ) занимается эмитент – Акционерное общество «Гознак» после одобрения оператором системы цифровой маркировки Честный ЗНАК, заявления на изготовление КиЗ.

1. Заключите договор с эмитентом на https://markirovka.goznak.ru/.

2. Подайте заявление на изготовление КиЗ в Личном кабинете:

«Личный кабинет» - «Меню» – «Заказы на изготовление КиЗ» - «Добавить» - введите произвольный номер заказа в поле «Номер заказа» - «Сохранить»;
введите номер и дату договора с эмитентом в полях «№ договора с эмитентом» и «Дата договора с эмитентом»;
выберите способ получения КиЗ в поле «Способ получения изготовленных КиЗ»: «Самовывоз (из Перми)» или «Доставка эмитентом».
В случае указания способа получения КиЗ «Доставка эмитентом» заполните поле «Адрес доставки».

нажмите кнопку «+ Добавить»;
в позиции заказа выберите «способ выпуска товара в оборот»: «Производство товара на территории РФ» или «Ввоз товара на территорию РФ»;
укажите «Способ ввода товара в обращение» - «Товар, вводимый в оборот после 12 августа 2016 года»;
выберите категорию КиЗ (вшивной, клеевой или навесной), а также необходимое количество;
если Вы хотите заказать КиЗ с индивидуализацией, то поставьте галку в поле «С индивидуализацией», а также выберите необходимые GTIN в поле GTIN.
Будьте внимательны при заполнении всех полей при подаче заявления об изготовлении и о выдаче КиЗ. Вносить изменения в заявления невозможно.
В случае допущения ошибки Вам необходимо оформить заявления об изготовлении и о выдаче КиЗ заново.

Срок рассмотрения заявления у Оператора системы маркировки – 5 рабочих дней.

Оператор ЦРПТ направляет заявление эмитенту в случае соответствия юридического лица или индивидуального предпринимателя следующим положениям:

наличие сведений о заявителе в Едином государственном реестре юридических лиц или Едином государственном реестре индивидуальных предпринимателей как о действующем юридическом лице или индивидуальном предпринимателе;
отсутствие в отношении заявителя (юридического лица) в ЕГРЮЛ записи о недостоверности сведений, внесенной в соответствии с пунктом 5 и (или) 6 статьи 11 Федерального закона «О государственной регистрации юридических лиц и индивидуальных предпринимателей»;
отсутствие у заявителя недоимки по налогам и сборам, задолженности по пеням и штрафам в соответствии с законодательством Российской Федерации о налогах и сборах;
отсутствие вступившего в силу и неисполненного решения о привлечении к ответственности за нарушение Правил маркировки товаров;
представление заявителем сведений, по форме и содержанию соответствующих требованиям, установленным Правилами маркировки товаров.
3. Оплатите изготовление КиЗ эмитенту

Счет за изготовление КиЗ отправляется эмитентом по электронной почте или иным способом, в соответствии с условиями договора с эмитентом.

Стоимость КиЗ с учетом налога на добавленную стоимость  регламентируется п. 1,3 договора с Гознаком https://markirovka.goznak.ru/ и составляет 15 рублей для вшивного и клеевого и 22 рубля для навесного (накладного). 

Эмитент изготавливает КиЗ в течение 5 рабочих дней с момента поступления полной оплаты на расчетный счет.

Эмитент может отказать в выдаче участнику оборота товаров контрольных (идентификационных) знаков в случаях нарушения участником оборота товаров условий договора с эмитентом или в случае отсутствия данного договора.

4. Получите КиЗ

Информация о готовности КиЗ отображается в графе «Статус» раздела «Заказы на изготовление КиЗ» в Личном кабинете участника оборота:

Доставка КиЗ: 
• самовывоз – бесплатно;
• по указанному адресу – за дополнительную стоимость.
5. Проверьте КиЗ

Проверьте количество КиЗ и их пригодность при помощи специального RFID-оборудования. Непригодные КиЗ возвращаются эмитенту (или иное в соответствии с договором с эмитентом).

6. Отметьте поступление КиЗ

В течение 3-х рабочих дней с момента получения КиЗ отметьте их поступление в разделе «Поступление КиЗ» Личного кабинета участника оборота.""")


@dp.message_handler(commands=['how_to_label'])
async def how_to_label(message: types.Message):
    await message.reply(
        """Выпуск товаров в оборот (то есть их отгрузка или продажа) возможен только после их маркировки и передачи сведений в систему маркировки.

1. Маркировка товаров неиндивидуализированными КиЗ (КиЗ заказаны без индивидуализации):

произведите запись серийного глобального идентификационного номера торговых единиц в КиЗ с помощью RFID-оборудования и воспользовавшись:
— программным обеспечением для считывания и записи информации на КиЗ;
— самостоятельно разработанным программным обеспечением (Техническая документация).
сформируйте XML файл;
загрузите сформированный XML файл в раздел: «Личный кабинет — «Сведения о маркировке» — «Загрузить из файла XML»;
нажмите «Подписать и отправить»;
нанесите данные КиЗ на соответствующие товары.
Также вы можете обратиться к организациям, оказывающим подобные услуги.
2. Маркировка индивидуализированными КиЗ (КиЗ заказаны с индивидуализацией):
зайдите в раздел: «Личный кабинет — «Сведения о маркировке» — «+ Маркировка индивидуализированных»;
выберите дату персонализации и маркировки — нажмите «Сохранить»;
нажмите «+ Добавить» — и выберите действие: «Маркировка новой продукции» / «Маркировка товара, принятого на комиссию»;
выберите соответствующие КиЗ и нажмите «Выбрать»;
нажмите «Подписать и отправить»;
нанесите данные КиЗ на соответствующие товары.
Способы и порядок нанесения КиЗ:

а) вшивной — КиЗ на текстильной основе машинным способом вшивается непосредственно в конструктивный шов изделия, полностью оставляя видимой содержащуюся в этом знаке графическую информацию. В этом случае нанесение КиЗ выполняется при изготовлении товара путем вшивания такого знака в шов с внутренней стороны (изнанки) товара с использованием специального поля для вшивания;

б) клеевой — КиЗ на самоклеящейся основе наклеивается на вшитый маркировочный ярлык. В этом случае нанесение КиЗ выполняется при наличии у товара маркировочного ярлыка, вшитого изготовителем и содержащего свободное поле достаточного размера для размещения на нем указанного знака без деформации. Нанесение КиЗ выполняется путем отделения защитного покрытия с клеевого слоя такого знака и приклеивания этого знака на свободное поле маркировочного ярлыка;

в) навесной (накладной) — КиЗ на пластиковой основе крепится к изделию с помощью одноразового пломбирующего элемента, неотделимо крепится в петличное отверстие либо петлю-застежку переда изделия, а в случае их отсутствия — вшивную вешалку либо вшивную петлю держателя вешалки в виде металлической цепочки, пластины из металла и других материалов. Нанесение КиЗ выполняется путем продевания гибкого элемента пломбы КиЗ в петличное отверстие или петлю-застежку переда изделия, вшивную вешалку или вшивную петлю держателя вешалки и в запорное устройство пломбирующего элемента, исключающего его разъединение без разрушения.""")


@dp.message_handler(commands=['requirements_for'])
async def requirements_for(message: types.Message):
    await message.reply(
        """Для выполнения функции считывания и записи информации на КиЗ, а также проверки работоспособности КиЗ при получении необходимо оборудование, поддерживающее стандарт EPC Global Class 1 Gen2/ISO 18000-6C, а также работающее на стандартной частоте EPC Gen2.

В настоящее время бесплатное программное обеспечение для считывания и записи информации на КиЗ, а также для проверки работоспособности КиЗ, поддерживается двумя типами оборудования:

стационарный считыватель Bookos 2.0FE;
мобильный считыватель - ATID AT-870.
Техническая документация
ПО для мобильного считывателя
ПО для стационарного считывателя""")

@dp.message_handler(commands=['how_to_import'])
async def how_to_import(message: types.Message):
    await message.reply(
        """1. Закажите КиЗ.

2. Нанесите КиЗ на товар:

Нанесите красные контрольные (идентификационные) знаки без индивидуализации на товары:

— с помощью иностранного производителя или поставщика;

— на таможенном складе до помещения под таможенные процедуры выпуска для внутреннего потребления или реимпорта.

3. Если КиЗ выпущен без индивидуализации, внесите информацию в Личный кабинет:

зайдите в раздел «Импорт товара» — Личного кабинета;
нажмите «Добавить» — «Да», чтобы создать новый документ;
в открывшемся документе нажмите «+Добавить»;
заполните поле «Номер КиЗ»;
выберите из списка код ТНВЭД в поле «ТНВЭД»;
выберите из списка вид меха в поле «Вид меха» в случае указания в поле «ТНВЭД» кода «4303109080 предметы одежды прочие <*>»;
заполните поле «Описание товара» в свободной форме, позволяющее идентифицировать товар в Декларации на товары;
нажмите «Сохранить» и «Подписать и отправить».
4. Пройдите стандартные таможенные процедуры, указав в графе 31 Декларации на товары советующие номера КиЗ.

5. Промаркируйте товар и сообщите об этом в Информационную систему маркировки до момента предложения товара в продажу.

Промаркируйте товар и сообщите об этом в Личном кабинете участника оборота.""")


@dp.message_handler(commands=['shipping'])
async def shipping(message: types.Message):
    await message.reply(
        """Движение маркированных товаров до конечного покупателя отслеживается в Информационной системе маркировки, поэтому при их отгрузке сообщайте информацию об этом.

При отгрузке товара оптовым или розничным продавцам введите информацию об этом в разделе «Меню / Работа с маркированным товаром / Реализация» системы маркировки.""")


@dp.message_handler(commands=['retailing'])
async def retailing(message: types.Message):
    await message.reply(
        """Движение маркированных товаров до конечного покупателя отслеживается в Информационной системе маркировки, поэтому при их продаже сообщайте информацию об этом.

При продаже товара покупателю введите информацию об этом в разделе «Меню / Работа с маркированным товаром / Розничная продажа» системы маркировки.""")


@dp.message_handler(commands=['badge_damaged'])
async def badge_damaged(message: types.Message):
    await message.reply(
        """Если у вас оказался товар с утерянным или испорченным КиЗ, его необходимо промаркировать повторно.

1. Оформите списание КиЗ на основании акта о порче, утере или уничтожении.

2. В течение 1 рабочего дня внесите информацию о списании КиЗ в разделе «Личный кабинет: Учет КиЗ» системы маркировки.

3. В течение 17 рабочих дней промаркируйте товар новым КиЗ.

4. Занесите информацию о маркировке в раздел «Личный кабинет: Учет КиЗ» системы маркировки.""")
