from aiogram import types

from loader import dp

@dp.message_handler(commands=['general'])
async def general(message: types.Message):
    await message.reply(
        """Как осуществляется ввоз импортного товара, подлежащего обязательной маркировке
Согласно Рекомендованный алгоритм по ввозу на территорию РФ импортного товара из стран вне ЕАЭС (pdf, 261 Кб)
Какие товары легкой промышленности подлежат маркировке?
В соответствии с постановлением Правительства Российской Федерации от 31.12.2019 г. № 1956 маркировке подлежат изделия легкой промышленности согласно кодам товарной номенклатуры:

ТН ВЭД ЕАЭС: 4203 10 000, 6106, 6201, 6202, 6302
ОКПД2: 14.11.10, 14.14.13, 14.13.21, 14.13.21, 13.92.12, 13.92.13, 13.92.14

Сколько стоит код маркировки за единицу товара?
Постановлением Правительства РФ от 08.05.2019 № 577 утверждена плата за оказание услуг по предоставлению кодов маркировки, необходимых для формирования средств идентификации и обеспечения мониторинга движения товаров, подлежащих обязательной маркировке средствами идентификации в размере 50 копеек (без НДС). Цена включает формирование кода маркировки и предоставление его участнику оборота товара (УОТ) с использованием личного кабинета или с использованием интеграции системы маркировки с учетной системой УОТ (1С.Предприятие, SAP и пр. ERP). Стоимость не варьируется от количества заказываемых товаров, стоимость неизменна.

Срок действия КМ после забора из системы управления заказами
Срок действия кода маркировки бессрочен. В п.41 постановления Правительства Российской Федерации от 31.12.2019 г. № 1956 указан срок 60 рабочих дней на забор и преобразование кода маркировки в средство идентификации из системы управления заказами.

В течение какого времени обрабатывается заказ КМ в СУЗ?
В соответствии с п.40. постановлением Правительства Российской Федерации от 31.12.2019 г. № 1956 в течение 4 часов с момента регистрации заявки в информационной системе мониторинга оператор с использованием средств информационной системы мониторинга формирует (генерирует) указанное в заявке количество кодов маркировки и включает соответствующие коды идентификации в информационную систему мониторинга.

Когда начнется обязательная маркировка товаров легкой промышленности?
В соответствии с постановлением Правительства Российской Федерации от 31.12.2019 г. № 1956 обязательная маркировка товаров легкой промышленности наступает 01.01.2021 года. При этом товары нереализованные на 01.01.2021 года и введенные до этой даты в оборот, а также ввезенные в Российскую Федерацию после 01.01.2021 г., но приобретенные до 01.01.2021 г. маркируются до 01.02.2021 г.

Где зарегистрироваться, на каком сайте для маркировки товаров?
Участнику оборота товаров, который реализует товары подлежащие обязательной маркировке необходимо зарегистрироваться на сайте Честныйзнак.рф в Государственной информационной системы мониторинга на сайте. Иные сайты, которые предлагают зарегистрироваться в Государственной информационной системы мониторинга не являются официальными. Просим Вас внимательно отнестись к регистрации в системе.

Что необходимо для регистрации в Государственной информационной системы мониторинга?
Чтобы зарегистрироваться в Государственной информационной системы мониторинга Вам понадобиться усиленная квалифицированная электронная подпись, полученная на представителя организации, действующего без доверенности, которую Вы можете получить в одном из аккредитованных в Министерстве цифрового развития, связи и массовых коммуникаций удостоверяющих центров. Список аккредитованных в Минкомсвязи удостоверяющих центров доступен на сайте Министерства цифрового развития, связи и массовых коммуникаций.

Какое оборудование понадобиться для работы с маркированным товаром?
Для работы с маркированным товаром Вам понадобится из оборудования: усиленная квалифицированная электронная подпись, принтер, 2D сканер штрихкода, контрольно-кассовая техника (в случае если вы являетесь розничным продавцом). А также интеграция с Государственной информационной системы мониторинга. Интеграция между участниками оборота товаров и ГИС МТ происходит посредством открытого протокола API (описание методов находится в едином личном кабинете участника оборота товаров в разделе Помощь).

Где найти инструкции по работе с Государственной информационной системы мониторинга?
Инструкции по работе с Государственной информационной системой мониторинга расположены на сайте.
А также в едином личном кабинете участник оборота товаров может ознакомиться с инструкциями в разделе помощь — под значком 

Куда наносить коды маркировки на товаре?
Согласно п.46 постановления Правительства Российской Федерации от 31.12.2019 г. № 1956 Средство идентификации наносится на товар, или на потребительскую упаковку, или этикетку, или ярлык методом, не допускающим отделения средства идентификации.

В случае формирования набора товаров средство идентификации наносится на потребительскую упаковку набора товаров или этикетку, располагаемую на такой потребительской упаковке, а также на потребительскую упаковку товаров, входящую в состав этого набора товаров, или этикетку, располагаемую на такой потребительской упаковке.

В случае формирования комплекта товаров средство идентификации наносится на потребительскую упаковку комплекта товаров или этикетку, располагаемую на такой потребительской упаковке.

Какой срок ввода кодов маркировки в оборот?
Коды маркировки, как и товар должны быть введены в оборот до даты предложения данного товара с кодом маркировки к реализации (продаже)."""
    )
