import requests

from aiogram import types
from bs4 import BeautifulSoup

from loader import dp


def get_html():
    """Getting html page content"""
    url = 'https://честныйзнак.рф/vopros-otvet/'
    page = requests.get(url).text
    soup = BeautifulSoup(page, 'html.parser')
    return soup


def get_headers():
    """Getting headers from categories"""
    soup = get_html()
    titles = []
    for i in soup.find_all('i'):
        header = str(i.text)
        titles.append(header.strip())

    return titles


def get_paragraphs():
    """Getting paragraphs from categories"""
    soup = get_html()
    paragraphs = []
    for i in soup.findAll('div', {'class': 'faq-list1__hide'}):
        p = str(i.text)
        paragraphs.append(p.strip())

    return paragraphs


@dp.message_handler(commands=['what_for'])
async def what_for(message: types.Message):
    await message.reply(
        f'{str(get_headers()[0])}\n\n'
        f'{str(get_paragraphs()[0])}'
    )


@dp.message_handler(commands=['efficiency'])
async def work_process(message: types.Message):
    await message.reply(
        'Эффективна ли система маркировки?\n\n'
        'По ряду товарных категорий маркировка показала эффект от обеления рынка.\n'
        'Например, Discovery Research Group до появления маркировки оценивала объем российского рынка обуви '
        'в 329 млн пар. Система маркировки показала, что цифры серьезно занижены, чем считалось. '
        'Так, сейчас в системе «Честный знак» уже выпущено более '
        '2 млрд кодов для маркировки обуви и рост продолжается.\n'
        'Маркировка табака за прошедшее время позволила выявить на рынке на 30% больше табачных производителей. '
        'В конце 2018 — начале 2019 годов эти фабрики начали передавать в '
        'ФНС сведения о максимальной розничной цене (МРЦ). Подачу данных в ФНС также возобновили компании, '
        'которые были зарегистрированы несколько лет назад, но не подавали информацию об МРЦ. '
        'Это говорит о том, что они с большой долей вероятности выпускали продукцию без акцизов, '
        'что из-за появления маркировки стало невозможным.\n'
        'Эксперимент по маркировке привел к снижению контрафакта и в той категории, '
        'где он в прямом смысле опасен для жизни. По оценкам Росздравнадзора, '
        'оборот недоброкачественных лекарств за это время снизился в 2,5 раза. '
        'По подсчетам BIOCAD, нелегальный рынок дорогостоящих онкологических препаратов сократился в 10 раз. '
        'При этом в 2018 году на рынке появилось 568 новых наименований лекарств стоимостью до 20 руб., '
        'а на 440 таких медикаментов цена еще сократилась, следует из данных DSM Group. Это может быть связано с тем, '
        'что препараты дешевле 20 руб. маркируются за счет ЦРПТ.\n'
        'В легкой промышленности доля нелегального оборота за три года сократилась с 31% до 18%, сообщил Минпромторг. '
        'Это значит, что около 375 млрд руб. продаж изделий из ткани, одежды и пр. вышли из тени. '
        'С учетом всего размера российского рынка одежды, обуви и аксессуаров '
        '(2,3 трлн руб., по оценкам Fashion Consulting Group), в серой зоне остается еще более 400 млрд руб.\n'
        'Опыт других стран тоже демонстрирует позитивные эффекты от внедрения маркировки. '
        'Например, в Бразилии за первые два года собираемость налогов выросла на 20% в сегменте пива и безалкогольных '
        'напитков, на 40% — в сегменте табачных изделий. В Турции объемы нелегальных продаж сигарет снизились на 11% '
        'за первые три года. В странах ЕС система цифровой прослеживаемости снизила оборот контрабандной продукции '
        'на 30% за 5 лет. Большая часть этой выручки перешла к легальным производителям. '
    )


@dp.message_handler(commands=['price_growth'])
async def work_process(message: types.Message):
    await message.reply(
        'Вырастут ли из-за маркировки цены?\n\n'
        'После внедрения маркировки стоимость товаров легальных производителей со временем снизится.\n'
        'На потребителя не лягут расходы на приобретение оборудования для маркировки, их возьмет на себя бизнес. '
        'При этом экономический эффект от маркировки покроет эти расходы. '
        'Благодаря системе производитель будет четко знать, сколько он продает товаров и '
        'как работают логистические цепочки. Это позволит оптимизировать бизнес-процессы и снизить издержки.\n'
        'При самом консервативном сценарии после внедрения маркировки цены на товары могут '
        'снизиться на 10% за счет снижения доли контрафакта на рынке и других позитивных эффектов.'
    )


@dp.message_handler(commands=['what_goods'])
async def work_process(message: types.Message):
    await message.reply(
        'Какие товары уже сейчас маркируются?\n\n'
        'В марте 2019 года стартовал проект по обязательной маркировке табака, с июля 2019 года — '
        'проект по маркировке обуви. С 1 января 2020 запущены проекты по маркировке духов и туалетной воды, '
        'некоторых видов одежды, постельного, столового, туалетного и кухонного белья, '
        'фотоаппаратов и ламп-вспышек, шин и пневматических покрышек.'
        'Запуск обязательной маркировки товаров:\n'
        '1 июля 2020 года — Все лекарственные препараты, Табачная продукция,\n'
        'Обувные товары (вступает запрет на немаркированную продукцию)'
        '1 октября 2020 года — Духи и туалетная вода\n'
        '1 октября 2020 года — Фотоаппараты и лампы-вспышки (вступает запрет на немаркированную продукцию)\n'
        '1 ноября 2020 года — Шины и покрышки\n'
        '1 января 2021 года — некоторые товары Легкой промышленности (вступает запрет на немаркированную продукцию)\n'
        'В эксперименте по маркировке сейчас находятся: Кресла-коляски, Велосипеды, Молочная продукция, Питьевая вода\n'
        'Центр приступает к маркировке новых групп товаров в сжатые сроки, '
        'благодаря масштабируемости системы Честный ЗНАК. Для комфортного перехода к маркировке компания отрабатывает с'
        ' бизнесом все решения и технологии в ходе пилотных проектов.'
    )


@dp.message_handler(commands=['who_response'])
async def work_process(message: types.Message):
    await message.reply(
        'Кто отвечает за работу системы маркировки и прослеживаемости товаров?\n\n'
        'Мировой опыт показывает, что для запуска проектов по маркировке государства чаще всего привлекают '
        'частного оператора. В Китае — это компания Alihealth, принадлежащая Alibaba, '
        'в Бразилии — швейцарская компания SICPA. Такой оператор, инвестируя собственные средства, '
        'не создает дополнительную нагрузку на государственный бюджет. В России Единая система маркировки и '
        'прослеживаемости товаров работает в формате государственно-частного партнерства. '
        'Центр развития перспективных технологий — частный и единый оператор системы.'
    )


@dp.message_handler(commands=['make_fake'])
async def work_process(message: types.Message):
    await message.reply(
        'Почему код нельзя подделать?\n\n'
        'Цифровой код, в отличии от обычной бумажной марки, сложно подделать. '
        'Данные о товаре невозможно удалить из системы или скорректировать благодаря отечественным криптотехнологиям. '
        'Код маркировки делится на две части: код идентификации, '
        'который определяет позицию товара в системе и едином каталоге товаров, и код проверки или крипто-хвост, '
        'который генерирует ЦРПТ.\n\n'
        'При выводе товара из оборота его легальность подтверждается на онлайн-кассе с помощью фискального накопителя. '
        'Он синхронизирует данные системы маркировки и единого каталога и не позволяет продавцу продать контрафакт.\n\n'
        'Серию уникальных кодов нельзя предсказать, '
        'а сам цифровой код не повторяется в течение 5 лет с момента выпуска товарной позиции.'
    )


@dp.message_handler(commands=['who_marks'])
async def work_process(message: types.Message):
    await message.reply(
        'Кто наносит цифровой код на товар?\n\n'
        'Центр развития перспективных технологий создает уникальный цифровой код Data Matrix '
        'и отправляет его добросовестным производителям и импортерам. '
        'Они наносят код на каждую упаковку своего товара. Через цифровой код можно проследить весь путь товара '
        '— от конвейера до онлайн-кассы, которая выводит его из оборота. '
        'Система фиксирует переход товара от собственника к собственнику на каждом этапе логистической цепи, '
        'что делает невозможным вброс подделки.'
    )


@dp.message_handler(commands=['fake'])
async def work_process(message: types.Message):
    await message.reply(
        'Что делать если я нашел подделку\n\n'
        'В приложении будет возможность сообщить о выявленном контрафакте.'
        'В зависимости от типа нарушения информация будет передаваться соответствующим контрольно-надзорным органам,'
        'а они в свою очередь будут анализировать результаты и проводить проверки недобросовестных производителей.\n'
        'Ежеминутно на территории России будут выполняться тысячи мобильных проверок,'
        'и благодаря общественному контролю рынок станет действительно прозрачным.'
    )


@dp.message_handler(commands=['work_process'])
async def work_process(message: types.Message):
    await message.reply(
        'Как работает и из чего состоит процесс маркировки?\n\n'
        'Процесс состоит из следующих этапов:\n'
        '1. Участник оборота товара регистрируется в Государственной системе мониторинга товаров (ГИС МТ).\n'
        '2. Производитель или импортер заказывают цифровой код в ГИС МТ и наносят уникальный код на товар.\n'
        '3. По цифровому коду — коду маркировки фиксируется вся логистическая цепь, по которой перемещается предмет '
        'маркировки, — от завода до потребителя, от ввода в оборот до выбытия товара из оборота.\n'
        '4. Код сканируется при продаже на кассе. В систему передаются сведения о выбытии продукции из оборота.\n'
        '5. Используя мобильное приложение для цифровой маркировки товара, '
        'потребитель может проверить его легальность.\n\n'
        'Запуск обязательной маркировки товаров:\n'
        '1 июля 2020 года — Все лекарственные препараты,'
        'Табачная продукция, Обувные товары (вступает запрет на немаркированную продукцию)\n'
        '1 октября 2020 года — Духи и туалетная вода\n'
        '1 октября 2020 года — Фотоаппараты и лампы-вспышки (вступает запрет на немаркированную продукцию)\n'
        '1 ноября 2020 года — Шины и покрышки\n'
        '1 января 2021 года — некоторые товары Легкой промышленности (вступает запрет на немаркированную продукцию)\n'
        'В эксперименте по маркировке сейчас находятся: Кресла-коляски, Велосипеды, Молочная продукция, Питьевая вода'
        'К 2024 году практически все потребительские товары, которые продают, изготавливают и импортируют,'
        'должны быть промаркированы. Поэтому каждый владелец бизнеса уже сегодня должен подготовиться'
        'к внедрению системы и подать заявку на регистрацию в ней.'
    )


@dp.message_handler(commands=['for_whom'])
async def for_whom(message: types.Message):
    await message.reply(
        'Для кого нужна система маркировки?\n\n'
        'Внедрение национальной системы маркировки товаров выгодно потребителям, бизнесу и государству:\n\n'
        '1. Потребитель может не сомневаться в легальности приобретаемых продуктов, их безопасности для жизни и'
        'здоровья. Через приложение любой гражданин сможет сообщить об обнаруженной нелегальной продукции,'
        'и эта информация будет передана в соответствующий контрольный орган.\n'
        '2. Легальные производители и импортеры, участвуя в национальной системе маркировки товаров, получают рост '
        'выручки и повышение конкурентоспособности, благодаря снижению доли контрафакта и контрабанды на рынке. '
        'Бизнес сможет отслеживать движение продукции и экономить на логистике, оптимизируя поставки и складские '
        'запасы на основе актуального статистического материала о сезонности, интенсивности и географии продаж. В '
        'результате сократятся издержки и увеличится производительность труда.\n'
        '3. На уровне государства маркировка товаров обеспечит сокращение «теневого» рынка, повышение налоговых '
        'платежей и таможенных сборов, снижение расходов на организацию контроля товарных рынков. '
    )


# @dp.message_handler(commands=['what_for'])
# async def what_for(message: types.Message):
#     await message.reply(
#         'Зачем нужна система маркировки?\n\n'
#         'Будущее — это цифровые технологии, системы объединения данных, которые будут использоваться для'
#         'отслеживания и диагностики проблем в здравоохранении, сельском хозяйстве, легкой промышленности и окружающей'
#         'среде, а также для выполнения повседневных задач. Технологии, функционирующие на основе анализа данных,'
#         'будут способны обеспечить расширение прав и возможностей людей, улучшение благосостояния человека.\n\nПроблема'
#         'нелегальной продукции остается крайне острой для России: доля незаконного оборота в легкой промышленности'
#         'достигает 35%, на парфюмерном рынке 20%, на рынке лекарственных средств до 10%.\n\nВ этом году обязательная'
#         'маркировка коснётся шести категорий товаров: лекарства, обувь, фототовары, шины и покрышки, парфюмерия и'
#         'табак. Маркировка призвана защитить покупателей от контрафактной продукции и помочь повысить уплату налогов,'
#         'поскольку вытеснит с рынка недобросовестных налогоплательщиков.\n\nВ декабре 2017 г. Президент РФ В. Путин'
#         'одобрил решение правительства о создании до 2024 г. национальной системы цифровой маркировки товаров на базе'
#         'Центра развития перспективных технологий (ЦРПТ).\n\nЦРПТ является совместным проектом ЮСМ («ЮэСэМ Технологии»,'
#         '50%), госкорпорации Ростех (концерн «Автоматика», 25%) и «Элвис-Плюс групп» (25%).\n\nЦифровая маркировка'
#         'позволит бизнесу повысить производительность, совершенствовать логистические схемы, нарастить долю рынка и в'
#         'конечном счете увеличить выручку:\n\n1. За счет снижения доли контрабанды и контрафакта легальные '
#         'производители'
#         'увеличат долю и объемы производства на 5-50% в зависимости от товарной группы.\n2. Бизнес сможет перевести'
#         'производство на Индустрию 4.0, на работу по принципу Just-in-Time. Получая в режиме онлайн данные о движении'
#         'продукции, он будет оптимально планировать производство, снижать запасы и повышать оборачиваемость продукции.'
#         '\n3. Подключение к оператору электронного документооборота (если в ЭДО ранее не работали).\n4. Бизнес сможет'
#         'существенно экономить на логистике: при внедрении полного прослеживания получение производителем или'
#         'логистической компанией актуального статистического материала о географии, интенсивности, сезонности продаж'
#         'позволит перестроить логистические схемы, оптимизировать поставки и складские запасы.\n5. Бизнес наладит учет.'
#         'Сейчас многие предприниматели не имеют собственных данных об остатках и кодах товаров на складах и в'
#         'магазинах. Без правильного учета невозможно считать прибыль или планировать закупки, поэтому автоматизация'
#         'поможет в будущем предпринимателям навести порядок в своем бизнесе. \n6. Бизнес перейдет на электронный'
#         'документооборот. ЭДО радикально сокращает объем бумажных документов, которыми до сих пор активно обмениваются'
#         'между собой российские компании, снизит издержки бизнеса и повысит производительность труда.'
#     )
