from aiogram import types

from loader import dp


@dp.message_handler(commands=['experiments'])
async def experiments(message: types.Message):
    await message.reply(
        """
         Чем регламентируется эксперимент по маркировке лекарственных препаратов?
        — Федеральным законом «Об обращении лекарственных средств» от 12.04.2010 N 61-ФЗ;
        — Федеральным законом «О внесении изменений в Федеральный закон Об обращении лекарственных средств» от 28.12.2017 N 425-ФЗ;
        — Постановлением Правительства РФ от 28 августа 2018 г. № 1018 «О внесении изменений в постановление Правительства Российской Федерации от 24 января 2017 г. N 62»;
        — Методическими рекомендациями для проведения эксперимента по маркировке контрольными (идентификационными) знаками и мониторингу за оборотом отдельных видов лекарственных препаратов для медицинского применения, находящихся в гражданском обороте на территории Российской Федерации»;
        — Постановлением Правительства РФ от 14 декабря 2018 г. № 1556 «Об утверждении Положения о системе мониторинга движения лекарственных препаратов для медицинского применения»;
        — Постановлением Правительства РФ от 14 декабря 2018 г. № 1557 «Об особенностях внедрения системы мониторинга движения лекарственных препаратов для медицинского применения»;
        — Постановлением Правительства РФ от 14 декабря 2018 г. N 1558 «Об утверждении Правил размещения общедоступной информации, содержащейся в системе мониторинга движения лекарственных препаратов для медицинского применения, в информационно-коммуникационной сети «Интернет» (в том числе в форме открытых данных).
        — иными нормативно-правовыми документами, приведенными в разделе «Документы».
        
        Какие группы лекарственных препаратов являются приоритетными для маркировки в рамках проведения Эксперимента?
        Приоритетными для участия в Эксперименте являются лекарственные препараты, предназначенные для обеспечения лиц, больных гемофилией, гипофизарным нанизмом, болезнью Гоше, злокачественными новообразованиями лимфоидной, кроветворной и родственных им тканей, рассеянным склерозом, лиц после трансплантации органов и (или) тканей.
        
        Где я могу получать актуальную информацию об эксперименте?
        ЦРПТ проводит образовательные вебинары и семинары, расписание которых можно найти по ссылке лекции.честныйзнак.рф. Полная информация о текущих проектам доступна на сайте ЧестныйЗНАК.рф. 
        Вопросы по эксперименту Вы можете направлять на email info@crpt.ru.
        
        Когда маркировка станет обязательной для всех лекарственных препаратов?
        В соответствии с Постановлением Правительства Российской Федерации от 24 января 2017 г. N 62 (в ред. от 28.08.2018) эксперимент по маркировке лекарственных препаратов продлен до конца 2019 года. Согласно требованиям Федерального закона от 12 апреля 2010 г. (в ред. от 04.06.2018) обязательная маркировка вводится с 1 января 2020 г. Согласно Постановлению Правительства РФ от 14 декабря 2018 г. № 1557 «Об особенностях внедрения системы мониторинга движения лекарственных препаратов для медицинского применения», для препаратов из перечня высокозатратных нозологий обязательная регистрация участников оборота в личном кабинете ИС МДЛП начинается с 01.07.2019 г., маркировка лекарственных препаратов 7ВЗН станет обязательной с 1 октября 2019 г.
        
        Кому необходимо зарегистрироваться в ИС МДЛП?
        Регистрация в системе мониторинга движения лекарственных препаратов для медицинского применения доступна всем субъектам обращения лекарственных средств.
        Кто является субъектами обращения лекарственных средств?
        Субъектами обращения лекарственных средств являются юридические лица и индивидуальные предприниматели, осуществляющие производство, хранение, ввоз в Российскую Федерацию, отпуск, реализацию, передачу, применение и уничтожение лекарственных препаратов.
        
        Как зарегистрироваться в ИС МДЛП?
        На сайте www.ЧестныйЗНАК.рф в разделе «Как стать участником» описаны условия регистрации в системе мониторинга движения лекарственных препаратов для медицинского применения.
                """
    )


@dp.message_handler(commands=['personal'])
async def personal_account(message: types.Message):
    await message.reply(
        """
        Не удается зайти по логину/паролю по адресу https://mdlp.crpt.ru.
        Вход по логину паролю предусмотрен только для нерезидентов РФ. Для резидентов РФ вход по логину и паролю не предусмотрен, авторизация в личном кабинете ИС МДЛП осуществляется с помощью УКЭП руководителя организации. Требования к УКЭП представлены по ссылке.
        
        Истек срок действия старого сертификата, получили новый сертификат, как его обновить?
        Для обновления сертификата необходимо воспользоваться ссылкой «Восстановление доступа» на странице https://mdlp.crpt.ru/ и выбрать тип операции «Изменение сертификата УКЭП». Если старый сертификат отсутствует, Вы можете воспользоваться ссылкой «Восстановление доступа» на странице https://mdlp.crpt.ru и выбрать тип операции «Добавление нового пользователя». Данный способ актуален в том числе и для пользователей, ранее зарегистрированных на сайте https://mdlp.markirovka.nalog.ru.
        Обращаем Ваше внимание на то, что данная функциональность доступна только для руководителя организации, который указан в Реестре ЕГРЮЛ.
        
        При входе в личный кабинет возникает ошибка «Сертификат не зарегистрирован в системе».
        Ошибка возникает в связи с тем, что данный сертификат ранее не использовался для входа в личный кабинет.
        
        1. Если Вы еще не проходили регистрацию в системе — рекомендуем заполнить электронную форму по ссылке https://mdlp.crpt.ru/index.html#/auth/signup/.
        
        2. Если истек срок действия старого сертификата, для регистрации нового сертификата необходимо воспользоваться ссылкой «Восстановление доступа» на странице https://mdlp.crpt.ru и выбрать тип операции «Изменение сертификата УКЭП».
        
        3. Если Вы не являетесь руководителем организации, но Вам необходимо получить доступ к информационной системе — обратитесь к руководителю организации для добавления Вас как пользователя с выбранным сертификатом.
        
        Сменился руководитель организации, что делать?
        Необходимо получить новую УКЭП на имя нового руководителя организации (требования к УКЭП представлены по ссылке), воспользоваться ссылкой «Восстановление доступа» на странице https://mdlp.crpt.ru и выбрать тип операции «Добавление нового пользователя».
        
        Обращаем Ваше внимание, операция доступна только если данные о новом руководителе уже присутствуют в ЕГРЮЛ, информацию Вы можете проверить на сайте ФНС.
        
        При регистрации возникает ошибка «Отсутствуют сведения об организации в реестрах ЕГРЮЛ / ЕГРИП / РАФП. Для получения дополнительной информации обратитесь в соответствующий государственный реестр или по адресу support@crpt.ru».
        Подробная информация о регистрации доступна по ссылке. Если все данные корректны, просим Вас предоставить в адрес поддержки support@crpt.ru следующие данные:
        — скриншот ошибки;
        — файл сертификата в формате .cer;
        — ИНН и наименование организации.
        
        Действия участников эксперимента, ранее зарегистрированных на портале https://mdlp.markirovka.nalog.ru.
        С 1 ноября 2018 года информационная система МДЛП перешла от Федеральной Налоговой Службы РФ в единую национальную систему маркировки и прослеживания товаров Честный ЗНАК.
        Вход в личный кабинет осуществляется по адресу: https://mdlp.crpt.ru, ресурс https://mdlp.markirovka.nalog.ru не используется.
        
        Ранее регистрировались на сайте ФНС. Необходимо ли заново регистрироваться на сайте https://mdlp.crpt.ru?
        Если ранее Вами осуществлялась регистрация на сайте https://mdlp.markirovka.nalog.ru — проходить регистрацию заново не нужно, Ваши учетные данные уже есть в системе. Вы можете начать работу в личном кабинете ИС МДЛП на сайте https://mdlp.crpt.ru.
        
        Порядок получения УКЭП
        1. Выбрать удостоверяющий центр (список аккредитованных удостоверяющих центров можно получить на сайте Минкомсвязи России http://minsvyaz.ru/ru/activity/govservices/2/).
        2. Оформить заявку на получение КЭП (данная услуга, в основном, предоставляется удаленно на сайте УЦ).
        3. Оплатить счет, после подтверждения заявки.
        4. Собрать и предоставить в УЦ комплект документов.
        5. Получить сертификат квалифицированной электронной подписи.
        6. Для работы с КЭП возможно потребуется криптографическое программное обеспечение (состав может изменяться в зависимости от применения КЭП).
        7. КЭП выдаётся на электронных ключах. Модели ключей должны быть сертифицированы ФСТЭК и/или ФСБ. (Например, электронные ключи eToken или Rutoken).
        
        Чем регламентируется получение и использование УКЭП?
        Отношения в области использования электронных подписей регулируется Федеральным законом от 06.04.2011 N 63-ФЗ (ред. от 23.06.2016) «Об электронной подписи» и постановлением Правительства Российской Федерации от 25.06.2012 № 634 «О видах электронной подписи, использование которых допускается при обращении за получением государственных и муниципальных услуг».
        
        Кто имеет доступ к сведениям, содержащимся в ИС МДЛП?
        К сведениям имеют доступ все зарегистрированные в системе мониторинга движения лекарственных препаратов для медицинского применения ней участники Эксперимента (каждый участник имеет доступ к сведениям по товарам, находящимся в его обороте), а также государственные органы, осуществляющие контроль в сфере обращения лекарственных препаратов и маркировки товаров.
        
        Сколько личных кабинетов заводить, если вы связаны юридическими отношениями с несколькими компаниями?
        Если вы связаны природой юридических отношений с несколькими компаниями, то необходимо оформить отдельный личный кабинет для каждого юридического лица.
        
        В ЛК МДЛП есть список мест осуществления деятельности и список складов ответственного хранения. В чем между ними разница?
        Места осуществления деятельности заполняются согласно собственным лицензиям участника оборота – владельца ЛК.
        
        В складах ответственного хранения необходимо указывать только места осуществления деятельности других участников оборота, с которыми у владельца ЛК есть договорные отношения на выполнение действий с ЛП по этим адресам.
        
        Что такое песочница? Для чего нужно регистрироваться в песочнице и обязательно ли это?
        Песочница — это тестовая версия основной системы, в которой Вы можете регистрироваться для тестирования бизнес-процессов, тренировки сотрудников и отладки вашего ПО, чтобы не вносить некорректные данные в рабочую систему и отладки систем. Тестовый контур «Песочница» расположен по ссылке. Регистрационные данные автоматически не переносятся из песочницы на контур промышленной эксплуатации.
        Регистрация на тестовом контуре производится аналогично регистрации на Промышленном (рабочем) контуре.
        
        Мы зарегистрировались в системе, но от Минздрава/Росздравнадзора поступила информация, что нас нет в списке зарегистрированных участников, что делать?
        Вам необходимо зарегистрировать хотя-бы одно место деятельности. Подробно процесс регистрации места деятельности описан в «Руководстве пользователя личного кабинета Участника обращения лекарственных препаратов», п. 4.5.
        
        При регистрации в системе возникает ошибка «ОГРНИП в сертификате УКЭП отсутствует или некорректен»
        В используемом для входа сертификате УКЭП указаны данные физического лица, что противоречит требованиям к оформлению УКЭП для регистрации в ИС МДЛП.
        Рекомендуем получить УКЭП, выданную на имя руководителя организации с указанием должности, которая прописана в ЕГРЮЛ.
        Остальные данные в УКЭП, включая ИНН — должны соответствовать данным самой организации. Требования к УКЭП представлены по ссылке.
        УКЭП можно получить в любом аккредитованном удостоверяющем центре в Вашем городе, список есть на сайте Минкомсвязи по ссылке.
        После получения УКЭП рекомендуем повторить попытку регистрации в личном кабинете.
        """
    )


@dp.message_handler(commands=['emissions'])
async def emissions(message: types.Message):
    await message.reply(
        """
        Когда и как можно начать тестирование криптокода по API с облаком, «черным ящиком»?
        Для того, чтобы протестировать заказ кодов маркировки по API необходимо зарегестрироваться на интеграционном контуре СУЗ-МДЛП. Для этого необходимо направить заявку на электронный адрес farma@crpt.ru. Письмо с заявкой должно содержать следующую тему: Заявка на предоставление доступа к интеграционному контуру Фарма
        
        Заявка должна содержать следующие данные:
        ИНН/ИТИН
        ОГРН/ОГРНИП (для нерезидентов РФ не требуется)
        Наименование организации
        Рег.номер в ФГИС МДЛП Песочница (указать при наличии ЛК ФГИС МДЛП Песочница)
        Тип участника: Интегратор или Производитель ЛП (указывается одно)
        Тип доступа: для резидента РФ / для нерезидента РФ (указывается одно)
        Фамилия, имя, отчество (при наличии) контактного лица
        Контактный телефон
        Email
        Контур: интеграционный контур «Фарма»
        Приложить тестовый сертификат УКЭП (в формате.pfx) в случае отсутствия доступа к ФГИС МДЛП Песочница (только для интеграторов — резидентов РФ)
        После регистрации будут доступны для работы личные кабинеты в системах «Станция управления заказами» и «Мониторинг движения лекарственных препаратов — Песочница», тестовый регистратор эмиссии, а также возможность протестировать не только заказ кодов маркировки по API, но и другие процессы.
        Как работает регистратор эмиссии?
        Регистратор эмиссии является промышленным программно-аппаратным комплексом, построенным на российской элементной базе. Он осуществляет функции генерации ключа и кода проверки и хранение криптозащищенных кодов маркировки. 
        
        Когда и как можно получить постоянный регистратор эмиссии?
        Для получения регистратора эмиссии необходимо заключить Договор по предоставлению устройства регистратора эмиссии и сформировать Заявление на предоставление регистратора эмиссии в личном кабинете ГИС МДЛП.
        С порядком формирования договора и заявления Вы можете ознакомиться здесь.
        
        Каков порядок получения регистраторов эмиссии для тестирования?
        Для того, чтобы получить доступ к тестовому регистратору эмиссии необходимо зарегистрироваться на интеграционном контуре СУЗ-МДЛП. Для этого необходимо направить заявку на электронный адрес farma@crpt.ru. Письмо с заявкой должно содержать следующую тему: Заявка на предоставление доступа к интеграционному контуру Фарма
        
        Заявка должна содержать следующие данные:
        Заявка должна содержать следующие данные:
        ИНН/ИТИН
        ОГРН/ОГРНИП (для нерезидентов РФ не требуется)
        Наименование организации
        Рег.номер в ФГИС МДЛП Песочница (указать при наличии ЛК ФГИС МДЛП Песочница)
        Тип участника: Интегратор или Производитель ЛП (указывается одно)
        Тип доступа: для резидента РФ / для нерезидента РФ (указывается одно)
        Фамилия, имя, отчество (при наличии) контактного лица
        Контактный телефон
        Email
        Контур: интеграционный контур «Фарма»
        Приложить тестовый сертификат УКЭП (в формате.pfx) в случае отсутствия доступа к ФГИС МДЛП Песочница (только для интеграторов — резидентов РФ)
        После регистрации будут доступны для работы личные кабинеты в системах «Станция управления заказами» и «Мониторинг движения лекарственных препаратов — Песочница» и тестовый регистратор эмиссии.
        Кто будет интегрировать с IT-архитектурой предприятия регистратор эмиссии, сетевое подключение, осуществлять настройку интерфейсов системы Честный ЗНАК и системы предприятия?
        Вы самостоятельно настраиваете интерфейсы взаимодействия с системой Честный ЗНАК. Подключение регистраторов эмиссии производится через универсальное API. При необходимости, Оператор системы может оказать помощь в подключении, направив на площадку собственных специалистов.
        Зона ответственности оператора сосредоточена на регистраторе эмиссии, в локальную сеть компании Оператор не «погружается».
        
        Что делать, если регистратор эмиссии сломается?
        Для таких случаев предусмотрено резервное оборудование и сервера. Оператор проекта не только поставляет регистраторы эмиссии, но и оказывает техническую поддержку, согласно условиям, прописанным в соглашении о государственно-частном партнерстве.
        
        Будет ли регистратор эмиссии работать без интернета?
        Он способен работать даже при отключении интернета. Регистратор способен хранить 2 млн кодов не обращаясь к интернету. Этого количества (в среднем) хватает на неделю работы фармацевтического предприятия.
        
        Каких специалистов придется допустить на свои заводы?
        Для установки и настройки оборудования необходимо допустить на заводы специалистов Оператора системы маркировки. Оборудование физически будет находиться на заводе, но располагаться за периметром локальной сети без доступа к конфиденциальной информации и к информации, которая находится в сети предприятия в целом.  Сервисные специалисты должны будут иметь доступ к установленному оборудованию. Так же, как и, например, специалисты по настройке системы кондиционирования. Никаких изменений в локальную сеть предприятий вносить не нужно. Локальная сеть предприятия иностранного производителя – это часть глобальной сети того же производителя, в которую попадает чувствительная информация компании, относящаяся не только к российскому рынку. 
        Поэтому доступ к ней остаётся только у специалистов компании.
        """

    )


@dp.message_handler(commands=['disposal'])
async def disposal(message: types.Message):
    await message.reply(
        """
        Регистратор Эмиссии
        
        Когда и как можно начать тестирование криптокода по API с облаком, «черным ящиком»?
        Для того, чтобы протестировать заказ кодов маркировки по API необходимо зарегестрироваться на интеграционном контуре СУЗ-МДЛП. Для этого необходимо направить заявку на электронный адрес farma@crpt.ru. Письмо с заявкой должно содержать следующую тему: Заявка на предоставление доступа к интеграционному контуру Фарма
        
        Заявка должна содержать следующие данные:
        ИНН/ИТИН
        ОГРН/ОГРНИП (для нерезидентов РФ не требуется)
        Наименование организации
        Рег.номер в ФГИС МДЛП Песочница (указать при наличии ЛК ФГИС МДЛП Песочница)
        Тип участника: Интегратор или Производитель ЛП (указывается одно)
        Тип доступа: для резидента РФ / для нерезидента РФ (указывается одно)
        Фамилия, имя, отчество (при наличии) контактного лица
        Контактный телефон
        Email
        Контур: интеграционный контур «Фарма»
        Приложить тестовый сертификат УКЭП (в формате.pfx) в случае отсутствия доступа к ФГИС МДЛП Песочница (только для интеграторов — резидентов РФ)
        После регистрации будут доступны для работы личные кабинеты в системах «Станция управления заказами» и «Мониторинг движения лекарственных препаратов — Песочница», тестовый регистратор эмиссии, а также возможность протестировать не только заказ кодов маркировки по API, но и другие процессы.
        Как работает регистратор эмиссии?
        Регистратор эмиссии является промышленным программно-аппаратным комплексом, построенным на российской элементной базе. Он осуществляет функции генерации ключа и кода проверки и хранение криптозащищенных кодов маркировки. 
        
        Когда и как можно получить постоянный регистратор эмиссии?
        Для получения регистратора эмиссии необходимо заключить Договор по предоставлению устройства регистратора эмиссии и сформировать Заявление на предоставление регистратора эмиссии в личном кабинете ГИС МДЛП.
        С порядком формирования договора и заявления Вы можете ознакомиться здесь.
        
        Каков порядок получения регистраторов эмиссии для тестирования?
        Для того, чтобы получить доступ к тестовому регистратору эмиссии необходимо зарегистрироваться на интеграционном контуре СУЗ-МДЛП. Для этого необходимо направить заявку на электронный адрес farma@crpt.ru. Письмо с заявкой должно содержать следующую тему: Заявка на предоставление доступа к интеграционному контуру Фарма
        
        Заявка должна содержать следующие данные:
        Заявка должна содержать следующие данные:
        ИНН/ИТИН
        ОГРН/ОГРНИП (для нерезидентов РФ не требуется)
        Наименование организации
        Рег.номер в ФГИС МДЛП Песочница (указать при наличии ЛК ФГИС МДЛП Песочница)
        Тип участника: Интегратор или Производитель ЛП (указывается одно)
        Тип доступа: для резидента РФ / для нерезидента РФ (указывается одно)
        Фамилия, имя, отчество (при наличии) контактного лица
        Контактный телефон
        Email
        Контур: интеграционный контур «Фарма»
        Приложить тестовый сертификат УКЭП (в формате.pfx) в случае отсутствия доступа к ФГИС МДЛП Песочница (только для интеграторов — резидентов РФ)
        После регистрации будут доступны для работы личные кабинеты в системах «Станция управления заказами» и «Мониторинг движения лекарственных препаратов — Песочница» и тестовый регистратор эмиссии.
        Кто будет интегрировать с IT-архитектурой предприятия регистратор эмиссии, сетевое подключение, осуществлять настройку интерфейсов системы Честный ЗНАК и системы предприятия?
        Вы самостоятельно настраиваете интерфейсы взаимодействия с системой Честный ЗНАК. Подключение регистраторов эмиссии производится через универсальное API. При необходимости, Оператор системы может оказать помощь в подключении, направив на площадку собственных специалистов.
        Зона ответственности оператора сосредоточена на регистраторе эмиссии, в локальную сеть компании Оператор не «погружается».
        
        Что делать, если регистратор эмиссии сломается?
        Для таких случаев предусмотрено резервное оборудование и сервера. Оператор проекта не только поставляет регистраторы эмиссии, но и оказывает техническую поддержку, согласно условиям, прописанным в соглашении о государственно-частном партнерстве.
        
        Будет ли регистратор эмиссии работать без интернета?
        Он способен работать даже при отключении интернета. Регистратор способен хранить 2 млн кодов не обращаясь к интернету. Этого количества (в среднем) хватает на неделю работы фармацевтического предприятия.
        
        Каких специалистов придется допустить на свои заводы?
        Для установки и настройки оборудования необходимо допустить на заводы специалистов Оператора системы маркировки. Оборудование физически будет находиться на заводе, но располагаться за периметром локальной сети без доступа к конфиденциальной информации и к информации, которая находится в сети предприятия в целом.  Сервисные специалисты должны будут иметь доступ к установленному оборудованию. Так же, как и, например, специалисты по настройке системы кондиционирования. Никаких изменений в локальную сеть предприятий вносить не нужно. Локальная сеть предприятия иностранного производителя – это часть глобальной сети того же производителя, в которую попадает чувствительная информация компании, относящаяся не только к российскому рынку. 
        Поэтому доступ к ней остаётся только у специалистов компании.
        
        Регистраторы выбытия
        Что такое регистратор выбытия?
        Аналог онлайн-кассы. Необходим в местах, где выводятся из оборота бесплатные ЛП.
        
        Руководство пользователя для регистратора выбытия 1.0
        Руководство пользователя для регистратора выбытия 2.0
        Руководство пользователя для регистратора выбытия 3.0
        Как получить регистратор выбытия (РВ)?
        Для организаций, участвующих в программе высокозатратных нозологий, заявка на регистратор выбытия доступна для заполнения в личном кабинете системы мониторинга оборота лекарственных препаратов с 1 июля 2019 года (согласно ППРФ № 1557 от 14.12.18). Для остальных участников оборота сроки подачи заявок будут определены отдельными нормативными актами.
        
        Инструкция по оформлению заявки на регистратор выбытия
        
        Кому необходимо получить регистратор выбытия?
        Регистраторы выбытия выдаются:
        1) Медицинским организациям, а также всем организациям, имеющим медицинскую лицензию — в соответствии с количеством мест осуществления деятельности по оказанию медицинской помощи.
        
        Кроме:
        медицинских организации, подведомственных Минобороны России;
        кабинетов врачебной помощи (медицинские кабинеты), расположенных в дошкольных образовательных организациях, общеобразовательных организациях, иных организациях, и являющиеся структурными подразделениями медицинской организации;
        обособленных структурных подразделений медицинских организаций, получающих лекарственные препараты, предназначенные для оказания медицинской помощи, из головной медицинской организации.
        2) Аптекам, осуществляющим выдачу лекарственных препаратов по программе высокозатратных нозологий — по списку мест осуществления деятельности, задействованных в данной программе, согласованному Росздравнадзором.
        
        3) Аптекам, осуществляющим отпуск лекарственных препаратов по льготе или по частичной льготе.
        
        Кроме:
        аптечных организаций (аптеки, аптечные пункты, аптечные киоски), осуществляющих только розничную торговлю лекарственными препаратами.
        Где можно ознакомиться с договором на получение регистратора выбытия?
        Согласно п. 51 ППРФ1556 от 14.12.2018, оснащение будет производиться на основании типовой, утвержденной Министерством промышленности и торговли РФ формы договора.
        
        Типовая форма договора по предоставлению регистратора выбытия
        
        Нужно ли для РВ дополнительное программное обеспечение или оборудование?
        При автономном использовании регистратора выбытия (РВ) требуется только подключение к сети Интернет. Дополнительного программного обеспечения или оборудования не требуется.
        
        При подключении РВ к компьютеру используется подключение к сети интернет, установленное на данном компьютере. Если на компьютере установлена информационная система (товаро-учетная система или ИС Вашей организации), умеющая управлять РВ (настроена интеграция методами API), то возможно использование сторонних 2D сканеров.
        
        Если РВ подключен в локальную вычислительную сеть организации и не находится непосредственно на рабочем месте сотрудника, регистрирующего вывод ЛП из оборота, подключение к нему и его использование возможно с любого компьютера в локальной сети организации. При этом использование встроенного сканера кодов маркировки невозможно и такие рабочие места должны быть оснащены сканерами 2D-штрихкодов. Также возможно использование серийно выпускаемых терминалов сбора данных с последующей передачей информации в РВ. Данное использование РВ невозможно без установки на рабочих местах пользователей информационной системы, управляющей работой РВ.
        
        Можно ли на регистраторе выбытия посмотреть результаты попытки вывода ЛП?
        Информация о результатах попытки вывода из оборота ЛП через РВ недоступна на самом РВ, ее можно увидеть только на компьютере, имеющем прямое подключение к МДЛП через личный кабинет участника оборота или в информационной системе участника оборота, интегрированной с ИС МДЛП и загружающей оттуда сведения.
        
        Можно ли перепривязать РВ на другое место деятельности?
        Регистратор можно перепривязать на другое место деятельности, например, если текущее место деятельности закрылось, но у организации имеется другое.
        
        Для осуществления перепривязки, обратитесь в службу поддержки support@crpt.ru и предоставьте следующие данные:
        Причина перепривязки
        Идентификатор и адрес места деятельности, к которому привязан РВ на текущий момент
        Идентификатор и адрес места деятельности, на которое необходимо перепривязать РВ
        Серийный номер РВ
        Контактное лицо и номер телефона
        Алгоритм использования РВ для медицинских организаций.
        Алгоритм использования регистратора выбытия (РВ) для медицинских организаций:
        При работе РВ в автономном режиме (РВ подключен к сети интернет, интеграция с информационными системами не используется):
        1. Сотрудник медицинской организации получает или создает документ-основание для регистрации вывода из оборота. Это может быть требование-накладная, акт списания при использовании для оказания медицинской помощи или любой другой документ в соответствии с внутренней учетной политикой участника оборота.
        2. Входит в меню «Регистрация выбытия — Автономный режим — Прочее» (для РВ 1.0 и 2.0) или «Выбытие — Начать выбытие — Новый документ» (для РВ 3.0) и вводит реквизиты документа основания.
        3. Подбирает упаковки лекарственных препаратов (ЛП) в соответствии с документом-основанием и сканирует коды маркировки (КМ). При сканировании КМ РВ выводит на экран результат локальной проверки кода маркировки, GTIN и серийный номер ЛП.
        4. Завершив подбор ЛП, сотрудник выбирает действие «Завершить» (для РВ 1.0 и 2.0) или «Выбытие» (для РВ 3.0).
        
        Если используется информационная система (ИС), интегрированная с ФГИС МДЛП и РВ, реквизиты документов основания вводятся в ИС и сканируются КМ с помощью сканера. Выбытие осуществляется через интерфейс ИС.
        
        Передает ли РВ при использовании автоматически информацию в ИС МДЛП? В нем встроен алгоритм 531 схемы?
        При использовании РВ создается документ на выбытие, выбирается тип выбытия (для мед применения или льготный рецепт), сканируются выбываемые лекарственные препараты. Затем сформированный документ отправляется на выбытие и РВ формирует и передает в ИС МДЛП схему 10531 (при выборе типа для мед применения) или 10521 (при выборе типа льготный рецепт).
        
        Возможна ли установка стороннего ПО на РВ?
        Установка сторонних мобильных приложений на регистраторы выбытия не предусмотрена.Согласно пункту договора на предоставление регистратора выбытия 2.5.2. Г «Участник не имеет права без письменного согласия Оператора осуществлять вмешательство в программную и аппаратную часть Оборудования, вскрытие корпуса Оборудования, нарушение целостности разъёмов, интерфейсных кабелей, подключение к Оборудованию каких-либо устройств кроме тех, для подключения к которым Оборудование непосредственно предназначено».
        
        Для чего используется РВ?
        Регистратор выбытия (далее — РВ) предназначен для отправки в ИС МДЛП информации о выводе лекарственных препаратов из оборота при отпуске лекарств без оплаты получателем и при отпуске ЛП в медицинских и иных организациях с мед. лицензией для оказания медицинской помощи.
        
        РВ НЕ предназначен для отправки в сведений о приемке товара, операциям внутреннего перемещения и другим логистическим операциям.
        Также РВ НЕ предназначен для отправки сведений по операциям вывода из оборота ЛП, если они не заканчиваются применением ЛП (передача на уничтожение, списание в ходе инвентаризации и т.п.) и по продаже ЛП с частичной льготой (в этом случае должна использоваться контрольно-кассовая техника — ККТ).
        
        РВ может использоваться для проверки информации по упаковкам ЛП, имеющейся в ИС МДЛП и для автоматизации работы с маркированными ЛП в информационной системе мед. организации или аптеки. Такие функции предусмотрены в РВ, но их использование необязательно.
        
        Что делать в случае поломки РВ?
        Для решения данного вопроса необходимо составить обращение оператору ЦРПТ:
        — написав письмо на электронную почту службы технической поддержки: support@crpt.ru
        — зарегистрированные в ИС МДЛП участники оборота для создания обращений в службу технической поддержки могут использовать портал https://support.crpt.ru, на котором можно посмотреть статус работы с созданными обращениями и получить другую полезную информацию.
        
        В обращении необходимо указать:
        1. Описание поломки
        2. Полный адрес места деятельности
        3. Серийный номер РВ
        4. Контактное лицо
        5. Номер телефона для связи
        6. Фото ошибки / дефекта
        
        Можно ли заменить регистратор выбытия на другую модель?
        Возможность смены модели регистратора выбытия на другую (1.0 / 2.0 / 3.0) не предусмотрена.
        
        Кто и когда осуществляет метрологическую проверку РВ?
        Регистратор выбытия не относится к измерительным приборам, поэтому метрологическую проверку производить не требуется.
        
        Какой тип соединения с сетью/интернетом использует РВ?
        РВ — являются мобильными устройствами и предполагают использование по типу соединения:
        — Ethernet (только модели 1.0 и 3.0, для модели 2.0 в комплекте идет роутер MicroTic)
        — GSM Modem (только модель 3.0, модем приобретается участником самостоятельно, в комплект не входит)
        — WI-FI (все модели)
        — Sim-карта (только модель 1.0)
        
        Тип подключения определяется участником самостоятельно, исходя из процессов и технических возможностей, используемых при обороте ЛП на стороне участника оборота товаров.
        
        Алгоритм работы с РВ для организаций и ИП, оказывающих платные мед услуги (стоматологии, косметологии и т.д.)
        Закупка ЛП в розницу в аптеке:
        Организации обладающие лицензией на розничную торговлю ЛП могут осуществлять отпуск ЛП только физ. лицам.
        Для продажи ЛП юридическим лицам в целях дальнейшего предоставления услуги, аптека должна обладать лицензией на оптовую продажу ЛП и производить реализацию ЛП в рамках отгрузки от одного юр. лица другому.
        Соответственно частные организации с медицинской лицензией в целях предоставления услуги обязаны закупать ЛП через юр. лицо, а не в рамках розничной продажи.
        ФАС России от 19.09.2017 N ИА/64899/17 «О необходимости наличия у участников закупки лекарственных препаратов лицензии на оптовую торговлю лекарственными препаратами»
        https://legalacts.ru/doc/pismo-fas-rossii-ot-19092017-n-ia6489917-o-neobkhodimosti/
        Федеральный закон от 12.04.2010 N 61-ФЗ (ред. от 02.08.2019)
        
        В ИС МДЛП необходимо передавать сведения о приемке / перемещении / выбытии.
        
        Приемка ЛП: возможно получение ЛП по прямому акцептированию и обратному.
        При прямом акцептировании сначала поставщик передает сведения по 415 схеме, затем получатель подтверждает приемку по 701 схеме.
        При обратном акцептировании сначала получатель отправляет 416 схему, затем поставщик подтверждает по 701. При этом поставщик должен добавить получателя в доверенные контрагенты.
        
        Перемещение ЛП: при наличии нескольких мест деятельности и перемещении ЛП между ними, необходимо передавать данные по 431 схеме.
        
        Выбытие ЛП: производится через регистратор выбытия (предоставляется бесплатно всем организациям с медицинской лицензией) перед использованием ЛП.
        Выбывать ЛП через кассу при оказании платных услуг не требуется, при этом по желанию можно просто указывать в чеке SGTIN использованного ЛП.
        
        Как узнать какой РВ на какой адрес предоставлен?
        На момент получения регистратора выбытия (РВ) в личном кабинете на вкладке «Договоры» должен быть акт приема-передачи (по одному акту на каждый РВ). В акте приема-передачи указан адрес места деятельности и серийный номер регистратора выбытия. На коробке с РВ имеется наклейка, с серийными номерами РВ и модуля безопасности. Серийные номера РВ 3.0 начинаются с символов IZM, серийные номера РВ 1.0 и 2.0 состоят полностью из цифр. Сопоставив серийные номера на коробках с РВ с серийными номерами из актов приема-передачи можно определить, к какому адресу места деятельности привязан данный РВ. Также серийные номера можно посмотреть в меню самого РВ. Подробную инструкцию по нахождению данной информации можно найти в руководстве пользователя РВ.
        
        В какой момент бизнес-процесса «отпуск в отделение» необходимо применять регистратор выбытия при использовании в медицинском учреждении?
        На усмотрение участника оборота оставлен вопрос определения места вывода из оборота в медицинских организациях — при отпуске в отделение в больничной аптеке или в отделении при выдаче со склада отделения.
        
        Алгоритм использования РВ для аптек.
        1.Получатель ЛП предоставляет сотруднику (первостольнику) льготный рецепт.
        2.Сотрудник подбирает препараты в соответствии с полученным рецептом, при этом сканирует коды маркировки на них. Важно: отсканирована должна быть каждая упаковка. При повторном сканировании упаковки РВ не добавит ее в список для вывода из оборота, а сообщит пользователю об ошибочном сканировании.
        3.Сотрудник вводит дату, серию и номер рецепта (на РВ или в программе, которая умеет управлять РВ) и выбирает действие «Зарегистрировать выбытие». После индикации на РВ, что запрос отправлен, отдает ЛП получателю. Важно: ожидать ответ ФГИС МДЛП о результатах попытки вывода ЛП из оборота в момент отпуска ЛП не нужно. Для минимизации вероятности нарушений в сфере оборота ЛП желательно проверить возможность вывода из оборота всех упаковок ЛП до того, как они могут быть выданы получателю. Это не обязательно делать при приемке товара, это не следует делать при отпуске товара, это может быть сделано в любой момент времени, начиная с приемки товара и до момента подбора ЛП с целью отпуска получателю.
        
        Как будет осуществляться взаимодействие товароучётной системы (ТУС) и РВ.
        Взаимодействие будет осуществляться по открытому API.
        Алгоритмы взаимодействия, а так же методы API описаны в документе «Выдержка из технической спецификации на поставку регистратора выбытия» по ссылке.
        
        Необходим ли организации сканер помимо РВ?
        РВ предназначен только для выбытия ЛП, с помощью него нельзя принимать товар.
        
        Сканер необходим для приемки лекарственных препаратов в организации. Единственным критерием к нему является умение считывать Data-matrix код.
        Если же в вашей организации очень небольшой оборот товара (менее 10 упаковок в день), для внесения сведений о приёмке в ИС МДЛП можно пользоваться человекочитаемой информацией на упаковке лекарственного препарата — вносить её в систему вручную.
        
        Ежемесячная стоимость регистратора выбытия, если бы он давался организациям в аренду.
        Согласно договору, регистратор выбытия предоставляется на безвозмездной основе. Арендная стоимость не предусмотрена. Залоговая стоимость оборудования указана в акте приема-передачи. Вопрос постановки на балансовый учет находится в компетенции отдела бухгалтерии Вашей организации. Все необходимые документы можно скачать в личном кабинете с оттисками электронных подписей.
        
        При выводе лекарств через РВ, необходимо ли загружать в ИС МДЛП какие либо документы?
        При использовании РВ, в ИС МДЛП автоматически отправляется документ 10531 или 10521, в зависимости от типа выбытия (мед. применение или льготный рецепт), загружать вручную более ничего не требуется.
        
        При осуществлении тестового выбытия в ИС МДЛП отправляется документ 20521 — подключение регистратора выбытия.
        
        У нас заберут РВ, если мы не будем им пользоваться 6 месяцев до начала маркировки?
        Согласно договору, пункт 7.7: Оператор вправе потребовать от Участника возвратить Оператору Оборудование, в случае если Оборудование не используется Участником в течение 6 месяцев подряд.
        
        В связи с переносом срока начала обязательной маркировки, время между получением регистратора выбытия и началом обязательной маркировки не будет учитываться при подсчете времени по пункту 7.7 договора.
        
        Можно ли настроить регистратор выбытия на передачу сведений в тестовый контур «Песочница»?
        Регистратор выбытия настроен на промышленный контур ИС МДЛП. Настройка РВ на тестовый контур «Песочница» не реализована. К реализации не планируется.
        
        Можно ли зарегистрировать в МДЛП выбытие из оборота сразу всей третичной упаковки целиком, без ее распаковки и сканирования каждой отдельной пачки?
        Выбытие можно произвести только вторичной упаковки. Если вторичная упаковка вложена в третичную, необходимо SSCC распаковать, предварительно получив из ИС МДЛП содержимое SSCC.
        
        Алгоритм работы РВ.
        1. При подключении к компьютеру:
        Регистратор выбытия может быть подключен к персональному компьютеру сотрудника, регистрирующего вывод из оборота лекарственных препаратов. В этом случае:
        — РВ использует подключение к сети интернет, установленное на данном компьютере.
        — РВ может использовать как встроенный в него сканер кодов маркировки, так и подключенный к этому же компьютеру сканер 2D-штрихкодов стороннего производителя (например, стационарного типа), если на компьютере установлена информационная система, умеющая управлять РВ.
        2. При подключении к локальной вычислительной сети организации:
        Если РВ подключен в сеть организации и не находится непосредственно на рабочем месте сотрудника, регистрирующего вывод ЛП из оборота, подключение к нему и его использование возможно с любого компьютера в локальной сети организации. При этом использование встроенного сканера кодов маркировки невозможно и такие рабочие места должны быть оснащены сканерами 2D-штрихкодов. Также возможно использование серийно выпускаемых терминалов сбора данных с последующей передачей информации в РВ.
        Данное использование РВ невозможно без установки на рабочих местах пользователей информационной системы, управляющей работой РВ.
        3. Автономное использование РВ:
        При отсутствии подключения РВ к информационной системе участника оборота, РВ может отправлять данные о выводе ЛП из оборота через любое подключение к Интернет. В этом случае:
        — дополнительные сведения, необходимые для регистрации вывода ЛП из оборота (кроме содержащихся в коде маркировки), например, дату льготного рецепта или документа-основания, необходимо будет ввести с клавиатуры РВ;
        — необходимо помнить, что отсутствие в ИС МДЛП сведений о приемке ЛП участником оборота приведет к ошибке при попытке вывода этих ЛП у этого участника оборота и может служить сигналом о нарушении правил оборота маркированных ЛП.
        4. Если в организации используется облачное решение для автоматизации учета лекарств:
        В ряде регионов РФ реализованные облачные решения для ведения учета ЛП в государственных медицинских организациях. Возможно использование подобных решений по автоматизации в крупных аптечных сетях или сетях медицинских организаций. В этом случае возможна установка РВ в центре обработки данных. При этом оснащение рабочих мест сканерами 2D-штрихкодов должно выполняться за счет участника оборота.
        
        Кто будет настраивать регистратор выбытия, подключать к сети и интегрировать с ПО?
        Оборудование — регистратор выбытия, доставляется до участника в подготовленном, проверенном и готовом к эксплуатации состоянии.
        Подключение к локальной сети учреждения, а также интеграция устройства с программным обеспечением участника, производится участником самостоятельно.
        В комплекте с регистратором выбытия прикладываются необходимые инструкции.
        
        Также инструкции в электронном виде можно скачать на сайте Честный ЗНАК, в разделе «Регистраторы выбытия».
        
        Если РВ не будет синхронизироваться с системой Глонасс длительное время, какие последствия могут быть при этом? Может ли он заблокироваться насовсем?
        Для корректной работы и обновления ПО РВ КМ необходима точная настройка внутренних часов реального времени. Настройка часов производится по сигналам ГНСС ГЛОНАСС. Для настройки требуется, чтобы РВКМ имел связь как минимум с тремя спутниками ГЛОНАСС. В случае, если в течение суток, связи со спутниками не было, РВ блокируется до тех пор, пока связь не будет установлена. Других блокировок (более длительной или окончательной) по этой причине не предусмотрено.
        
        Интеграция регистратора выбытия со своей информационной системой (ИС).
        Все инструкции по интеграции находятся на сайте.
        
        Согласно пункту 2.3.3 Договора по предоставлению регистратора выбытия лекарственных препаратов субъектам обращения лекарственных средств на безвозмездной основе:
        
        Участник принимает на себя следующие обязательства:
        Осуществлять действия по подключению оборудования к своему программно-аппаратному комплексу согласно требованиям, установленным инструкцией по эксплуатации оборудования и иной технической документацией, размещенной на официальном сайте Оператора в информационно-телекоммуникационной сети «Интернет» (далее — Сайт Оператора, Правила), а также самостоятельно осуществлять интеграцию оборудования со своим программно-аппаратным комплексом.
        
        Если Вы используете программного обеспечение, предоставляемое другой организацией, рекомендуется обратиться в данную организацию.
        
        При тестировании регистратора выбытия (РВ), а именно функции «Проверка КМ» при сканировании кода маркировки, ошибка «Проверка формата не пройдена: Не найден срок годности».
        Перед началом работы с регистратором выбытия 1.0 / 2.0, необходимо произвести обновление прошивки согласно инструкции пользователя.
        
        Если данного информационного окна не появилось «обновление OC», необходимо открыть меню настройки => об устройстве => обновление системы => обновить. Также после активации приложения «клиент оператора», необходимо зайти настройки => обновление прошивки платы МБ, дождаться окончания обновления ПО.
        
        Настройка Wi-Fi РВ 1.0 и 2.0.
        Инструкцию по настройке можно найти в руководстве пользователя, на 11 странице, раздел «Подключение к Wi-Fi».
        
        РВ 1.0 и 2.0. Как выйти из приложения «клиент оператора»? Не работает кнопка ESC.
        Нажмите кнопку «F1», далее кнопкой стрелкой спуститесь до пункта «Выход» и нажмите кнопку «Ent».
        Кнопкой «Esc» можно выйти только до ввода PIN кода.
        
        РВ 1.0 смена раскладки.
        Клавишей F1 можно менять раскладку между 3 режимами: русская, английская, цифры.
        При необходимости ввести заглавные буквы требуется несколько раз нажимать на кнопку с соответствующими буквами — после строчных букв последуют заглавные.
        
        РВ 1.0 и 2.0. При выполнении операции «Обновить базу ЛП» возникает ошибка «сервер МДЛП не отвечает. Авторизация не пройдена».
        Выполните обновление прошивки регистратора выбытия:
        
        1. Выйти из приложения «Клиент оператора» (нажать F1, пролистать появившееся меню вниз и выбрать «Выход».
        2. Открыть меню с приложениями (кнопка внизу экрана в виде круга с 6 точками).
        3. Открыть приложение «Обновление системы».
        4. Нажать «Обновить».
        
        РВ 1.0 и 2.0 появляется надпись «СРОК МБ РВ истек» в приложении «клиент оператора».
        Появление уведомления «Срок МБ истёк» возможно. Необходимо выключить/включить РВ. Все устройства приходят активированными и дополнительных манипуляций по активации не требуют.
        
        При сканировании DataMatrix ничего не происходит. РВ 1.0 и 2.0.
        Рекомендуется убедиться, что встроенный сканер 2D не заклеен защитной пленкой. Если имеется защитная пленка, то необходимо её удалить.
        Сканируемый лекарственный препарат желательно размещать не далее, чем на расстоянии 10-15 см от луча лазера сканера. Сканер следует направлять немного под углом относительно DataMatrix. При поиске оптимального положения можете перемещать сканер вверх и вниз относительно кода маркировки.
        
        Если произвести сканирование кода маркировки вне предназначенных для этого меню, ничего не произойдет.
        Для проверки кода маркировки в приложении клиент оператора необходимо выбрать «Проверка КМ» и когда появится надпись «Отсканируйте 2D штрих код» выполнить сканирование на кнопку «SCAN».
        Для тестового выбытия необходимо перейти в меню «Диагностика — Тестовое выбытие» и когда появится надпись «Просканируйте штрихкод нажав кнопку SCAN» выполнить сканирование на кнопку «SCAN».
        Аналогичный алгоритм сканирования при формировании выбытия по льготному рецепту или для мед. применения.
        
        Активация появляется на пару секунд и исчезает — перейти на нее нет возможности. РВ 1.0 и 2.0.
        Устройство активировано. Кратковременное появление надписи «Активация РВ» до ввода Пин-кода возможно.
        
        При вводе PIN-кода появляется ошибка «МБ не инициализирован или отсутствует». АТОЛ
        Выполните выключение и включение регистратора выбытия (РВ): зажать кнопку выключения, затем выбрать «Отключить питание», затем включить устройство зажав кнопку включения (внизу слева для РВ 2.0 / внизу посередине для РВ 1.0 ).
        
        Если после включения устройства и ввода пин-кода ошибка повторилась, подождите 10-15 секунд и введите пин-код повторно. Если ошибка осталась после перезагрузки и двух попыток ввода пин-кода — сообщите об этом, указав какие действия Вы уже произвели, в службу поддержки support@crpt.ru.
        
        Поддерживает ли РВ 1.0 и 2.0 работу через прокси сервер?
        Регистратор выбытия 1.0 и 2.0 не поддерживает работу через прокси сервер.
        
        В приложенной инструкции к РВ 1.0 и 2.0 написано, что его необходимо активировать, но такой пункт в меню РВ отсутствует.
        Для упрощения старта работы с регистраторами выбытия (РВ) для участников оборота, РВ активируются перед доставкой. Перед началом работы с РВ, Вам достаточно включить РВ, установить связь со спутниками и произвести тестовое выбытие.
        
        Тестовое выбытие РВ 1.0 и 2.0.
        Для проверки успешности отправки данных с регистратора выбытия (РВ) можно выполнить тестовое выбытие кода маркировки (КМ): в приложении «Клиент оператора» вызвать боковое меню (кнопка F1 для РВ 1.0 или провести из левого края экрана вправо для РВ 2.0), выбрать «Диагностика» — «Тестовое выбытие».
        
        При переходе в режим тестового выбытия предлагается отсканировать тестовый КМ, который можно увидеть в «Паспорте» на используемый экземпляр РВ КМ. При корректно выполненных настройках на экране будет отображено уведомление: тестовое выбытие успешно зарегистрировано.
        
        На экране РВ 1.0 или 2.0 нарисован ключ (где показывается заряд), что это за ключ?
        Значком в виде ключа отображается VPN соединение. Оно необходимо, если требуется с РВ подключиться к защищённой (VPN) сети организации.
        
        Установка карты памяти микро-SD (РВ 1.0).
        При необходимости увеличить объем внутренней памяти, можно установить съемный внешний носитель — микро-SD. Слот для микро-SD расположен в отсеке АКБ, поэтому первоначально необходимо открыть крышку отсека АКБ, извлечь аккумулятор и отсоединить кабель. Правильная установка карты в слот изображено в отсеке АКБ. Микро-SD устанавливается в верхнюю часть смежного разъема (более углубленный разъем), сим-карта — в нижнюю. Сим-карту/микро-SD необходимо медленно вставлять в соответствующий слот до щелчка. Микро-SD считается «установленной» (подключенной), когда устройство распознает карту и откроет к ней доступ.
        
        Как узнать какой указывать IP адрес и порт при подключении к регистратору выбытия 1.0 и 2.0.
        Необходимый IP адрес и порт для подключения можно найти в меню регистратора выбытия, после его подключения к сети. Приложение клиент оператора — Диагностика — Диагностика составных модулей — Сетевой режим.
        
        Длительное время не удается поймать сигнал ГЛОНАСС (не в помещении) РВ 1.0 и 2.0.
        Выключите и включите устройство и повторите поиск спутников. Следите за уровнем сигнала / шума в приложении «Клиент оператора», меню «Диагностика — Диагностика составных модулей — Модуль ГНСС». Для получения актуальной информации на текущий момент необходимо периодически возвращаться в предыдущее меню и снова заходить в «Диагностика составных модулей».
        
        Можно ли вставить в РВ 1.0 свою SIM-карту?
        В регистратор выбытия 1.0 можно вставить свою SIM-карту. Для установки SIM-карты необходимо открыть крышку отсека АКБ, извлечь аккумулятор и отсоединить кабель. Правильная установка карты в слот изображена в отсеке АКБ. Микро-SD устанавливается в верхнюю часть смежного разъема (более углубленный разъем), SIM-карта — в нижнюю. SIM-карту/микро-SD необходимо медленно вставлять в соответствующий слот до щелчка. Обращаем Ваше внимание, что ООО «Оператор-ЦРПТ» не несет ответственность за работоспособность устанавливаемых SIM-карт. По вопросам работы SIM-карты необходимо обращаться к поставщику SIM-карты. Выбор поставщика услуг по SIM-картам не регламентируется Оператором ЦРПТ и осуществляется участником оборота товаров самостоятельно.
        
        Нужно ли обновлять ПО РВ 1.0 и 2.0?
        Если регистратор выбытия (РВ) выводит сообщение о доступности обновления, то необходимо обновить РВ.
        
        Подробная инструкция по обновлению имеется в руководстве пользователя в разделе «Обновление ОС»:
        РВ 1.0 (желтая кнопка)
        РВ 2.0 (красная кнопка)
        
        При подключении кабеля интернета к РВ 3.0, значок «компьютеры» загорается красным цветом вместо зеленого. И в компьютере указывается, что сеть не найдена.
        Красный символ означает, что регистратор не подключен к сети. Нужно попробовать подключить регистратор к каналу, который точно имеет доступ к сети. Дополнительно необходимо проверить не настроен ли регистратор для статического подключения в случае, если подключение динамическое (сервис => настройки => настройка сети => конфигурация ethernet => способ настройки («авто» для динамического соединения, «ручной» для статического). Также можно воспользоваться подключением по WiFi.
        
        Как узнать какой указывать IP адрес и порт при подключении к регистратору выбытия 3.0?
        Необходимый IP адрес для подключения можно найти в меню регистратора выбытия, после его подключения к сети. Главное меню — Информация — строка «IP». Порт по умолчанию — 8080.
        
        Длительное время не удается поймать сигнал ГЛОНАСС (не в помещении) РВ 3.0.
        Поиск устройством спутников может занимать до 30 минут.
        Перезагрузите устройство и повторите поиск спутников. Следите за уровнем сигнала CNR в меню «Сервис — Проверка РВ — Спутники».
        
        Настройка Wi-Fi РВ 3.0.
        а. Выберите пункт меню «Сервис» и нажмите зеленую клавишу .
        б. В меню «Сервис» выберите пункт меню «Настройки» и нажмите зеленую клавишу .
        в. В меню «Настройки» выберите пункт меню «Управление интерфейсами» и
        нажмите зеленую клавишу.
        г. В меню «Настройки сети» выберите пункт меню «Настройки сети» и нажмите зеленую
        клавишу .
        д. С помощью клавиш курсора «вверх», «вниз» выберите интерфейс WI-FI и нажмите зеленую клавишу.
        е. На появившееся приглашение сохранить настройки ответе «Да», нажав зеленую клавишу.
        ж. После возврата в меню «Настройка сети» выберите пункт «Конфигурация WIFI».
        з. В самой верхней строчке окна выберите, в зависимости от настроек вашей сети, способ получения IP-адреса «Авто (DHCP)» или «Ручной» (выбор нужного значения в поле осуществляется центральной белой кнопкой).
        и. В случае выбора «Авто (DHCP)» никакие другие настройки в окне менять не нужно, в противном случае необходимо заполнить все оставшиеся поля( «IP адрес», «Маска подсети», «Адрес шлюза», «Адрес DNS»).
        к. Сохраните настройки, нажав зеленую клавишу и подтвердив сохранение.
        л. После возврата в меню «Настройка сети» выберите пункт «Выбор сети WI-FI».
        м. В появившемся окне заполните поля «Ввод SSID» и «Ввод пароля». Если сеть является скрытой необходимо выбрать пункт «Скрытая». Просмотреть список доступных сетей и выбрать нужную можно выбрав пункт-кнопку «Выбрать SSID».
        н. Нажмите зеленую клавишу , чтобы подключиться к выбранной сети WI-FI.
        о. После успешного подключения РВКМ к сети WI-FI в панели состояния появится значок подключения. Зелёный цвет этого значка обозначает, что РВКМ успешно подключился к СЭ.
        
        РВ подключается к спутникам, но значок интернета желтый, а не зеленый как должно быть по инструкции.
        Уровень приема сигнала Wi-fi на регистраторе выбытия определяется цветовой индикацией значка на дисплее устройства. Если цвет зеленый то прием сигнала отличный,если желтого цвета то средний (данный цвет индикатора не несет в себе критичности для отправки сведений с РВ), если индикатор красного цвета то рекомендуем осуществить проверку подключения.
        
        Условия предоставления регистратора выбытия.
        РВ предоставляются Оператором ЦРПТ по заявкам участников оборота бесплатно.
        Инструкция по формированию заявок
        Нужен ли постоянный сигнал спутника для работы регистратора выбытия?
        Связь регистратора выбытия со спутниками нужна только раз в сутки для синхронизации времени и контроля соответствия места выбытия лекарственного препарата фактическому. Для выполнения выбытия лекарственных препаратов связь со спутником не нужна.
        Для получения сигнала достаточно нескольких минут, после чего регистратор может работать без связи еще 24 часа.
        
        При подписании документов на вкладке «Договоры» возникает ошибка — «Невозможно создание объекта сервером программирования объектов» (браузер Internet Explorer).
        Внизу экрана должно быть сообщение от браузера «Эта веб-страница пытается запустить надстройку Модуль внешнего интерфейса усовершенствованной Э... издателя CRYPTO-PRO», справа от этого сообщения имеется кнопка «Разрешить». Нажмите, пожалуйста, кнопку «Разрешить» и попробуйте повторно подписать соглашение.
        
        Как получить РВ, если у организации несколько мест осуществления деятельности (МД)?
        Адрес предоставления регистратора выбытия соответствует адресу места осуществления деятельности организации. Соответственно, если у Вашей организации несколько мест осуществления деятельности, то согласно лицензии на медицинскую деятельность, необходимо подать несколько заявок на предоставление регистратора выбытия — для каждого места осуществления деятельности организации.
        
        Для чего заполняется поле корреспондентский счет?
        Поле корреспондентского счета является обязательным для заполнения, потому что договор по форме Минпромторга предполагает заполнение реквизитов.
        
        Ранее была информация, что заказать РВ можно только до определённого числа. Возможно ли заказать РВ сегодня?
        Согласно Постановлению Правительства Российской Федерации от 31.12.2019 № 1954 «О внесении изменений в постановление Правительства Российской Федерации от 14 декабря 2018 г. № 1556»», заявку (в электронной форме) на получение регистратора выбытия необходимо подать в срок до 15 февраля 2020 г. либо в течение 7 календарных дней со дня регистрации в МДЛП.
        
        Срок начала обязательной маркировки перенесен на 01.07.2020 (кроме категории 7ВЗН), но промаркированные лекарственные препараты уже могут поступать в оборот.
        Рекомендуем Вам подать анкету на предоставление регистратора выбытия (РВ) в максимально сжатые сроки, это позволит заблаговременно получить РВ и отработать Ваши бизнес процессы.
        
        При переходе на вкладку «Договоры» загружается чистый белый лист или идёт перенаправление на начальную страницу / страницу авторизации / страницу входа в личный кабинет.
        Если используется браузер Internet Explorer 11:
        
        Для устранения ошибки необходимо изменить настройки безопасности браузера Internet Explorer .
        Нажмите на кнопки в виде шестеренки в верхней правой части браузера (или сочетание клавиш Alt + x) и выберите пункт «Свойства браузера».
        Перейдите на вкладку «Безопасность», в раздел «Интернет».
        Установите уровень безопасности «средний» или «выше среднего». После этого необходимо перезапустить браузер.
        Если после выполнения вышеописанных рекомендаций ошибка останется, воспользуйтесь, пожалуйста, браузером Google Chrome или Яндекс браузером последней версии.
        
        Плагин КриптоПро для Google Chrome или Яндекс браузера можно установить, открыв ссылку в этих браузерах.
        
        Если используется другой браузер:
        Загрузка вкладки «Договоры» в виде пустой белой страницы связана с медленным интернет соединением или блокировкой загружаемых данных.
        Для устранения данной ошибки попробуйте произвести следующие действия:
        1. Очистить КЭШ и куки браузера
        2. Отключить антивирус
        3. Отключить плагины антивирусов в браузере
        4. Отключить плагины VPN в браузере
        5. Отключить блокировщики рекламы в браузере
        
        При подписании документа на вкладке «Договоры» возникает ошибка «Не удается построить цепочку сертификатов для доверенного корневого центра».
        Для устранения ошибки «Не удается построить цепочку сертификатов для доверенного корневого центра» необходимо установить корневой сертификат удостоверяющего центра и корневой сертификат головного удостоверяющего центра.
        
        При заполнении анкеты на РВ, ошибочно выбрана лицензия НЕ на мед. деятельность. Что делать в данном случае?
        Необходимо подать заново анкету с лицензией на медицинскую деятельность.
        
        Как поменять пункты в договоре на РВ?
        Типовая форма договора на оснащение регистратором выбытия утверждена Приказом Министерства промышленности и торговли российской Федерации № 2973 от 13.08.2019 г.
        Изменение типовой формы договора не предусмотрено.
        
        Руководитель организации действует на основании приказа или устава. Что указывать в пункте «Действует на основании» при заполнении заявления на формирование договора?
        Если руководитель организации действует на основании приказа или устава, то при заполнении анкеты на РВ, можно выбрать «учредительный документ». Выбор данного варианта не будет считаться ошибкой.
        
        Какое количество РВ возможно получить/сколько РВ будет предоставляться на 1 место деятельности?
        На одно место осуществления деятельности (МД) предполагается выдача одного регистратора выбытия (РВ).
        
        Если на одном МД производится выбытие множества лекарственных препаратов (ЛП), используются разные товароучётные системы, то необходимо подключить РВ к сети организации. При этом устройство сможет по сети получать информацию из разных источников и регистрировать выбытие ЛП.
        
        Если в несколько лицензий внесён один и тот же адрес, например, по которому производится бесплатная выдача лекарств, как по рецептам, так и для мед. применения, то это будет считаться одним местом деятельности. Для осуществления выбытия лекарств РВ так же можно будет подключить к сети организации.
        
        Как скачать договор на предоставление РВ для ознакомления?
        Скачать и просмотреть договор можно в личном кабинете на вкладке «Профиль — Анкеты и договоры — Договоры». После подписания со стороны ООО «ЦРПТ» (статус «Подписан сторонами») в конце документа будут присутствовать оттиски электронных подписей.
        Также с типовой формой договора можно ознакомиться по ссылке.
        
        Для чего нужен акт выполненных работ из приложения № 5 к договору на РВ?
        Акт выполненных работ из приложения № 5 к типовой форме договора по предоставлении регистратора выбытия оформляется в случае произведения ремонта регистратора выбытия.
        
        Как заполнять поля «БИК», «Наименование банка», «Расчетный счет», «Корреспондентский счет» в заявлении на формирование договора, если у организации только Лицевой счет в комитете финансов?
        Если у организации только лицевой счет в комитете финансов, то в поле «Наименование банка» необходимо заполнить: «л/с №хххххх в Комитете финансов» (вместо хххххх необходимо указать номер лицевого счета).
        При этом поля «БИК», «Корреспондентский счет» и «Расчетный счет» заполняются нулями.
        
        Как заполнять поля «БИК», «Наименование банка», «Расчетный счет», «Корреспондентский счет» в заявлении на формирование договора, если у ИП они отсутствуют?
        При отсутствии у ИП банковского счета, поля «БИК», «Наименование банка», «Корреспондентский счет» и «Расчетный счет» заполняются нулями.
        
        Где взять товарную-накладную на РВ?
        Согласно договору по форме МинПромТорга, товарной накладной к РВ нет. Акт приема-передачи отображается в личном кабинете.
        
        При заполнении анкеты на РВ, не получается указать номер телефона.
        При заполнении анкеты на РВ В в графах «контакты руководителя организации», «контакты ответственного сотрудника», «контакты лиц, обеспечивающих доступ к месту установки» необходимо указать номер телефона и через запятую — имя контактного лица.
        
        При подписании документа на вкладке «Договоры» в браузере Internet Explorer возникает ошибка «Отказано в доступе».
        В случае возникновения ошибки «Отказано в доступе» при подписании документов на вкладке «Договоры» в браузере Internet Explorer, воспользуйтесь, пожалуйста, другим браузером, например, Google Chrome или Яндекс браузер.
        
        В договоре на РВ пустые вложения / незаполненные поля.
        В Договоре по предоставлению регистратора выбытия, приложения представлены как не заполненный образец типовой формы. Они формируются (заполняются) и подписываются как отдельный документ.
        
        Заявка на предоставление регистратора выбытия (приложение 1) формируется на основании отправленных Вами анкет на РВ.
        Акт приема-передачи (приложение 2) необходимо подписывать при получении регистратора выбытия.
        
        При подписании документа на вкладке «Договоры» возникает ошибка: «Цепочка сертификатов обработана, но обработка прервана на корневом сертификате, у которого отсутствует отношение доверия с поставщиком доверия&raq
        Для устранения ошибки «Цепочка сертификатов обработана, но обработка прервана на корневом сертификате, у которого отсутствует отношение доверия с поставщиком доверия» необходимо установить корневой сертификат удостоверяющего центра и корневой сертификат головного удостоверяющего центра.
        
        В акте приема — передачи РВ прописана сумма 36845р. должна ли её выплачивать организация?
        РВ предоставляются Оператором ЦРПТ по заявкам участников оборота бесплатно. В акте приема-передачи прописана залоговая сумма в случае утери оборудования (РВ).
        При получении РВ платить залоговую сумму не требуется.
        
        У организации нет корреспондентского счёта (кор. счёт). Как заполнить анкету если данное поле является обязательным?
        Если отсутствует корреспондентский счёт, данное поле необходимо заполнить нулями.
        
        В течение какого срока после подписания договора, будет направлен РВ?
        Согласно пункту 2.1.1 Договора по предоставлению регистратора выбытия, оборудование предоставляется в течении 30 календарных дней с момента подписания участником заявки на предоставление регистратора выбытия (приложение № 1 к Договору).
        
        При подписании документа на вкладке «Договоры» возникает ошибка «Не установлен корневой сертификат».
        Для устранения ошибки «Не установлен корневой сертификат» необходимо установить корневой сертификат удостоверяющего центра и корневой сертификат головного удостоверяющего центра.
        
        Заполнение анкет на РВ. При нажатии на «Плюс» появляется меню с 6 пунктами: Идентификатор МД, Идентификатор ФИАС, Адрес, Субъект РФ, Статус, Показать анкеты.
        Для заполнения анкеты на РВ требуется предварительно добавить место деятельности с действующей фарм/мед лицензией на вкладке «Профиль — Адреса — Места деятельности».
        После добавления адреса на вкладке «Профиль — Анкеты и договоры — Заполнение анкет на РВ», должна появиться строка с информацией о МД и в правой части этой строки будет кнопка «Плюс». При нажатии на эту кнопку откроется окно заполнения анкеты.
        
        Подробную инструкцию по добавлению места деятельности можно найти в руководстве пользователя, раздел 4.5 (страница 75)
        Руководство пользователя можно найти по ссылке.
        
        Заполнение анкет на РВ. Что заполнять в поле «IT служба» при заполнении анкеты на РВ?
        В поле «IT служба» необходимо выбрать либо «Очная» — если в организации есть в штате сотрудник IT (например, системный администратор), либо «Заочная» — если нет сотрудника и организация использует сторонние услуги.
        
        При отсутствии штатного сотрудника службы IT в полях «Время работы ИТ поддержки «с», «Время работы ИТ поддержки «по», «Дни недели работы ИТ поддержки» и «Контакты ответственного сотрудника ИТ поддержки» заполняются данные Вашего сотрудника, который будет получать и подключать РВ.
        
        Заполнение анкет на РВ. Что указывать в графе «Среднесуточное количество отпускаемых вторичных упаковок лекарственных препаратов»?
        Необходимо указывать усредненное количество всех лекарственных препаратов, выводимых из оборота за сутки.
        
        Заполнение анкет на РВ. Что указывать в графе «Количество рабочих мест, на которых производится отпуск лекарственных препаратов»?
        Нужно указывать количество окон, в которых производится выдача ЛП. Если из одного окна, то необходимо указать одно окно.
        
        Заполнение анкет на РВ. Что указывать в графе «Полное наименование используемой товарно-учетной системы»?
        Необходимо указать полное наименование, версию программы и номер релиза, а также место развёртывания программы (на локальном рабочем месте, сетевое размещение, облачная реализация).
        Если товаро-учетная система не используется, написать «не используется».
        
        Заполнение анкет на РВ. Как заполнять графы с контактами?
        При заполнении граф с контактами необходимо указать номер телефона и имя контактного лица, например: «+11111111111, Имя».
        
        РВ 1.0 и 2.0 не видит спутники ГЛОНАСС в помещении. Что делать?
        1. Проверить актуальность прошивки программного обеспечения.
        2. При попытке синхронизации внутри помещения устройство следует размещать в непосредственной близости к окну, при этом избегать северной стороны здания.
        3. Синхронизация со спутниками происходит значительно быстрее при его регулярном использовании, и поиска спутников в одно и тоже время суток.
        4. Синхронизация проходит значительно быстрее на открытом воздухе даже при наличии городской застройки.
        5. Сроки синхронизации могут увеличиваться при наличии в непосредственной близости индустриальных и промышленных шумов (заводы, производства и другие предприятия, порождающие электромагнитные помехи).
        
        Для отслеживания доступности спутников на РВ следует запустить приложение «Клиент оператора», вызвать информационное меню, проведя по экрану слева направо (или нажать F1, если экран не сенсорный), выбрать «Диагностика — Диагностика составных модулей». В строке «Модуль ГНСС» будет отображаться информация по поиску спутников. Для получения актуальной информации на текущий момент необходимо периодически возвращаться в предыдущее меню и снова заходить в «Диагностика составных модулей». Если на улице сигнал остается равным 0, выключите и включите РВ.
        
        РВ 3.0 не видит спутники ГЛОНАСС в помещении. Что делать?
        1. Проверить актуальность прошивки программного обеспечения.
        2. При попытке синхронизации внутри помещения устройство следует размещать в непосредственной близости к окну, при этом избегать северной стороны здания.
        3. Синхронизация со спутниками происходит значительно быстрее при его регулярном использовании, и поиска спутников в одно и тоже время суток.
        4. Синхронизация проходит значительно быстрее на открытом воздухе даже при наличии городской застройки.
        5. Сроки синхронизации могут увеличиваться при наличии в непосредственной близости индустриальных и промышленных шумов (заводы, производства и другие предприятия, порождающие электромагнитные помехи).
        
         Для отслеживания доступности спутников на РВ следует зайти в «Сервис», «Проверка РВ», «Спутники». В данном меню будет отображаться информация по поиску спутников.
                """
    )


@dp.message_handler(commands=['digital_code'])
async def digital_code(message: types.Message):
    await message.reply(
        """
        Какую информацию содержит код Data Matrix?
        Код маркировки содержит следующие обязательные поля: серийный номер, глобальный идентификационный номер торговой единицы (GTIN). В код также могут быть включены (необязательно) следующие поля: дата истечения срока годности, номер серии, в установленных законодательством форматах. Также код маркировки в обязательном порядке содержит идентификатор ключа и код проверки для обеспечения криптографической защиты информации по алгоритму шифрования с открытым ключом (ГОСТ 34.10-2012).
        Состав информации определяется нормативным правовым актом Правительства Российской Федерации.
        
        Мы провели тест печати кода на нашей линии, но неудачно. Что мы делаем не так?
        Перенастройка линии в технологическое окно и без помощи специалистов производителя оборудования сериализации может привести не только к неудачному результату, но и к потере сервисных и гарантийных обязательств производителя. Мы не рекомендуем проводить тесты самостоятельно. Обращайтесь в ЦРПТ, задача решается либо по телефону, либо в течение получаса на производственной линии обязательно с привлечением технических специалистов производителя оборудования или его представителя/интегратора.
        
        Нужно ли менять размер упаковки лекарств из-за дополнительных знаков криптозащиты в цифровом коде маркировки?
        Криптографическая защита никак не влияет на размер кода, а только на его плотность. Рекомендованный по документам GS1 размер кода Data Matrix такой плотности составляет 16х16 мм. ЦРПТ провело успешные тесты по нанесению кода размером 10х10 и 12х12 мм. Этот размер является общеприменимым и не влечет за собой увеличения размера упаковки лекарственных препаратов.
        
        Каков процент отбраковки упаковок при печати цифровых кодов?
        Криптографическая защита никак не влияет на уровень брака. При корректной настройке оборудования процент отбраковки находится в интервале 0,2-0,7%.
        
        Какой используется протокол обмена с оборудованием для шифрования? Будут ли сразу предоставлены средства для обмена данных с наиболее популярными в России системами?
        На данный момент есть универсальный протокол API, который вы можете запросить у ЦРПТ, попробовать подключиться и протестировать его со своей системой (он совместим со всеми системами). Если у Вас самописная система, вы можете настроить ее с помощью подробной инструкции или обратиться к нашим специалистам.
        
        Если наша суточная потребность составляет более 2 млн серийных номеров, мы должны делать несколько запросов в течение суток?
        Вы можете делать запрос на месяц-год вперед. Сервер способен генерировать 2 млн кодов в течение 10 минут, согласно технической документации. Коды будут поступать на ваш регистратор по мере освобождения емкости.
        
        По запросу мы получим сразу все 2 млн кодов, или каждая производственная линия делает запрос на необходимое количество в зависимости от величины серий, количества номеров и т.д.?
        Если у Вас единая ERP-система управления производственными площадками, система это учитывает и сгенерированные коды будут автоматически распределяться на указанные в личном кабинете адреса площадок.
        
        Какое количество запросов на выдачу цифровых кодов в течение суток может поступать оператору от одного производителя?
        Неограниченное.
        
        Сколько пикселей должно приходиться на 1 элемент в DataMatrix коде при применении технического зрения?
        Минимально 3 пикселя в линейном разрешении (при печати в режиме 300dpi кода размером 12х12 мм). Оптимально - 6 пикселей (печать в режиме 600 dpi кода того же размера).
        
        На какие уровни упаковки необходимо наносить специальные коды?
        Цифровые коды наносятся на вторичный и третичный уровни, а также на первичный - в отношении лекарственных препаратов, для которых не предусмотрена вторичная упаковка.
        
        Как сгенерировать код?
        Генерация кода осуществляется следующими субъектами обращения лекарственных средств:
        — российскими производителями лекарственных препаратов, осуществляющими стадию «фасовка/упаковка ЛП во вторичную и/или третичную упаковку»;
        — представительствами иностранных юридических лиц, являющихся держателями регистрационных удостоверений лекарственных препаратов, на территории Российской Федерации;
        — держателями регистрационных удостоверений лекарственных препаратов, производство которых осуществляется за пределами территории Российской Федерации.
        
        Для вторичной (потребительской) упаковки
        Для генерации кода маркировки для нанесения на вторичную (потребительскую) упаковку субъектом обращения лекарственных средств осуществляется формирование первой и второй группы данных:
        1. Идентификатор применения (01) + GTIN.
        2. Идентификатор применения (21) + индивидуальный серийный номер вторичной (потребительской) упаковки (в случае выбора способа самостоятельного формирования серийного номера).
        
        Оператор системы мониторинга движения лекарственных препаратов для медицинского применения обеспечивает формирование и предоставление субъекту обращения лекарственных средств третьей и четвертой группы данных (код проверки и электронная подпись).
        
        Важная информация
        Индивидуальный серийный номер вторичной (потребительской) упаковки состоит из 13 символов в цифровой или буквенно-цифровой последовательности.
        Индивидуальный серийный номер должен генерироваться с учетом обеспечения его уникальности для каждого GTIN в течение всего срока функционирования системы мониторинга движения лекарственных препаратов для медицинского применения.
        Состав информации, наносимой на упаковку в человекочитаемом виде, определен в ст. 46 Федерального закона от 12 апреля 2010 года N 61-ФЗ «Об обращении лекарственных средств».
        
        Для групповой (транспортной) упаковки
        На групповую (транспортную) упаковку наносится код маркировки в виде линейного штрихового кода в формате Code 128 в соответствии с ГОСТ ИСО/МЭК 15417-2013, который содержит следующую структуру данных:
        — идентификатор применения (00);
        — символ расширения;
        — регистрационный номер эмитента группового кода, полученный в ГС1 РУС;
        — индивидуальный серийный номер торговой единицы, формируемый эмитентом группового кода по произвольному порядку присвоения;
        — контрольная сумма.
        
        Сведения, включенные в групповой код, могут дублироваться в виде читаемого печатного текста.
        Код маркировки формируется субъектом обращения лекарственных средств самостоятельно.

        """
    )


@dp.message_handler(commands=['equipment'])
async def equipment(message: types.Message):
    await message.reply(
        """
        Какое оборудование нужно для маркировки лекарств?
        Для печати кода производителям необходимо иметь оборудование для сериализации и агрегации  и регистратор эмиссии – оборудование, обеспечивающее криптозащиту. Оператор ЦРПТ предоставит регистраторы эмиссии всем фармпроизводителям в РФ за свой счет.
        
        Моя компания уже приобрела оборудование для участия в эксперименте, нужно покупать новое?
        Если предприятие уже участвует в эксперименте и установило оборудование для маркировки, то его менять не придется. Криптозащита может быть встроена в существующие бизнес-процессы, изменения будут минимальны. Серьезных финансовых затрат не потребуется.
        
        Картон какого качества необходим для печати кода?
        ЦРПТ обладает технологией печати цифровых кодов на всех видах картона с учетом особенностей подбора чернил.
        Специалисты Оператора системы маркировки помогут настроить оборудование для печати на используемом вами картоне.
        
        Сколько стоит оборудование для маркировки?
        Средняя стоимость оборудования для небольших фармацевтических производств варьируется от 3,1 млн рублей до 6 млн рублей, для высокоскоростных производственных линий, которые использует Big Pharma, — от 7,5 млн рублей до 14 млн рублей.
        Существуют ли какие-то льготные условия для покупки оборудования?
        Фонд развития промышленности в апреле 2018 года запустил программу по выдаче займов на покупку оборудования для маркировки лекарств. Условия выдачи займов льготные – получить от 5 до 50 млн рублей можно под 1% годовых сроком до 2 лет. При этом погашение основного долга начинается только со второго года пользования. ФРП уже успел одобрить заем питерскому фармпредприятию «Полисан», «Озон Фарм» и «Озон» из Самарской области (по 50 млн рублей), «Фармакор продакшн» из Санкт-Петербурга (50 млн рублей), «АВВА РУС» из Кировской области (50 млн рублей), пермскому производителю недорогих лекарств «Медисорб» (34,5 млн руб.) и т.д.
        
        По вопросам программы льготных займов Фонда :
        8 495 120-24-16
        8 800 500-71-29
        
        Оборудование каких производителей проверено на печать цифрового кода?
        Оборудование почти всех производителей, представленных на российском рынке было протестировано. В настоящий момент это более 10 производителей сериализационного оборудования и принтеров (печатающих устройств) и большинство моделей сканеров, представленных на рынке РФ.
        
        Какое оборудование потребуется для внедрения маркировки аптекам и медицинским учреждениям?
        Внедрение системы не потребует дополнительного переоборудования: для распознавания кодов Data Matrix используются универсальные сканеры, которые есть в каждой аптеке, их менять не придется. В соответствии с 54-ФЗ, предприниматели переходят на онлайн-кассы. Современные кассовые аппараты имеют возможность считывания цифровых кодов и их замена не потребуется. Аптекам просто нужно в плановом режиме менять фискальные накопители в онлайн-кассах. Больницы: ЦРПТ за свой счет оборудует регистраторами выбытия (аналог кассы в медицинских учреждениях, который фиксирует выбытие лекарственных препаратов) все медицинские учреждения. На это будет инвестировано 10 млрд рублей. Всего потребуется около 260 тыс. таких устройств.
        
        Придется ли менять складские сканеры?
        Если ваш складской сканер умеет читать DataMatrix, то менять его не придется.
        """
    )


@dp.message_handler(commands=['basic_actions'])
async def basic_actions(message: types.Message):
    await message.reply(
        """
        Основные действия участников системы мониторинга движения лекарственных препаратов для медицинского применения
        Как описать лекарственные препараты?
        Описание лекарственных препаратов осуществляется:
        - Российскими производителями лекарственных препаратов, осуществляющими стадию «фасовка/упаковка ЛП во вторичную и/или третичную упаковку»;
        - Представительствами иностранных держателей регистрационных удостоверений;
        - Иностранными держателями регистрационных удостоверений лекарственных препаратов.
        1. Зарегистрируйтесь на портале Ассоциации автоматической идентификации «ЮНИСКАН / ГС1 РУС» http://www.gs1ru.org/. После регистрации введите логин и пароль на сайте Ассоциации.
        
        2. Заполните информацию о лекарственных препаратах и получите GTIN, следуя «Руководству по работе в системе GS1».
        
        
        
        Важная информация
        
        При регистрации ЛП в соответствующей графе необходимо  указать, что ЛП участвует в проекте по маркировке, а также дату публикации не позже текущей. 
        3. Подайте заявку на получение описания в «Личном кабинете» системы мониторинга движения лекарственных препаратов для медицинского применения, и укажите в ней:
        
        - Идентификационный номер лекарственного препарата (GTIN);
        
        - Номер регистрационного удостоверения лекарственного препарата;
        
        - Дату государственной регистрации лекарственного препарата.
        
        
        
        Важная информация
        
        Сведения о номере и дате РУ, а также торговом наименовании ЛП из «ЮНИСКАН /ГС1 РУС» должны полностью соответствовать данным из государственного реестра лекарственных средств, включая знак ®, пробелы, дефисы и другие символы.
        
        
        4. Получите уведомление о создании карточки лекарственного препарата в «Личном кабинете» ИС МДЛП.
        
        Важная информация
        
        При регистрации ЛП в соответствующей графе необходимо указать, что ЛП участвует в проекте по маркировке, а также дату публикации не позже текущей.
        
        
        
        Как ввести лекарственный препарат в оборот?
        Пункты 1, 2 и 5 – сведения вносятся в систему только российскими производителями лекарственных препаратов, осуществляющими стадию «фасовка/упаковка ЛП во вторичную и/или третичную упаковку».
        
        Пункты 3 и 4 – сведения вносятся в систему только российскими производителями лекарственных препаратов, осуществляющими стадию «выпускающий контроль качества».
        
        1. Нанесите код маркировки на каждую потребительскую упаковку и передайте в систему мониторинга движения лекарственных препаратов для медицинского применения
        1) Дату совершения операции;
        
        2) ИНН/КПП российского производителя ЛП, осуществляющего стадию «фасовка/упаковка лекарственных препаратов во вторичную и/или третичную упаковку»;
        
        3) Адрес производственной площадки, осуществившей упаковку/фасовку во вторичную/третичную упаковку;
        
        4) Тип производственного заказа (собственное производство/ производство по договору);
        
        5) ИНН/КПП собственника ЛП (в случае производства по договору);
        
        6) Номер производственной серии;
        
        7) Дату истечения срока годности;
        
        8) Перечень уникальных идентификаторов вторичной (потребительской) упаковки лекарственных препаратов.
        
        
        Срок подачи сведений в систему мониторинга движения лекарственных препаратов для медицинского применения  – 5 рабочих дней, но до совершения следующих операций с товаром.
        
        
        2. После объединения ЛП в групповую упаковку нанесите код маркировки и направьте в ИС МДЛП:
        
        1) Дату совершения операции;
        
        2) ИНН/КПП российского производителя ЛП, осуществляющего стадию «фасовка/упаковка ЛП во вторичную и/или третичную упаковку»;
        
        3) Адрес места осуществления деятельности, где выполнена агрегация;
        
        4) Перечень уникальных идентификаторов третичной (заводской, транспортной) упаковки ЛП вышестоящего уровня, для каждого из которых в случае агрегирования первого уровня дополнительно указывается перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП. В случае агрегирования второго уровня указывается перечень уникальных идентификаторов третичной (заводской, транспортной), объединенных в данную группу.
        
        
        Срок подачи сведений в системе мониторинга движения лекарственных препаратов для медицинского применения – 5 рабочих дней, но до совершения следующих операций с товаром. 
        
        
        3. Произведите отбор контрольных и архивных образцов ЛП и направьте в ИС МДЛП:
        
        1) ИНН/КПП российского производителя ЛП, осуществляющего стадию «выпускающий контроль качества»;
        
        2) Тип вывода ЛП из оборота;
        
        3) Дату совершения операции;
        
        4) Перечень уникальных идентификаторов вторичной (потребительской) упаковки.
        
        
        Срок подачи сведений в систему мониторинга движения лекарственных препаратов для медицинского применения – 5 рабочих дней, но до совершения следующих операций с товаром. 
        
        
        4. Получите подтверждение соответствия готовой продукции установленным требованиям и введите ЛП в оборот, направив в ИС МДЛП:
        
        1) Дату совершения операции;
        
        2) ИНН/КПП российского производителя ЛП, осуществляющего стадию «выпускающий контроль качества»;
        
        3) Адрес производственной площадки, осуществляющей выпускающий контроль качества;
        
        4) Вид документа подтверждения соответствия (декларация о соответствии, сертификат соответствия);
        
        5) Регистрационный номер документа подтверждения соответствия;
        
        6) Дату регистрации документа подтверждения соответствия;
        
        7) Перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП и/или перечень уникальных идентификаторов третичной (заводской, транспортной) упаковки ЛП (в случае агрегирования потребительских упаковок ЛП).
        
        
        Срок подачи сведений в Систему мониторинга движения лекарственных препаратов для медицинского применения согласно текущей версии методических рекомендаций -  5 рабочих дней. 
        
        
        5. При передаче собственнику ЛП, произведенных подрядным способом, направьте в ИС МДЛП:
        
        1) Дату совершения операции;
        
        2) ИНН/КПП российского производителя ЛП, осуществляющего стадию «фасовка/упаковка ЛП во вторичную и/или третичную упаковку»;
        
        3) ИНН/КПП собственника ЛП;
        
        4) Адрес места осуществления деятельности собственника ЛП (если осуществляется перемещение ЛП на склад собственника);
        
        5) Реквизиты первичного документа, подтверждающего перемещение ЛП и счёт-фактуры (за исключением лиц, применяющих специальные налоговые режимы);
        
        6) Перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП и/или уникальных идентификаторов третичной (заводской, транспортной) упаковки ЛП.
        
        
        6. Если Вы собственник ЛП, произведенных подрядным способом, примите на склад ЛП и направьте в ИС МДЛП:
        
        1) Дату совершения операции;
        
        2) ИНН/КПП собственника ЛП;
        
        3) Реквизиты первичного документа, подтверждающего перемещение ЛП;
        
        4) Адрес места осуществления деятельности получателя;
        
        5) Перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП и/или уникальных идентификаторов третичной (заводской, транспортной) упаковки ЛП.
        
        
        В случае обнаружения несоответствий в предоставленных сведениях о совершении операции передачи ЛП собственнику, выпущенных в рамках оказания услуг по производству, информация из системы мониторинга движения лекарственных препаратов для медицинского применения направляется в уполномоченный орган для принятия решения о дальнейшем движении ЛП, в котором выявлены расхождения.
        
        Что делать при выводе из оборота лекарственных препаратов?
        При выводе ЛП из оборота направьте в систему мониторинга движения лекарственных препаратов для медицинского применения:
        
        1. Дату совершения операции;
        
        2. ИНН/КПП субъекта обращения;
        
        3. Адрес места осуществления деятельности;
        
        4. Тип вывода ЛП из оборота:
        
        - Розничная продажа;
        - Отпуск по льготному рецепту;
        - Использование при оказании медицинской помощи;
        - Уничтожение;
        - Прочее.
        5. Реквизиты первичного документа в зависимости от выбора типа вывода ЛП из оборота:
        
        - № кассового чека (розничная продажа);
        - № и дата регистрации льготного рецепта (отпуск по льготному рецепту);
        - Реквизиты накладной на перемещение ЛП в отделения (использование при оказании медицинской помощи);
        - Реквизиты договора и акта передачи на уничтожение;
        - Реквизиты первичного документа, подтверждающего вывод ЛП из оборота (прочее).
        6. Стоимость – указывается в случае выбора типа вывода ЛП из оборота «Розничная продажа», в случае выбора типа вывода ЛП из оборота «Отпуск по льготному рецепту» – указывается при наличии;
        
        
        Шаги 7 и 8 – в случае выбора типа вывода ЛП из оборота «Уничтожение»
        
        7. ИНН/КПП организации, осуществляющей уничтожение;
        
        8. Адрес места осуществления деятельности по уничтожению ЛП.
        
        В случае истечения сроков годности ЛП их реализация автоматически блокируется в системе мониторинга движения лекарственных препаратов для медицинского применения .
        
        
        9. Перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП и/или уникальных идентификаторов третичной (заводской, транспортной) упаковки ЛП.
        Какие действия регистрировать в системе при перемещении лекарственных препаратов?
        1. При отгрузке ЛП со склада направьте в систему мониторинга движения лекарственных препаратов для медицинского применения  следующие сведения в отношении каждой упаковки:
        
        
        1) Дату совершения операции;
        
        2) Тип операции отгрузки:
        
        - Реализация;
        
        - Возврат поставщику.
        
        3) ИНН/КПП отправителя;
        
        4) Адрес места осуществления деятельности отправителя;
        
        5) ИНН/КПП получателя;
        
        6) Адрес места осуществления деятельности получателя;
        
        7) Источник финансирования:
        
        - Бюджетный;
        
        - Внебюджетный.
        
        8) Реквизиты первичного документа, подтверждающего переход права собственности и счет-фактуры (за исключением субъектов, применяющих специальные налоговые режимы);
        
        9) Цену реализации, в рублях;
        
        10.1) Перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП и/или уникальных идентификаторов третичной (заводской, транспортной) упаковки ЛП.
        
        Срок подачи сведений в Систему мониторинга движения лекарственных препаратов для медицинского применения  – 5 рабочих дней, но до совершения следующих операций с товаром.
        
        
        ИЛИ
        
        10.2) GTIN;
        
        11. В случае выбора шага 10.2 – подтвердить перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП и/или уникальных идентификаторов третичной (заводской, транспортной) упаковки ЛП, полученный в ИС МДЛП от покупателя.
        
        
        2. При приемке ЛП направьте в ИС МДЛП следующие сведения в отношении каждой упаковки:
        
        
        1) Дату совершения операции;
        
        2) ИНН/КПП продавца;
        
        3) ИНН/КПП покупателя;
        
        4) Тип операции приемки:
        
        - Поступление;
        
        - Возврат от поставщика.
        
        5) Адрес места осуществления деятельности покупателя;
        
        6) Реквизиты первичного документа, подтверждающего переход права собственности и счет-фактуры (за исключением субъектов, применяющих специальные налоговые режимы);
        
        7) Цену приобретения, в рублях;
        
        8) Перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП и/или уникальных идентификаторов третичной (заводской, транспортной) упаковки ЛП.
        
        Срок подачи сведений в Систему мониторинга движения лекарственных препаратов для медицинского применения   – 5 рабочих дней, но до совершения следующих операций с товаром.
        
        
        3. При перемещении ЛП между адресами осуществления деятельности (согласно лицензии) без перехода права собственности направьте в ИС МДЛП:
        
        
        1) Дату совершения операции;
        
        2) ИНН/КПП субъекта обращения;
        
        3) ИНН/КПП покупателя;
        
        4) Адрес места осуществления деятельности отправителя;
        
        5) Адрес места осуществления деятельности получателя;
        
        6) Реквизиты первичного документа, подтверждающего внутреннее перемещение ЛП;
        
        7) Перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП и/или уникальных идентификаторов третичной (заводской, транспортной) упаковки ЛП.
        
        Как ввезти лекарственные препараты на территорию РФ?
        Шаги 1, 2 и 3 – сведения вносятся в систему только представительством иностранного держателя регистрационных удостоверений ЛП и/или иностранным держателем регистрационных удостоверений ЛП.
        
        Шаги 4 и 5 – сведения вносятся в систему только импортером (организацией оптовой торговли).
        
        1. Направьте сведения в Систему мониторинга движения лекарственных препаратов для медицинского применения  о завершении стадии «выпускающий контроль качества ЛП (выпуск готовой продукции)»:
        
        - Дату совершения операции;
        
        - ИНН/КПП представительства иностранного держателя регистрационных удостоверений ЛП или индикатор иностранного держателя регистрационных удостоверений ЛП;
        
        - Наименование производителя ЛП, осуществляющего стадию «выпускающий контроль качества»;
        
        - Адрес производственной площадки, осуществляющей выпускающий контроль качества;
        
        Номер производственной серии;
        
        - Дату истечения срока годности;
        
        - Перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП.
        
        
        Срок подачи сведений в Систему мониторинга движения лекарственных препаратов для медицинского применения  – 5 рабочих дней, но до совершения следующих операций с товаром.
        
        
        2. Направьте сведения в ИС МДЛП о результате выполнения операции агрегирования:
        
        - Дату совершения операции;
        
        - ИНН/КПП представительства иностранного держателя регистрационных удостоверений ЛП или индикатор иностранного держателя регистрационных удостоверений ЛП;
        
        - Адрес места осуществления деятельности, где выполнена агрегация;
        
        - Перечень уникальных идентификаторов третичной (заводской, транспортной) упаковки ЛП вышестоящего уровня, для каждого из которых в случае агрегирования первого уровня дополнительно указывается перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП, в случае агрегирования второго уровня указывается перечень уникальных идентификаторов третичной (заводской, транспортной), объединенных в данную группу.
        
        
        Срок подачи сведений в Систему мониторинга движения лекарственных препаратов для медицинского применения   – 5 рабочих дней, но до совершения следующих операций с товаром.
        
        
        3. Сообщите сведения в ИС МДЛП о направлении ЛП в Российскую Федерацию:
        
        - Дату совершения операции;
        
        - ИНН/КПП представительства иностранного держателя регистрационных удостоверений ЛП или индикатор иностранного держателя регистрационных удостоверений ЛП;
        
        - ИНН/КПП (или индикатор) и название продавца ЛП;
        
        - ИНН/КПП и название покупателя ЛП;
        
        - Адрес грузоотправителя;
        
        - Отпускную цену производителя;
        
        - Перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП и/или перечень уникальных идентификаторов третичной (заводской, транспортной) упаковки ЛП.
        
        Срок подачи сведений в Систему мониторинга движения лекарственных препаратов для медицинского применения   – 5 рабочих дней, но до совершения следующих операций с товаром.
        
        
        4. Направьте сведения в ИС МДЛП о регистрации сведений о ввозе ЛП на таможенную территорию Российской Федерации и размещении в зоне таможенного контроля, а также в случае перемещения ЛП между складами временного хранения (таможенными складами):
        
        - Дату совершения операции;
        
        - ИНН/КПП импортера;
        
        - ИНН/КПП (или индикатор) и название Продавца ЛП;
        
        - Адрес грузоотправителя;
        
        - Адрес склада временного хранения (таможенного склада);
        
        - Отпускную цену производителя;
        
        - Перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП и/или уникальных идентификаторов третичной (заводской, транспортной) упаковки ЛП.
        
        
        Срок подачи сведений в Систему мониторинга движения лекарственных препаратов для медицинского применения  – 5 рабочих дней, но до совершения следующих операций с товаром.
        
        
        5. После выпуска ЛП для внутреннего потребления на территории Российской Федерации осуществите операцию по отбору контрольных образцов ЛП, получивших подтверждение соответствия и направьте в ИС МДЛП:
        
        - Дату совершения операции;
        
        - ИНН/КПП импортера;
        
        - Тип вывода из оборота;
        
        - Вид документа подтверждения соответствия; 
        
        - Декларация о соответствии;
        
        - Сертификат соответствия;
        
        - Регистрационный номер документа подтверждения соответствия;
        
        - Дату регистрации документа подтверждения соответствия;
        
        - Номер документа, подтверждающего выпуск ЛП для внутреннего потребления;
        
        - Перечень уникальных идентификаторов вторичной (потребительской) упаковки ЛП. 
                """
    )


@dp.message_handler(commands=['automation'])
async def automation(message: types.Message):
    await message.reply(
        """
        Автоматизируемые процессы и регистрация сведений в ИС МДЛП
        Как и когда импортеры должны маркировать товар?
        Маркировка лекарственных препаратов осуществляется путем нанесения кода на вторичную (потребительскую) упаковку в рамках осуществления производственной стадии упаковки/фасовки производителем лекарственных средств.
        
        Как изменятся логистические процессы после внедрения маркировки?
        Логистические процессы при правильно выстроенной в компании методологии станут быстрее, более автоматизированными и, как следствие, приведут к оптимизации затрат субъекта обращения лекарственных средств на эти процессы. Бизнес сможет существенно экономить на логистике: при внедрении полной прослеживаемости товаров получение производителем или логистической компанией актуального статистического материала о географии, интенсивности, сезонности продаж позволит перестроить логистические схемы, оптимизировать поставки и складские запасы. По разным оценкам, оптимизация структуры поставок, предсказуемость спроса, возможность распределения маркетинговых усилий позволит компаниям экономить минимум 10-12% от затрат только по этим статьям.
        
        Будет ли в системе запрет на перемещение или реализацию товара с истекшим сроком годности?
        В выбытии товаров с истекшим сроком годности, за исключением случаев их возврата поставщику или утилизации, ограничения, безусловно, будут.
        
        Могут ли содержаться данные sGTIN и SSCC в одном сообщении одновременно?
        Да, данные об sGTIN и SSCC могут содержаться одновременно в следующих сообщениях:
        — о выпуске готовой продукции (313 схема);
        — об отгрузке ЛП собственнику (381 схема);
        — об отгрузке ЛП в Российскую Федерацию (331 схема);
        — о ввозе ЛП в Российскую Федерацию (332 схема);
        — о результатах таможенного оформления (335 схема);
        — о приемке ЛП на склад импортера (341 схема);
        — об отгрузке ЛП со склада отправителя (415 схема);
        — о приемке ЛП на склад получателя (416 схема);
        — о перемещении ЛП между различными адресами осуществления деятельности (431 схема);
        — об отгрузке ЛП на незарегистрированное место деятельности (441 схема);
        — о передаче ЛП на уничтожение (541 схема) и об уничтожении ЛП (542 схема);
        — о выводе из оборота ЛП по различным причинам (552 схема);
        — об отзыве отправителем переданных получателю ЛП (251 схема);
        — об отказе получателя от приемки ЛП (252 схема);
        — о подтверждении (акцептования) сведений (701 схема).
        Возможна ли ситуация, когда отправитель отправил SSCC коды в 381 сообщении, а контрагент получил от ИС МДЛП всё «дерево» кодов с вложением?
        Уведомление об отгрузке лекарственных препаратов, которое получит контрагент – собственник лекарственных препаратов (603 сообщение) формируется на основании исходного документа, отправленного контрактным производителем (381 сообщение) и будет содержать набор кодов SSCC/SGTIN, идентичный указанным в исходном сообщении.
        Все уведомления, которые система мониторинга движения лекарственных препаратов для медицинского применения направляет контрагенту, в точности содержат сведения из исходных сообщений от Отправителя, которые были успешно обработаны.
        
        В течение какого времени после отправки сообщения (381, 252, 701) другой контрагент получит уведомление (603, 606, 607 соответственно)?
        Система мониторинга движения лекарственных препаратов для медицинского применения оперативно направляет уведомления. Обычно это занимает не более нескольких минут.
        
        Можно ли при приёмке по SSCC без расхождений сразу сформировать и отправить отчёт 701, а по SSCC с расхождениями использовать др. виды отчётов?
        Отчеты о приемке в формате 701 сообщений допускается отправлять как частями, так и в отношении части полученной партии товара по результатам приемки.
        
        Требуется ли формировать и передавать какой-либо отчёт при отправке «излишка» обратно отправителю, учитывая, что в ИС МДЛП SSCC коды всё ещё «значатся» у отправителя?
        Если SSCC «значатся» у отправителя, в системе мониторинга движения лекарственных препаратов для медицинского применения могут быть зарегистрированы следующие сведения на выбор:
        — об отзыве отправителем переданных получателю ЛП (251 схема);
        — об отказе получателя от приемки ЛП (252 схема).
        Порядок регистрации сведений определяется участниками самостоятельно согласно внутренним правилам и процедурам, а также в соответствии с условиями договоров поставки.
        
        Какое сообщение оформляется в случае «недостачи» товара (кодов в 603 отчёте больше, чем товара по факту)? Удаляются ли в ЛК получателя сведения о «лишних» товарах.
        В данном случае получателем может быть оформлен оформляется «отказ получателя от приёмки ЛП» по схеме 252 в отношении кодов, которые заявлены в 603 сообщении, но не имеются по факту.
        В ЛК участника содержатся сведения только о ЛП, приемка которых подтверждена получателем (в рамках 701 сообщения).
        
        Можно ли применить схему обратного акцептования при передаче от контрактной площадки собственнику?
        Передача от контрактной площадки собственнику возможна только прямым способом (схема 381).
        
        С какой целью применяется отчёт 251 – отзыв отправителем переданного товара?
        Данный отчет применяется отправителем для отзыва неакцептованных получателем ЛП с целью возврата на свой баланс в свой ЛК неверно переданных кодов.
        
        Что делать при обнаружении брака при приемке ЛП и о намерении вернуть его отправителю? Направить сообщение по схеме 252 «Отказ от приемки» или необходимо принять товар, а затем сделать обратную отгрузку?
        Порядок возврата бракованных ЛП определяется участником самостоятельно согласно внутренним правилам и процедурам, а также в соответствии с условиями договоров поставки.
        
        Кто должен делать вывод из оборота при утере товара в процессе перевозки? Отправитель или получатель?
        Порядок вывода из оборота при утере товара в процессе перевозки регламентируется условиями договоров поставки, определяющими в т.ч. порядок перехода права собственности на товар и ответственность за транспортировку товара.
        
        Как добавить адрес места осуществления деятельности организации?
        Адреса мест осуществления деятельности участников, зарегистрированных в системе мониторинга движения лекарственных препаратов для медицинского применения, поступают в указанную систему в составе лицензий на производство лекарственных средств, на осуществление фармацевтической или медицинской деятельности.
        В случае, если адрес, указанный в лицензии, поступил в формате ФИАС и корректен, то Вам необходимо его добавить в разделе «Профиль» - «Места осуществления деятельности» личного кабинета участника.
        Если адрес, указанный в лицензии, поступил без кода ФИАС или не может быть определен в адресной системе, то участнику будет предложено указать код ФИАС самостоятельно. При этом необходимо ввести код ФИАС, наиболее соответствующий адресу, указанному в лицензии, с максимально возможной детализацией. Детализация кода ФИАС может быть ниже, чем детализация адреса, указанного в лицензии (например, в лицензии детализация до дома, а в ФИАС до улицы). Минимально необходимая детализация указываемого участником кода ФИАС – населенный пункт.
        Нужно ли передавать сведения о внутреннем перемещении лекарственных препаратов между двумя аптеками одной организации, находящимися в разных помещениях одного здания (например, в одном крупном торговом центре)?
        Места осуществления деятельности в системе мониторинга движения лекарственных препаратов для медицинского применения регистрируются на основании связки идентификатора организации и адреса места осуществления деятельности согласно лицензии. В связи с чем, передавать сведения о перемещении лекарственных препаратов между такими аптеками не нужно, так как для системы мониторинга движения лекарственных препаратов для медицинского применения это будет движение внутри одного места осуществления деятельности.
        
        Будут ли являться участниками оборота лекарственных препаратов логистические склады, склады ответственного хранения, транспортные компании?
        Компании, осуществляющие логистические функции, ответственное хранение, а также транспортные фирмы в рамках текущей реализации не считаются участниками оборота. При помещении товара на ответственное хранение в другую организацию компания сообщает о нем в ИС маркировки как об операции внутреннего перемещения с одного адреса на другой, потому что право собственности на товар не перешло и для системы он продолжает находиться в зоне ответственности собственника такого товара.
        
        Если аптека не зарегистрирована в ИС МДЛП, то, как ей нужно принимать и реализовывать промаркированный товар?
        Если аптека не является зарегистрированным пользователем системы мониторинга движения лекарственных препаратов для медицинского применения, она продолжает работать по-прежнему. Зарегистрированные участники эксперимента благодаря соответствующему функционалу сообщать о том, что реализуют лекарственные препараты не зарегистрированному в системе участнику оборота (как отдельный вид вывода товара из оборота).
        
        Может ли отправитель, в случае выявления «излишка продукции», отправить дополнительный отчёт 381, в котором будут присланы SSCC коды «излишков» в дополнение к уже указанным в 603 отчёте?
        Да, можете.
        """
    )