from aiogram import types

from loader import dp


@dp.message_handler(commands=['for_whom'])
async def for_whom(message: types.Message):
    await message.reply(
            """
            Как осуществляется ввоз импортного товара, подлежащего обязательной маркировке
            Согласно Рекомендованный алгоритм по ввозу на территорию РФ импортного товара из стран вне ЕАЭС (pdf, 261 Кб)
            Какая обувь подлежит маркировке?
            Согласно Постановлению Правительства РФ № 860 от 5 июля 2019 года «Об утверждении правил маркировки обувных товаров средствами идентификации», маркировке подлежат обувные товары согласно кодам товарной номенклатуры:
            ТН ВЭД ЕАЭС: 6401, 6402, 6403, 6404, 6405
            ОКПД2: 15.20.11, 15.20.12, 15.20.13, 15.20.14, 15.20.21, 15.20.29, 15.20.31, 15.20.32, 32.30.12
            
            Сколько стоит код маркировки за единицу товара?
            Постановлением Правительства РФ от 08.05.2019 № 577 утверждена плата за оказание услуг по предоставлению кодов маркировки, необходимых для формирования средств идентификации и обеспечения мониторинга движения товаров, подлежащих обязательной маркировке средствами идентификации в размере 50 копеек (без НДС). Цена включает формирование кода маркировки и предоставление его участнику оборота товара (УОТ) с использованием личного кабинета или с использованием интеграции системы маркировки с учетной системой УОТ (1С.Предприятие, SAP и пр. ERP). Стоимость не зависит от количества заказываемых кодов маркировки на товары, она неизменна.
            
            Где зарегистрироваться, на каком сайте для маркировки товаров?
            Участнику оборота товаров, который реализует товары подлежащие обязательной маркировке, необходимо зарегистрироваться на сайте Честныйзнак.рф в Государственной информационной системы мониторинга на сайте. Иные сайты, которые предлагают зарегистрироваться в Государственной информационной системы мониторинга не являются официальными. Просим Вас внимательно отнестись к регистрации в системе.
            
            Что необходимо для регистрации в Государственной информационной системе мониторинга?
            Чтобы зарегистрироваться в Государственной информационной системе мониторинга Вам понадобится усиленная квалифицированная электронная подпись, полученная на представителя организации, действующего без доверенности, которую Вы можете получить в одном из аккредитованных в Министерстве цифрового развития, связи и массовых коммуникаций удостоверяющих центров. Список аккредитованных в Минкомсвязи удостоверяющих центров доступен на сайте Министерства цифрового развития, связи и массовых коммуникаций.
            
            Какое оборудование понадобится для работы с маркированным товаром?
            Для работы с маркированным товаром Вам понадобится из оборудования: усиленная квалифицированная электронная подпись, принтер, 2D сканер штрихкода, контрольно-кассовая техника (в случае если вы являетесь розничным продавцом). А также интеграция с Государственной информационной системы мониторинга (ГИС МТ). Интеграция между участниками оборота товаров и ГИС МТ происходит посредством открытого протокола API (описание методов находится в едином личном кабинете участника оборота товаров в разделе «Помощь»).
            
            Где найти инструкции по работе с Государственной информационной системой мониторинга?
            Инструкции по работе с Государственной информационной системой мониторинга (ГИС МТ) расположены на сайте.
            А также в едином личном кабинете ГИС МТ участник оборота товаров может ознакомиться с инструкциями в разделе «Помощь».
            
            Куда наносить коды маркировки на товаре?
            Согласно п. 49 Постановления Правительства РФ № 860 от 5 июля 2019 года «Об утверждении правил маркировки обувных товаров средствами идентификации» средство идентификации наносится на потребительскую упаковку, или на товары, или на товарные ярлыки обувных товаров. Средство идентификации наносится на каждую единицу товара.
            
            Срок действия КМ после того как КМ получен (забран) из системы управления заказами или напечатан?
            Срок действия кода маркировки бессрочен. В п.49 постановления Правительства Российской Федерации от 05.07.2019 г. № 860 указан срок 60 рабочих дней на забор и преобразование кода маркировки в средство идентификации из системы управления заказами.
            
            В течение какого времени обрабатывается заказ КМ в СУЗ?
            Для получения кодов маркировки необходимо создать и подписать заказ в станции управления заказами. Получение кодов маркировки участником оборота товаров проводится в режиме он-лайн после перехода заказа в статус «Доступен». Время изменения статуса заказа до «Доступен», в том числе время генерации полученных кодов маркировки в ГИС МТ, зависит от количества заказанных/полученных кодов маркировки и общей загруженности системы в момент оформления заказа (от нескольких секунд до 4 часов).
            
            Какой срок ввода кодов маркировки в оборот?
            Сведения о введении товара в оборот (сведения о кодах маркировки (КМ), нанесенных на товар) должны быть поданы до даты предложения данного товара с КМ к реализации (продаже).
            
            Подлежит ли маркировке ортопедическая обувь?
            В соответствии с Правилами маркировки обувных товаров средствами идентификации, утвержденными Постановлением Правительства РФ № 860 от 5 июля 2019 года «Об утверждении правил маркировки обувных товаров средствами идентификации» маркировке средствами идентификации подлежат товары, включаемые в товарные позиции 6401 — 6405 единой Товарной номенклатуры внешнеэкономической деятельности Евразийского экономического союза (далее — ТН ВЭД ЕАЭС).
            Ортопедическая обувь включена в товарную позицию 9021 ТН ВЭД ЕАЭС, согласно «Классификации отдельных товаров» — Ортопедическая обувь. ТKS.ru
            Ортопедическая обувь классифицируется в товарной позиции 9021 ТН ВЭД ТС при одновременном выполнении следующих условий:
            — ортопедическая обувь должна быть изготовлена по индивидуальной мерке, чтобы соответствовать форме деформированной ступни, ортопедическая обувь никогда не производится массовым способом;
            — данная обувь должна быть изготовлена главным образом из жесткой кожи, которая может быть усилена металлическим или пробковым каркасом, придающим обуви жесткость для исправления деформации ноги (ступни);
            — верх обуви не может состоять целиком из ремешков или полос;
            — ортопедическая обувь предназначена для исправления постоянной или временной деформации ступни или для облегчения боли при ходьбе.
            Обувь массового производства, внутренняя стелька которой имеет изогнутую форму, облегчающую боль при плоскостопии, классифицируется в соответствии с материалом верха и подошвы и способом изготовления в группе 64 ТН ВЭД ЕАЭС и подлежит маркировке.
            
            Нужно ли маркировать образцы обуви, которые были ввезены в РФ на выставку в качестве экспоната (образца)?
            Выставочные и экспериментальные образцы не находятся в обороте и не подлежат маркировке.
            
            Кто может зачислить денежные средства на счет участника оборота товаров?
            Пополнение лицевого счета в личном кабинете рекомендовано производить с расчетного счета организации. При переводе денежных средств с расчётного счета ИП/ЮЛ: денежные средства поступают на лицевой счет участника оборота в течение одного рабочего дня при условии, что поле «Назначение платежа» заполнено корректно. Также скорость зачисления денежных средств может зависеть от Вашего банка и дня перевода (будний/выходной день).
            Зачисление денежных средств, отправленных не с расчётного счёта, через мобильный банк или с помощью иных банковских переводов, занимают 2 рабочих дня.
            Пример поля «Назначение платежа»:
            Предоплата за оказание услуги по предоставлению кодов маркировки, ЛС 1******. В том числе НДС 20 % — здесь указывается сумма НДС;
            Если оплата производится с помощью мобильного банка или при посещении отделения банка, то для зачисления денежных средств на Ваш ЛС важно, чтобы обязательно был указан номер лицевого счёта и корректно оформлено поле «Назначение платежа».
            В случае некорректного заполнения платежного поручения, возврат будет произведен в период до семи календарных дней.
            
            Как идентифицировать утраченный/испорченный КМ?
            Идентификация кодов маркировки проводится силами участника оборота товаров. Идентифицировать утраченные/испорченные (не читается сканером) коды маркировки можно в процессе проведения инвентаризации. Идентифицированные коды маркировки, которые выявлены как утраченные/испорченные, далее необходимо списать или вывести из оборота в личном кабинете ГИС МТ.
            
            Что делать в случае возврата обуви без кода маркировки (утерян)?
            При возврате товаров с поврежденным средством идентификации либо без средства идентификации товаров (возможность идентифицировать товары отсутствует) участник оборота товаров осуществляет перемаркировку. Функционал перемаркировки будет доработан в одном из ближайших обновлений.
            
            Как удалить ТГ «Табак» в ЛК ГИС МТ, если ее не добавляли или другую ТГ, которая была добавлена по ошибке?
            В текущей реализации удаление ошибочно добавленной товарной группы в личном кабинете ГИС МТ не предусмотрено. Продолжайте работу в той товарной группе, участником оборота товаров которой Вы являетесь. В дальнейшем будет добавлен функционал удаления ошибочно добавленных товарных групп в рамках редактирования профиля организации.
            
            В какой момент необходимо предоставить сведения в ГИС МТ о вводе импортного товара в оборот?
            Для ввоза товара на территорию РФ налоговый резидент РФ (импортер) — первый собственник товара на территории РФ, являясь участником оборота товара и являясь действующим участником информационной системы мониторинга (ГИС МТ) заказывает коды маркировке в ГИС МТ. За пределами РФ наносит полученные КМ на товар (до прохождения таможенных процедур). При получении положительного решения о ввозе товаров на территорию РФ от ФТС, импортер подает сведения в ГИС МТ о вводе товаров в оборот.
            
            Какие ограничения на 1 заказ КМ (xml, АПИ, UI)?
            Максимальный размер Заявки на предоставление кодов маркировки (КМ) для одной товарной номенклатуры (для одного кода товара) составляет150 000 (сто пятьдесят тысяч КМ). Максимальное количество товарных номенклатур в заявке на предоставление кодов маркировки — 10 (десять). Максимальное количество хранимых заказов в личном кабинете (в станции управления заказами СУЗ — 100 (сто)).
            
            Какие ограничения по размеру распространяются на загрузочные файлы форматов csv/xml?
            Описание остатков (ГИС МТ):
            xml: ограничений не обнаружено (максимально 8 позиций)
            csv: ограничений не может быть (максимально 8 позиций)
            
            Ввод в оборот (ГИС МТ):
            xml: при вводе в оборот остатков товара ограничение:
            45 000 КМ или 130 000 строк, файл до 3 Мб.
            xml: при вводе в оборот товаров, произведенных в РФ ограничение:
            14 000 КМ или 110 000 строк, файл до 4 Мб.
            xml: при вводе в оборот товара, ввезенного в РФ ограничение:
            14 000 КМ или 100000 строк, файл до 4 Мб.
            csv: при вводе в оборот товара, ввезенного в РФ рекомендованное ограничение:
            150000 КМ
            
            Заказ КМ (СУЗ):
            csv: для загрузки серийных номеров ограничений не обнаружено:
            1 заказ — 10 кодов товара с указанием пользовательских ИСН (индивидуальные серийные номера) по 150000 КМ на 1 код товара
            xml: ограничение: файл до 30Мб (710 000 КМ с указанием пользовательских ИСН). При автоматическом формировании серийных номеров ограничение на 1 заказ — 1 500 000 КМ.
            
            Какие действия предпринять при недостаче товара?
            При выявлении недостачи маркированного товара необходимо подать сведения о выводе данного товара из оборота в ГИС МТ согласно Постановлению Правительства Российской Федерации от 05.07.2019 № 860 «Об утверждении Правил маркировки обувных товаров средствами идентификации и особенностях внедрения государственной информационной системы мониторинга за оборотом товаров, подлежащих обязательной маркировке средствами идентификации, в отношении обувных товаров» (пункт 80).
            Для вывода товара из оборота Вы можете воспользоваться Руководством пользователя личного кабинета ГИС МТ участника оборота обувных товаров, видеоинструкцией на сайте Честныйзнак.рф. Отдельная инструкция о выводе товара из оборота также размещена в разделе «Помощь» личного кабинета ГИС МТ. Идентификация утраченных/испорченных кодов маркировки проводится силами участника оборота товаров в процессе проведения инвентаризации.
            
            Как осуществить вывод товара из оборота при онлайн-торговле?
            Курьерские компании и операторы почтовой связи до апреля 2021 года имеют право не указывать код идентификации (КИ) маркированного товара в кассовом чеке (подробно о выводе товара из оборота при дистанционном способе продажи в п. 81 Постановления Правительства Российской Федерации от 05.07.2019 № 860 «Об утверждении Правил маркировки обувных товаров средствами идентификации и особенностях внедрения государственной информационной системы мониторинга за оборотом товаров, подлежащих обязательной маркировке средствами идентификации, в отношении обувных товаров»). Поэтому если Ваша компания выводит товара из оборота дистанционным способом и осуществляет доставку с привлечением курьерской компании или оператора почтовой связи, и они не готовы включать КИ в чек, то необходимо подавать сведения о выводе товара из оборота в ГИС МТ напрямую, по факту отгрузки товара со склада для доставки конечному потребителю. Если курьерская компания готова включать КИ в чек или доставка осуществляется собственными силами продавца, то сведения о выводе из оборота по аналогии со стационарной розничной торговлей отправляются в ГИС МТ онлайн-кассой при формировании чека через ОФД, при этом КИ маркированного товара нужно включать только в чек, подразумевающий непосредственную передачу товара, а в чек на предоплату/аванс включать КИ не нужно. Если вывод из оборота по чеку осуществляет курьерская компания, то в ГИС МТ также необходимо подать сведения о передаче товара курьерской компании.
            Для вывода товара из оборота напрямую Вы можете воспользоваться Руководством пользователя личного кабинета ГИС МТ участника оборота обувных товаров на сайте Честныйзнак.рф. Отдельная инструкция также размещена и в разделе «Помощь» личного кабинета ГИС МТ и видеоинструкция.
            
            Что является первичным документом при подаче сведений через ЛК в ГИС МТ?
            Первичными документами являются: накладные, УПД и прочие документы в соответствии с требованиями, изложенными в нормативных актах, регламентирующих бухгалтерскую отчетность и Федеральным законом от 06.12.2011 N 402-ФЗ (ред. от 26.07.2019) «О бухгалтерском учете» (с изм. и доп., вступ. в силу с 01.01.2020).
            
            Как создать КИТУ?
            Участники оборота товаров, при необходимости, производят операцию агрегирования товаров (единиц и/или комплектов) в транспортные упаковки в КИТУ.
            КИТУ формируется в виде Serial Shipping Container Code (SSCC), который состоит из 18 символов в соответствии со структурой данных, предусмотренных ассоциацией GS1. Участник оборота товаров самостоятельно формирует код SSCC в соответствии с требованиями международных стандартов GS1.
            SSCC (Serial Shipping Container Code) — серийный код транспортной упаковки, представленный в виде цифрового номера, позволяет индивидуально маршрутизировать движение логистической единицы и автоматизировать транспортно-складские операции.
            SSCC присваивается логистической единице один раз и сопровождает её в течение всего цикла существования, пока единица не будет расформирована или изменена.
            Подробно о формировании SSCC описано в документе: http://www.gs1ru.org/wp-content/uploads/2017/02/Идентиф.-ключи-системы-GS1-SSCC-2015.pdf.
            При выполнении агрегирования маркированного товара участник оборота товаров подает в государственную информационную систему мониторинга за оборотом товаров (ГИС МТ) сведения об агрегации: КИТУ (Код идентификации транспортной упаковки) и список КИ (Код идентификации товара)/КИТУ, которые включены в агрегат (упаковку).
            Передача кодов идентификации транспортной упаковки участникам оборота товаров в ГИС МТ оплате не подлежит.
            После подачи сведении об агрегации в ГИС МТ, участник оборота товаров может указывать в документах только КИТУ, система автоматически определит, какие КИ/КИТУ включены в КИТУ.
            Подробная инструкция по предоставлению сведений об агрегировании товаров в транспортную упаковку в ГИС МТ размещена в: Руководстве пользователя личного кабинета ГИС МТ участника оборота обувных товаров на сайте Честныйзнак.рф, и в разделе «Помощь» личного кабинета ГИС МТ.
            
            При списании КМ, будут ли возвращаться ДС на ЛС?
            Если после генерации Оператором ГИС МТ кодов маркировки, они не были забраны участником оборота товаров из станции управления заказами в течение 60 рабочих дней, то данные коды маркировки будут аннулированы без списания денежных средств.
            
            Когда участник оборота товаров забрал коды маркировки из станции управления заказами, услуга считается оказанной Оператором. Возврата денег за оказанные Оператором услуги нет.
            
            Необходимо ли фиксировать перемещение маркированных товаров между магазинами/ складами в рамках одного юридического лица?
            При перемещении товара по складам внутри компании передавать данные в систему не нужно.
            
            Можно ли передать в одном УПД товары по разным ТГ и без маркировки?
            На текущий момент такой УПД, с включением в УПД кодов маркировки разных товарных групп (например, обувь и одежда) обработан не будет. Данный функционал будет реализован не ранее июля 2020 года. Пока рекомендуется делать отдельные УПД для разных ТГ. Также обращаем внимание на особенности работы с УПД через сторонний коммерческий ЭДО: данные о передаче кодов маркировки в УПД поступают в систему мониторинга ГИС МТ только после приемки этого УПД принимающей стороной. Если создается документ УПД (отгрузка с помощью УПД), то не нужно допускать одновременное создание документа отгрузки в личном кабинете ГИС МТ с тем же кодом маркировки. Можно использовать составной УПД (в одном документе и маркированный и немаркированный товар). Но если в УПД есть хотя бы один товар с кодом идентификации (маркированного товара), необходимо указывать в имени УПД признак «MARK». Система мониторинга ГИС МТ обработает этот УПД и выберет только товар с кодом идентификации и переместит код идентификации новому владельцу.
            
            Можно ли удалить документ в личном кабинете ГИС МТ?
            Удаление документов, в том числе обработанных с ошибкой, в личном кабинете ГИС МТ не предусмотрено. Наличие документов, обработанных с ошибкой, не накладывает дополнительных обязательств на участников оборота товаров. В случае необходимости, в разделе «Документы» можно настроить фильтр по значению «Статус», указав желаемый статус для отображения документов.
            
            Как узнать зарегистрирован ли контрагент в ГИС МТ для отгрузки маркированного товара?
            Уточнить статус регистрации контрагента в системе мониторинга можно одним из следующих способов:
            — непосредственно у участника;
            — при подаче сведений о передаче маркированных товаров в ГИС МТ в ручном режиме, в момент заполнения поля «ИНН получателя» у зарегистрированного в ГИС МТ участника оборота товаров автоматически заполняется поле «Наименование получателя».
            
            Обязательно использовать товароучетную систему для работы в ГИС МТ?
            Работа с товароучетной системой не регламентируется Оператором системы мониторинга. Решение о необходимости использования товароучетного программного обеспечения участник товарооборота принимает самостоятельно.
            При работе в товароучетной программе участник может провести ее интеграцию с личным кабинетом системы мониторинга самостоятельно или с помощью интегратора. Список интеграторов размещен на сайте ЧестныйЗнак.рф в разделе «Партнеры» интересующей товарной группы.
            
            Как посмотреть идентификатор участника (ID) стороннего ЭДО и ЭДО Лайт?
            Идентификатор участника электронного документооборота — это уникальный код, который оператор ЭДО присваивает отправителям и получателям электронных документов.
            Если Вы используете сторонний ЭДО, идентификатор участника Вы можете посмотреть в личном кабинете используемого ЭДО или уточнить у своего Оператора ЭДО.
            Идентификатор ЭДО Lite можно посмотреть в Вашем личном кабинете ГИС МТ в разделе «Пользователь» — «Профиль» на вкладке «Операторы ЭДО» в поле «ID участника».
            
            Почему повторная печать доступна только 48 часов?
            Данная функция реализована как дополнительная, для обеспечения возможности повторной печати кодов маркировки в случае различных сбоев на стороне участника оборота товаров при первичной печати. При реализации данной дополнительной функции Оператор системы мониторинга ГИС МТ принял решение установить ограничение для повторной печати в 48 часов.
            
            Возможно ли добавление пользователя в ЛК ГИС МТ для ИП?
            В текущей реализации участник оборота товаров ИП не может добавить пользователей в личном кабинете системы мониторинга. Данный функционал находится в проработке и запланирован к реализации.
         """

         )
