from aiogram import types

from loader import dp


@dp.message_handler(commands=['general_issues'])
async def general_issues(message: types.Message):
    await message.reply(
        """Как осуществляется ввоз импортного товара, подлежащего обязательной маркировке
Согласно Рекомендованный алгоритм по ввозу на территорию РФ импортного товара из стран вне ЕАЭС (pdf, 261 Кб)
Какие шины подлежат маркировке?
Маркировке подлежат только шины, соответствующие кодам ОКПД2 и ТН ВЭД ЕАЭС:
ОКПД2:
22.11.11 — Шины и покрышки пневматические для легковых автомобилей новые;
22.11.12.110 — Шины пневматические для мотоциклов, мотоколясок, мотороллеров, мопедов и квадрициклов;
22.11.13.110 — Шины и покрышки пневматические для автобусов, троллейбусов и грузовых автомобилей новые;
22.11.14 — Шины и покрышки пневматические для сельскохозяйственных машин; шины и покрышки пневматические прочие новые;
22.11.15.120 — Шины резиновые сплошные или полупневматические,

ТН ВЭД ЕАЭС:
4011 10 000 3 — Шины и покрышки пневматические резиновые новые для легковых автомобилей (включая грузопассажирские автомобили-фургоны и спортивные автомобили) с посадочным диаметром не более 16 дюймов;
4011 10 000 9 — Шины и покрышки пневматические резиновые новые для легковых автомобилей (включая грузопассажирские автомобили-фургоны и спортивные автомобили) прочие;
4011 20 100 0 — Шины и покрышки пневматические резиновые новые для автобусов или моторных транспортных средств для перевозки грузов с индексом нагрузки не более 121;
4011 20 900 0 — Шины и покрышки пневматические резиновые новые для автобусов или моторных транспортных средств для перевозки грузов с индексом нагрузки более 121;
4011 40 000 0 — Шины и покрышки пневматические резиновые новые для мотоциклов;
4011 70 000 0 — Шины и покрышки пневматические резиновые новые для сельскохозяйственных или лесохозяйственных транспортных средств и машин;
4011 80 000 0 — Шины и покрышки пневматические резиновые новые для транспортных средств и машин, используемых в строительстве, горном деле или промышленности;
4011 90 000 0 — Шины и покрышки пневматические резиновые новые прочие.

Все новые шины подлежат маркировке? Что делать с маркировкой резиновых камер, ободных лент, взаимозаменяемых протекторов?
В результате проведения эксперимента принято решение исключить из проекта маркировки несколько подгрупп. Не подлежат маркировке шины и покрышки новые велосипедные, шины и покрышки новые авиационные, а также камеры резиновые, ободные ленты, взаимозаменяемые протекторы.

Что делать с Б\У и восстановленными шинами?
Восстановленные и Б\У шины не маркируются. Правила торговли восстановленными и Б\У шинами остаются без изменений.

Как выглядит код маркировки? Из чего состоит код маркировки?
Код маркировки является буквенно-числовой последовательностью, преобразованной в формат двумерного штрихового кода DataMatrix, пример:

Код маркировки

В код маркировки включаются четыре группы данных: код товара, индивидуальный серийный номер, ключ проверки, код проверки. Ниже представлена структура кода маркировки:

Пример кода маркировки:
0104607428679090216eJIjoWH54DdU 91ffd0 92sz6kSPirApfMBftvLboE1dlWC/58hExQUqv7BBkZmk4=
Первые 2 символа «01» — идентификатор применения;
Следующие 14 символов «04607428679090» — код товара, GTIN;
Следующие 2 символа «21» — идентификатор применения;
Следующие 13 символов «6eJIjoWH54DdU» — уникальный серийный номер;
Следующий 1 символ « » — Group separator, разделитель, непечатаемый машиночитаемый символ, имеющий код 29 в таблице символов ASCII;
Следующие 2 символа «91» — идентификатор применения;
Следующие 4 символа «ffd0» — ключ проверки;
Следующий 1 символ « » — Group separator;
Следующие 2 символа «92» — идентификатор применения;
Следующие 44 символа «sz6kSPirApfMBftvLboE1dlWC/58hExQUqv7BBkZmk4=» — код проверки.

Шины для скутера, мопеда, инвалидных колясок подлежат маркировке?
Если данные шины попадают в перечень кодов ТНВЭД и ОКПД2, указанных в Постановлении Правительства РФ от 31.12.2019 № 1958, то они подлежат маркировке.

Как продавать колеса в сборе?
Шина, смонтированная на диск, является включенной в состав другого товара (колеса в сборе) и, соответственно, не подлежит маркировке. Вывод из оборота шины, как самостоятельного товара и включение ее в состав другого товара необходимо отразить в системе, как вывод из оборота для целей, не связанных с дальнейшей реализацией.

Как зарегистрировать в системе шину с камерой?
Код маркировки выпускается и наносится на шину независимо от того, укомплектована она в данный момент камерой, или нет.

Организация принимает автомобиль по trade-in с двумя комплектами шин, нужно ли маркировать второй комплект?
Б/У шины маркировке не подлежат.

Оборудование для генерации и эмиссии кодов навсегда предоставляется безвозмездно?
Оборудование или доступ к оборудованию для генерации и эмиссии кодов в соответствии с нормативными документами о системе маркировки предоставляется безвозмездно бессрочно.

Вход в ЛК будет только на компьютере, где установлена квалифицированная подпись?
Базовая регистрация осуществляется с электронной подписью единоличного исполнительного органа, т.е. лица имеющего права действовать без доверенности (например, генерального директора). После регистрации в системе доступен механизм добавления уполномоченных пользователей, то есть ответственных лиц предприятия, которые также должны иметь УКЭП для работы с системой.

Как в ГИС МТ отобразить информацию о перемещении шин между складами?
Миграция товаров по складам без смены ИНН (без смены собственника) возможна без передачи сведений в систему ГИС МТ. То есть передавать в систему информацию о движении товаров требуется в случае смены собственника в разрезе ИНН, а не в случае передачи между собственными торговыми или складскими точками в рамках одного юридического лица.

Является ли завод, покупающий шину для установки на диск и далее диск на автомобиль, участником оборота шин?
В случае, если завод покупает шины в РФ для использования их в целях, не связанных с последующей реализацией — а именно для включения в состав другого товара — не является участником оборота товара.

Есть ли возможность работы в тестовом режиме?
Для предоставления доступа к демо-системе Вам необходимо обратиться в службу поддержки support@crpt.ru.

Как стать партнером ЦРПТ и разместить информацию о нашем решении на на сайте ЧестныйЗнак.РФ?
Чтобы стать партнером ЦРПТ Вам необходимо направить заявку в свободной форме на адрес электронной почты partners@crpt.ru.

При отгрузке 100-200 шин покупателю время на проверку значительно возрастёт, готовы ли транспортные компании и водители ожидать приемку?
В случае так называемой «доверительной» приёмки передача маркированных шин не займет времени больше, чем передача немаркированных шин. При этом, безусловно, она несет те же риски пересортицы или недостачи товара, что и на текущий момент.

Кроме того, использование средств автоматизации обеспечивает полный контроль над передаваемыми кодами маркировки при незначительном увеличении времени приемки.

Будет ли на фискальном чеке печататься код маркировки?
Код маркировки указывается в электронной версии чека. В бумажной печатается только значок «[M]»."""
    )


@dp.message_handler(commands=['marking'])
async def marking(message: types.Message):
    await message.reply(
        """Какие методы маркировки существуют?
Основным видом маркировки шин является нанесение этикетки с двумерным штрих-кодом в формате DataMatrix. Конкретное место на шине для нанесения на сегодняшний день не регламентируется — в отрасли применяются решения с нанесением на протектор или на боковину. Дополнительно к этикетке (но не самостоятельно) средство идентификации также может быть нанесено на шины, например гравировкой, или внедрено в шины в виде радиочастотной метки (RFID-метка).

Примеры маркировки шин:
Пример маркировки шин	Пример маркировки шин	Пример маркировки шин
Что можно сделать для сохранности кода маркировки на шине?
На одной этикетке один и тот же код может быть нанесен несколько раз для увеличения сохранности и минимизации риска повреждения при длительном хранении или в логистических операциях.

Как мне выбрать метод маркировки? Какие материалы и принтеры использовать для печати этикеток?
Шины, в отличие от большинства других товарных групп, не имеют товарной упаковки, поэтому этикетка наносится непосредственно на изделие. В связи с различными химическими составами, используемыми в производстве шин, тип клея, обеспечивающего высокий уровень адгезии этикетки с шиной, подбирается индивидуально под продукцию каждого производителя. В то же время существуют и универсальные решения, которые подойдут для процессов маркировки остатков и перемаркировки. Ознакомиться с протестированными решениями и компаниями, предоставляющими релевантные материалы и оборудование для маркировки шин, Вы можете в разделе «Партнёры».

Что нужно для маркировки шин средствами идентификации?
В зависимости от роли участника оборота (производитель, импортер, оптовый или розничный дистрибьютор) применяются различные решения для маркировки, для крупных участников — производителей, импортеров — это может быть промышленный термотрансферный принтер и этикетки с особым клеевым составом, обеспечивающим сохранность средства идентификации на всех этапах движения шин по товаропроводящей цепи. В оптовом и розничном звене необходимости регулярной маркировки большого объема продукции нет, маркировка шин у таких участников оборота применяется только для маркировки остатков или перемаркировки товара с утраченной или поврежденной этикеткой. Таким участникам оборота, в зависимости от объемов и условий хранения и/или транспортировки шин, могут подойдут как малобюджетные, мобильные или стационарные принтеры этикеток, так и, в самых простых случаях, обычные офисные принтеры. С перечнем оборудования для маркировки можно ознакомиться у Ваших партнеров-поставщиков продукции или найти подходящую по профилю деятельности компанию в перечне партнеров ЦРПТ в соответствующем разделе.

Есть ли рекомендованные модели принтеров для печати этикеток со специальным клеем?
На сайте ЧестныйЗнак.рф представлен перечень интеграторов и поставщиков оборудования, которые помогут Вам определиться с выбором.

Есть четкие требования к самой этикетке?
В соответствии с Постановлением Правительства РФ № 1958 от 31.12.2019 г. средство идентификации не должно печататься на прозрачной оберточной пленке или каком-либо другом внешнем оберточном материале и перекрываться другой информацией. Кроме того, рекомендуемый размер этикетки составляет не менее 20×20 мм.

Что делать, если при печати КМ принтер даст сбой и КМ не напечатается?
Если при печати КМ произойдут неполадки с принтером, Вы можете повторно напечатать КМ — для этого предусмотрена соответствующая функциональность повторной печати в системе ГИС МТ, как с использованием личного кабинета, так и с использованием открытых протоколов API.""")


@dp.message_handler(commands=['registration'])
async def registration(message: types.Message):
    await message.reply(
        """Как узнать, что организация прошла регистрацию в честном знаке?
После регистрации на указанный адрес электронной почты вы получите подтверждение получения заявки на регистрацию Оператором ГИС МТ, а затем результат рассмотрения заявки в течение 24-х часов с подтверждением регистрации.
В случае, если письмо не поступило, вы можете самостоятельно проверить статус регистрации, указав номер вашей заявки на сайте https://markirovka.crpt.ru/ в разделе «Проверка регистрации ГИС МТ».

В ГИС МТ договоры с оператором необходимо подписывать в одном или двух экземплярах?
Договоры подписываются в личном кабинете только в электронном формате с использованием УКЭП индивидуального предпринимателя или лица, имеющего право действовать от имени юридического лица без доверенности. Бумажные формы договоров к подписанию не требуются. Перед подписанием договоров Вы можете выгрузить их из системы в формате pdf для согласования в утвержденном в Вашей компании порядке.

После регистрации в ЛК ГИС МТ, где необходимо указать информацию о GS1?
В момент регистрации Участника в Каталоге маркированных товаров (КМТ) происходит проверка на наличие членства Участника в Ассоциации ГС1 РУС.

1. Если УОТ на момент регистрации является членом ГС1 РУС, то на вкладке «Членство в ГС1 РУС», которая находится в профиле участника КМТ, отобразятся выданные УОТ ранее префиксы предприятия — GCP, а также GLN.
Также автоматически будут подгружены все карточки УОТ по маркированным группам товаров, начиная с 01.01.2010, которые впоследствии УОТ сможет либо «дообогатить» информацией, либо удалить из реестра.

2. Если УОТ НЕ является членом ГС1 РУС на момент регистрации, то в профиле участника КМТ отобразится форма заявки на членство, заполнив и подписав которую УОТ сразу же получит укороченный префикс предприятия с возможностью генерации до 100 GTIN/кодов товара.
А после уплаты членского взноса (для участников оборота маркированного товара действуют льготные условия членства), УОТ будет присвоен уже полноценный GCP с возможностью генерации до 1000 GTIN (или до 10000 GTIN по запросу в ГС1 РУС для УОТ с большей ассортиментной матрицей).
Наличие членства дает Участнику возможность генерировать коды и описывать товары в Российском диапазоне на полученный им префикс предприятия.

! Обращаем ваше внимание, что в случае, если УОТ описывает только импортные\глобальные GTIN (отличные от префикса 460-469), зарегистрированные иностранным владельцем товарного знака, то членство в российском представительстве ГС1 РУС не является обязательным условием для работы в ГИС МТ и КМТ.

Кто должен регистрироваться в системе маркировки - комиссионер или комитент?
В системе маркировки необходимо зарегистрироваться и комиссионеру, и комитенту — поскольку обе компании являются участниками оборота товара. При этом заказ кодов маркировки и ввод в оборот осуществляет комитент, далее передает маркированные шины комиссионеру."""
    )


@dp.message_handler(commands=['description'])
async def description(message: types.Message):
    await message.reply(
        """Как узнать код товара для создания карточки товара?
При маркировке товарных остатков (по сокращенному атрибутивному составу) — код товара (GTIN) присваивается системой автоматически.
При заведении карточки товара в каталоге маркированных товаров: можно использовать существующий международный GTIN — если он был создан производителем или правообладателем товарного знака, либо получить новый GTIN в системе ГС1 РУС, став участником системы GS1 (в профиле участника КМТ отобразится форма заявки на членство, заполнив и подписав которую УОТ сразу же получит укороченный префикс предприятия с возможностью генерации до 100 GTIN/кодов товара, подробнее в инструкции по описанию товаров в каталоге).

Что нужно указывать для полной маркировки товара?
Для регистрации шин по полному атрибутивному составу необходимо предоставить следующие сведения об обязательных атрибутах регистрируемых шин:
ИНН заявителя;
код товара (GTIN) (при наличии);
полное (приближенное к регистрационному) наименование товара;
четырехзначный код ТНВЭД;
товарный знак;
модель шины;
ширина профиля шины;
номинальное отношение высоты профиля шины к его ширине;
тип конструкции каркаса шины;
номинальный посадочный диаметр обода;
индекс нагрузки на шину, числовое значение;
категория скорости, буквенное обозначение;
сезонность (виды шин);
тип шины по способу герметизации.
В дополнение к обязательным сведениям участник оборота товаров может внести информацию в части необязательных атрибутов, описывающую потребительские свойства, рекомендации по эксплуатации и хранению шин, а также отражающие иную дополнительную информацию, с помощью которой можно демонстрировать преимущества своего товара (маркетинговое описание, уникальные характеристики, фотоизображения в разных ракурсах). Описание товара по необязательным атрибутам позволит партнерам и другим участникам логистической цепи использовать информацию в своих учетных системах, а конечным потребителям — получить наиболее полные сведения непосредственно от владельца данных.
Что нужно указывать для упрощенной маркировки остатков?
Для регистрации шин по упрощенному атрибутивному составу необходимо предоставить следующие сведения о регистрируемых шинах:
ИНН заявителя;
товарный знак (при наличии);
модель шины;
двузначный код товарной группы товарной номенклатуры (для маркировки шин код товарной номенклатуры — «40»).
Можно ли описать полным атрибутивным составом остатки?
Остатки товаров можно описать по полному атрибутивному составу. При этом можно сформировать техническую карточку товара, код товара в этом случае будет предоставлен оператором. При заказе кода маркировки в качестве способа выпуска товара в оборот необходимо выбрать «Маркировка остатков».

Также техническая карточка может быть сформирована для получения нового кода маркировки в случаях утери/порчи имеющегося или возврата товара с поврежденным кодом маркировки.

Возможно ли выгрузить из ГИС МТ коды товаров с описанием (бренд, модель, типоразмер)?
В подсистеме ГИС МТ в каталоге маркированных товаров реализована возможность выгрузки краткого и полного отчета по опубликованным карточкам товаров с указанием атрибутов.

Описание методов (product, short-product и feed-product) Вы можете посмотреть на сайте ЧестныйЗнак.РФ в разделе «Шины и покрышки» — «Документация в системе маркировки» — «Разработчикам» — «Описание API Каталога маркированных товаров».

После 1 марта возможно только полное описание товара с обязательным вступлением в ГС1 Рус?
После 1 марта 2021 года описывать товары возможно только по полному атрибутивному составу. Процедура описания остатков как по полному, так и по сокращенному атрибутивному составу, будет упразднена.

Если Вы описываете только импортные\глобальные GTIN (отличные от префикса 460-469), зарегистрированные иностранным владельцем товарного знака, то членство в российском представительстве ГС1 РУС не является обязательным условием для работы в ГИС МТ и КМТ.

Наличие членства дает Участнику возможность генерировать коды и описывать товары в Российском диапазоне GS1 на полученный им префикс предприятия.

Возможно ли использовать GTIN производителей для маркировки остатков шин?
Для маркировки товарных остатков Вы можете использовать как GTIN технического диапазона для описания товаров по полному и сокращенному атрибутивному составу, так и GTIN производителя для описания товара по полному атрибутивному составу.
При этом в случае использования GTIN производителя в российском диапазоне, полученных в сегменте ГС1Рус, необходимо воспользоваться инструментом субаккаунтов для получения права использования такого кода товара у производителя.

Для ввода в оборот немаркированных остатков нужно будет регистрироваться в Национальном каталоге?
Для маркировки и ввода в оборот товарных остатков используется соответствующий функционал системы (в меню слева: «Документы» — «Добавить» — «Описание остатков»).
С Национальным каталогом этот процесс не связан.

Возможно ли дублирование позиций товара, если другой участник оборота уже внес описание и можно ли это описание использовать другими участниками?
Да, в настоящее время допускается многократное создание экземпляров товарной карточки на одну и ту же модель шины разными участниками оборота.
Все эти экземпляры равносильны, и каждый из них может использоваться участником оборота, создавшим его, для эмиссии кодов на одну и ту же модель шины.
В будущем эту схему планируется заменить механизмом «субаккаунтов» — когда производителем или импортером будет создаваться одна товарная карточка шины, которая далее будет использоваться остальными участниками оборота после одобрения со стороны её «владельца».

Что такое техническая карточка товара?
Техническая карточка — карточка, создаваемая в Национальном каталоге маркируемых товаров, для возможности описания остатков товара с полным атрибутивным составом, а также для осуществления перемаркировки товаров.

Что такое модель шины?
Модель шины — торговое (коммерческое, фирменное) наименование, например, «Blizzak REVO 2», С-135 «Малахит», TS-03, Я-559, Scorpion Zero. Таким образом, модель шины — это условное словесное, цифровое, буквенное или комбинированное обозначение шины, относящееся к одной шине или к группе шин, объединенных общими конструктивными признаками."""
    )


@dp.message_handler(commands=['payment'])
async def payment(message: types.Message):
    await message.reply(
        """Сколько стоит код на единицу товара?
Постановлением Правительства РФ от 08.05.2019 № 577 утверждена плата за оказание услуг по предоставлению кодов маркировки, необходимых для формирования средств идентификации и обеспечения мониторинга движения товаров, подлежащих обязательной маркировке средствами идентификации в размере 50 копеек (без НДС). Цена включает формирование кода маркировки и предоставление его участнику оборота товара (УОТ) с использованием личного кабинета (получение кода в формате *.eps, *.csv или *.pdf) или с использованием интеграции системы маркировки с учетной системой УОТ (1С.Предприятие, SAP и пр. ERP). Минимальной партии нет.

Как происходит оплата за полученные коды маркировки?
Для оплаты кодов маркировки участнику оборота товара необходимо подписать договоры с Оператором в ГИС МТ и пополнить лицевой счет.
При получении (печати) сгенерированных кодов из Станции управления заказами деньги списываются со счета (50 копеек без учета НДС за один код маркировки)."""
    )


@dp.message_handler(commands=['ordering'])
async def ordering(message: types.Message):
    await message.reply(
        """Как происходит заказ кодов маркировки?
Заказ кодов маркировки импортером или производителем делается путем передачи в систему маркировки информации о планируемых к заказу кодах товара (кодах GTIN в системе GS1), количестве таких позиций и их серийных номерах, которые предоставляются в систему участниками оборота или генерируются автоматически. Система дополняет полученную информацию кодом криптозащиты и возвращает полный сформированный код маркировки в личный кабинет участника оборота либо в учетную систему участника оборота в формате CSV или PDF. Каждый код маркировки уникален для каждой единицы товара.

Каким способом осуществляется поставка кодов?
Запрос, формирование и передача кодов происходит в электронном виде с использованием WEB-интерфейса личного кабинета по адресу https://markirovka.crpt.ru или с использованием учетной системы участника оборота товара (1С, SAP, Oracle и другие ERP) при реализации интеграционных механизмов с системой маркировки.

Ограничен ли срок жизни кода маркировки?
Если код маркировки не преобразован в средство идентификации участником системы из заказа в личном кабинете, то срок хранения такого кода в Станции управления заказами составит 90 дней, после чего он автоматически аннулируется. Оплата такого кода не производится.

В случае, если участник оборота преобразовал код маркировки в средство идентификации, его срок действия не ограничен. Участник оборота вправе нанести средство идентификации на товар в любое время, при этом хранение кода маркировки в учетной системе или АСУТП участником возможно только в процессе производственного цикла.

Какое максимальное количество кодов я могу заказать за один раз?
В одном заказе может содержаться не более 10 GTIN по 150 000 КМ для каждого GTIN. Одновременно не может быть более 100 активных заказов.

Через какое время я получу код маркировки после заказа?
В течение 4 часов с момента регистрации заявки на получение кодов маркировки оператор ГИС МТ формирует (генерирует) указанное в заявке количество кодов маркировки.

Будет ли возможность запросить все коды, которые числятся за своим ИНН?
Да, в описании API ГИС МТ предусмотрен метод GET, позволяющий получить список КИ по заданному фильтру с подробной информацией о КИ.
Описание открытых протоколов API расположены на сайте ЧестныйЗнак.РФ в разделе «Шины и покрышки» — «Документация в системе маркировки» — «Разработчикам»."""
    )



@dp.message_handler(commands=['putting'])
async def putting(message: types.Message):
    await message.reply(
        """Обязательно ли указывать дату производства при вводе шины в оборот?
В соответствии с проектом Постановления Правительства РФ указывается год и неделя производства (при необходимости)."""
    )

@dp.message_handler(commands=['edf'])
async def edf(message: types.Message):
    await message.reply(
        """Обязательно ли использование сервиса ЭДО?
Да, использование инструментов электронного документооборота обязательно для осуществления функций передачи в систему сведений о приемке-передаче маркированных товаров.
Система предусматривает обеспечение прослеживаемости товаров. Прослеживаемость обеспечивается рядом механизмов, в том числе, для прослеживаемости перехода права собственности — передачей в систему информации о смене собственника с использованием УПД в электронном виде.
Рекомендуем ознакомиться с документом Методические рекомендации по оформлению электронных документов (УПД, УКД) (pdf, 736 Kb)

Какое значение должен принимать префикс имени файла обмена счета-фактуры в случае реализации по одному счету-фактуре товаров подлежащих и не подлежащих маркировке?
В одном Счете-фактуре возможно передавать маркированный и не маркированный товар. В случае занесении информации по маркированному товару, необходимо указать информацию о средстве идентификации, по немаркированному товару номера средств идентификации не заполняются.

Если в Счете-фактуре есть хотя бы один товар, подлежащий маркировке, в префикс имени файла необходимо добавить значение «MARK».

При формировании корректировочных документов (УКД или корректировочный счет) без изменения количества шин, нужно ли указывать КМ и отправлять документы в ГИС МТ?
Если в корректировочных документах количество шин не меняется, то «УКД» можно формировать без префикса «MARK» и в ГИС МТ отправлять документы не нужно.

Если УКД формируется с изменением количества шин, то меняется и количество кодов маркировки, следовательно в ГИС МТ необходимо передать информацию о скорректированных кодах маркировки.

Как в рознице осуществить возврат шин с кодом маркировки?
КМ нужно отсканировать и передать в кассу, далее выбить чек возврата.

Если используется онлайн-касса:
Надлежащее качество шины: оператор ФД передает КИ из чека в ГИС, ГИС возвращает товар в оборот
Ненадлежащее качество шины (брак):
— оператор ФД передает КИ из чека в ГИС, ГИС возвращает товар в оборот
— УОТ списывает товар с КИ через вывод из оборота (основание «Уничтожение»)
Если используется касса без передачи данных в ОФД:
Надлежащее качество шины: зайти в ЛК и выполнить процедуру возврата («Возврат в оборот» —> «Возврат при розничной реализации»)
Ненадлежащее качество шины (брак): никаких действий в ГИС не требуется
Можно ли в документах, в которых не фиксируется переход права собственности, не указывать префикс «МАРК» в имени файла?
Для движения кодов маркировки используется документ «УПД» с функцией СЧФДОП или ДОП.

Для корректировки ранее отправленных сведений используется документы Исправленный «УПД» или Корректировочный «УКД». В данных документах необходимо проставлять префикс «MARK» в имени файла. Префикс служит для идентификации документа, а именно «сообщает» что в документе присутствует информация о маркированном товаре (коды маркировки).

Если происходит выставление «УПД» на аванс, как правило, это «УПД» с функцией СЧФ, то префикс «MARK» у данного имени файла не проставляется.
Так же если выставляется «УПД» с функцией СЧФ (бух. документ, не фиксирует переход права собственности) префикс «MARK» проставлять не нужно.

Как в рознице осуществить возврат шин, если код маркировки не сохранился?
Необходимо выбить чек возврата (без КИ).
При этом, если шина в надлежащем качестве: делается перемаркировка в личном кабинете («возврат товара с повреждённым СИ/без СИ при розничной реализации»). Ввод в оборот в этом случае не требуется — поскольку он уже включен в функционал перемаркировки.
Если ненадлежащее качество шины (брак) — никаких действий в ГИС не требуется.

Как заполнять «Номер средств идентификации товаров» в УКД при недостаче, излишках?
При недостаче и излишках в УКД в «количество после» указывается количество фактически принятых шин и КМ.

Если покупатель — юридическое лицо купил шины для дальнейшей реализации, но не является участником системы, как продавцу правильно учесть данную реализации в системе?
В соответствии с п.2 Правил маркировки шин, утвержденных Постановлением Правительства от 31.12.1958 № 1958, юридическое лицо, покупающее шины для дальнейшей реализации, является участником оборота шин, и, следовательно, после даты введения обязательной маркировки должно быть зарегистрировано в качестве участника оборота в ГИС. Кроме того, после введения обязательной маркировки продавец в любом случае будет должен подать соответствующие сведения в ГИС. Если покупатель к этому моменту по какой-то причине не будет зарегистрирован в системе — коды передаваемых шин будут находиться в «режиме ожидания» регистрации покупателя, и сразу после его регистрации будут переведены на него. На данный момент для этого необходимо в ГИС оформить документ «Отгрузка» с указанием «Отгрузка неучастнику».

При частичном возврате шин, как отразить в УКД, что данные шины будут выведены из оборота?
При возврате шин УКД выставляется на уменьшение количества. После перехода КМ между участниками, конечный собственник товара выводит его из оборота (например, по причине брака).

Если покупатель-ЮЛ сказал, что будет использовать для собственных нужд, а сам в дальнейшем перепродал, кто несет ответственность за правдивость информации по дальнейшему использованию купленных шин: продавец или покупатель?
Продажа покупателю, декларирующему дальнейшее использование шин для собственных нужд, предполагает вывод шин из оборота — что и сделает продавец. С этого момента ответственность за дальнейший оборот шин, выведенных из оборота, лежит на покупателе.

При отгрузке товара в госструктуру мы обязаны обмениваться документами по ЭДО для передачи прав собственности?
Госструктура может не являться участником оборота товара. В связи с этим, они могут не быть зарегистрированы в ГИС МТ и могут не использовать ЭДО.

Вывести товар из оборота можно, сформировав документ «отгрузка» с указанием № и даты гос. контракта, № и даты первичного документа через ЛК в ГИС МТ или с передачей релевантной информации по протоколам API.

Как узнать, что право собственности на КМ перешло контрагенту?
Узнать был ли произведен переход права собственности КМ можно в ГИС МТ. При поступлении подписанного УПД от Оператора ЭДО осуществляется проверка корректности полученных сведений. При успешной проверке товары, принятые получателем, будут переведены к нему на баланс, соответственно, у отправителя их не будет на балансе.

Как в ГИС МТ поступает информация о реализации товара другому юридическому лицу?
Коды идентификации реализуемых шин перечисляются в УПД с признаком «MARK» в элементе «Контрольный идентификационный знак». После подписания УПД с обеих сторон (продавцом и покупателем) оператор ЭДО передает коды идентификации в ГИС МТ.

Какой формат будет применяться для УКД, содержащих в себе коды маркировок, при возвратах?
На сайте ЧестныйЗнак.РФ опубликованы Методические рекомендации по работе с УКД и иными формализованными документами."""
    )


@dp.message_handler(commands=['withdrawal'])
async def withdrawal(message: types.Message):
    await message.reply(
        """В какой срок необходимо передавать сведения о выбытии маркированной продукции в ГИС МТ?
При наличии договора с участником оборота шин оператор фискальных данных по поручению участника оборота шин, осуществляющего розничную продажу шин, осуществляет от имени указанного участника ежедневную передачу в режиме реального времени в ГИС МТ по каждой реализованной товарной единице шин.

При отсутствии договора с оператором фискальных данных обязанность по передаче сведений в ГИС МТ о выводе шин из оборота с применением контрольно-кассовой техники выполняется участником шин, осуществляющим их розничную продажу, не позднее 30 календарных дней со дня продажи шин.

При выводе шин из оборота по основаниям, не являющимся продажей в розницу, участник оборота шин, осуществляющий вывод шин из оборота, в течение 3 рабочих дней представляет сведения в ГИС МТ.

Как продавать маркированные шины в розницу?
Для продажи маркированных шин в розницу кассы магазинов должны быть оборудованы он-лайн кассой, соответствующей 54-ФЗ, и сканерами, считывающими коды маркировки в формате DataMatrix и передающими информацию о его выбытии из оборота через оператора фискальных данных, обслуживающего данную торговую точку. Более подробную информацию о необходимых оборудовании и его настройках Вы можете получить у своего оператора фискальных данных.

Как вывести шину из оборота в ГИС МТ при продаже юридическому лицу для собственного потребления?
Вывести товар из оборота через ГИС МТ можно сформировав документ «Вывод из оборота» с указанием причины «Использование для собственных нужд предприятия» через личный кабинет или с использованием протоколов API.

Как выводится товар из оборота в случае его продажи в счет стоимости ТС (например, как подарок от салона, указанный в спецификации)?
Описанный случай — это, согласно термину «вывод из оборота» Правил маркировки шин, «иная передача маркированных шин физическому лицу для личного потребления на основании договоров, предусматривающих переход права собственности на шины».

В ГИС МТ он реализован путем подачи в ГИС уведомления о выводе из оборота, причина пока указывается одна общая — «вывод из оборота для собственных нужд предприятия», перечень таких причин впоследствии будет расширен.

Релевантный метод API ГИС МТ вер. 17 — LK_RECEIPT, параметр action, комментарий ENTERPRISE_USE.

Возможно ли указывать среднескользящую стоимость при выводе из оборота с указанием себестоимости?
В соответствии с пп. «д» п.75 Постановления правительства РФ от 31.12.2019 № 1958 указывается цена реализации маркированных шин (с учетом налога на добавленную стоимость) согласно первичным документам. Иных вариантов нормативными документами не предусмотрено.


Оператор фискальных данных обязан передавать коды в ГИС МТ при наличии их в чеке или с ним нужно заключить дополнительное соглашение?
Оператор фискальных данных может передавать информацию в ГИС МТ по каждой реализованной товарной единице при наличии договора либо дополнительного соглашения к договору с участником оборота товаров.

"""
    )


@dp.message_handler(commands=['return_product'])
async def return_product(message: types.Message):
    await message.reply(
        """Что делать розничной точке в случае возврата маркированной продукции?
При возврате шин потребителем с неповрежденным средством идентификации, необходимо повторно ввести данный код в оборот инструментами ГИС МТ с указанием требуемых в Правилах маркировки шин сведений. При возврате шин с утраченным или поврежденным средством идентификации, необходимо произвести перемаркировку таких шин в порядке, установленном Правилами маркировки шин.

Что делать, если шина куплена для собственных нужд, но принято решение ее продать?
Если шина будет реализовываться как новая — необходимо осуществить возврат в оборот товара, который был выведен для собственных нужд. Процесс в разработке и будет доступен в системе во II кв. 2020 г.

Если шина будет реализовываться как Б/У, то такая шина не подлежит маркировке, соответственно нет необходимости в возврате в оборот."""
    )


@dp.message_handler(commands=['remarking'])
async def remarking(message: types.Message):
    await message.reply(
        """При перемаркировке товара старый КМ будет считаться выведенным из оборота?
При осуществлении перемаркировки товара в ГИС МТ, первый КМ автоматически изменит статус на «КМ выбыл», а новый КМ будет иметь статус «КМ в обороте»."""
    )

@dp.message_handler(commands=['aggregation'])
async def aggregation(message: types.Message):
    await message.reply(
        """Если товар пришел в упаковке с агрегированным кодом (палет из 40 шин), а мы продаваем в розницу поштучно. Нам нужно расформировать агрегированную упаковку и промаркировать каждую единицу из 40 штук?
Код агрегации содержит 40 индивидуальных кодов идентификации, входящих в агрегированную упаковку шин. После расформирования агрегата Вы сможете продавать шины поштучно, регистрируя в ГИС МТ действия с их индивидуальными кодами идентификации. Дополнительной перемаркировки не требуется.

Используется ли код агрегации в шинах?
В шинной отрасли агрегирование применяется довольно редко. Однако, при необходимости Вы можете объединить коды маркировки в код агрегации, воспользовавшись соответствующей функциональностью ГИС МТ.
Подробнее в инструкции: https://честныйзнак.рф/upload/(Агрегирование).pdf

Что такое код агрегации?
Код агрегации — это любой логистический код определенной длины (не менее 18 и не более 48 символов), соответствующий спецификации GS1-128:
https://www.gs1.org/standards/barcodes/1d-general-distribution
https://www.gs1.org/standards/gs1-logistic-label-guideline/1-3"""
    )

@dp.message_handler(commands=['documentation'])
async def documentation(message: types.Message):
    await message.reply(
        """Где можно увидеть список доступных API?
Описание открытых протоколов API и другая документация для разработчиков находится на сайте ЧестныйЗнак.РФ в разделе «Шины и покрышки» — «Документация в системе маркировки» — «Разработчикам».

Где можно увидеть перечень бизнес-процессов системы маркировки шин?
Бизнес-процессы системы маркировки шин находятся на сайте ЧестныйЗнак.РФ в разделе «Шины и покрышки» — «Документация в системе маркировки» — «Бизнес-процессы»."""
    )

@dp.message_handler(commands=['wholesale'])
async def wholesale(message: types.Message):
    await message.reply(
        """Как технически реализовать списание кода товара на кассе магазина, если весь товар на удаленном складе?
В данном случае возможны следующие варианты:
1. Грузчик получает заказ на подбор шин удаленно, сканирует и передает на кассу коды маркировки отобранных шин, эти коды вносятся в документы, которые передают клиенту. Далее клиент едет на склад и получает эти шины.
2. Грузчик оснащен портативной кассой со встроенным сканером штрих кодов и при выдаче товаров он считывает код маркировки, которые сразу попадают в чек.

Как проверять коды маркировки при получении маркированной продукции на склад?
При получении маркированной продукции рекомендуем считывать коды идентификации терминалом сбора данных, 2D сканером либо иными техническими средствами на предмет их соответствия кодам, указанным в документах поставки.

Как продавать маркированные шины через интернет-магазин?
В случае продажи маркированных шин через интернет-магазин без предоплаты, участнику оборота товаров (магазину) необходимо вывести товар из оборота, отсканировав коды маркировки и указав в системе причину вывода из оборота «Продажа по образцам, дистанционный способ продажи». После оплаты товара оформить чек полного расчёта на мобильной кассе с включенным кодом маркировки.
В случае продажи маркированных шин через интернет-магазин с предоплатой, участнику оборота товаров (магазину) необходимо при получении предоплаты выдать чек без указания кодов маркировки, вывести товар из оборота, отсканировав коды маркировки и указав в системе причину вывода из оборота «Продажа по образцам, дистанционный способ продажи». После доставки товара покупателю оформить чек полного расчёта на мобильной кассе с включенным кодом маркировки."""
    )

@dp.message_handler(commands=['importation'])
async def importation(message: types.Message):
    await message.reply(
        """Кто и где может осуществить маркировку импортных шин?
После эмиссии кодов маркировки импортеру необходимо передать коды маркировки производителю импортного товара либо логистическому оператору для нанесения их на шины.
Возможные места маркировки: на производстве, на транзитном складе, на консолидационном складе, на таможенном складе.

Когда нужно нанести коды маркировки на импортные шины?
Нанести коды маркировки на шины необходимо:
при ввозе с территории ЕАЭС — до пересечения государственной границы РФ
при ввозе из других стран — до помещения под таможенную процедуру выпуска для внутреннего потребления или реимпорта
Как указывать коды идентификации в таможенной декларации?
Основные правила указания кодов идентификации в таможенную декларацию:
1. В 31 графе таможенной декларации (ДТ) необходимо указывать коды идентификации (КИ) без символов разделителей, то есть КИ в ДТ должны соответствовать КИ, находящимся в ГИС МТ.
2. Недопустимо указывать КИ только в верхнем регистре. КИ являются регистрозависимыми, таким образом в 31 графе каждый символ КИ указывается в том регистре, в котором он хранится в системе ГИС МТ.
3. КИ не должны содержать лишние символы (скобки, символы экранирования и т.д.), если они не являются частью КИ. Разделять КИ необходимо " , " (то есть пробел-запятая-пробел).
4. Перед тем, как подать декларацию, необходимо удостовериться, что все КИ, КИТУ, указанные в ней, присутствуют в системе ГИС МТ. Статус КИ — «эмитирован.получен», статус КИТУ — «сформирован».

Как взаимодействует ФТС и ГИС МТ?
ФТС запрашивает информацию в ГИС МТ по статусу и владельцу КИ, КИТУ, указанных в таможенной декларации. Дальнейшие проверки проходят по внутреннему регламенту ФТС. А после подачи документа «Ввод в оборот» участником оборота в систему, ГИС МТ подает запрос в ФТС о коде решения от ФТС по данным КИ, КИТУ, на основании которого товар либо вводится в оборот, либо отказывается во вводе товара в оборот (в случае отрицательного решения ФТС).

Как осуществляется ввод в оборот импортных шин?
Процедура ввода товара в оборот при импорте осуществляется путем подачи документа «Ввод в оборот» участником оборота в систему после положительного решения от ФТС (в ГИС вводится номер и дата ДТ, полученной от ФТС). ГИС МТ подает запрос в ФТС и в зависимости от полученного кода решения от ФТС товар либо вводится в оборот, либо отказывается во вводе товара в оборот (в случае отрицательного решения ФТС).

Где можно ознакомиться с основными действиями по маркировке шин для импортеров?
На сайте ЧестныйЗнак.РФ в разделе «Маркировка шин и покрышек» — «Инструкции по работе в системе» размещена Инструкция по маркировке для импортера (pdf, 1,9 Мб), в которой Вы можете ознакомиться с основными действиями по маркировке.
Также в обучающем центре Честного Знака https://честныйзнак.рф/lectures/education/ собраны видео-уроки, инструкции и презентации по всем вопросам и процессам системы маркировки с разделение по типам участников.

Если импортер ввозит шины не для дальнейшей продажи, а для использования в собственных нуждах, нужно ли маркировать шины?
Шинны, ввозимые на территорию РФ импортером, должны быть промаркированы. Импортёр регистрируется в ГИС МТ, как участник оборота товаров, получает коды маркировки, маркирует шины, ввозит их на территорию РФ и вводит в оборот. Далее, если шины будут использоваться для собственных нужд — участник выводит их из оборота."""
    )


